{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/4_voting_county_radio.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2017, 17:22:25
{txt}
{com}. 
. global input "~/Google Drive/Mass Media/Lily/Data/"
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. global temp "~/Google Drive/Mass Media/Lily/Temp/"
{txt}
{com}. 
. use "${c -(}input{c )-}voting", clear
{txt}(ELECTORAL DATA FOR COUNTIES IN THE UNITED STATES: PRESIDENTIAL AND CONGRESSIONAL)

{com}. rename V2 county
{res}{txt}
{com}. rename V1 state_code
{res}{txt}
{com}. gen state = "" 
{txt}(3,393 missing values generated)

{com}. loc i = 1
{txt}
{com}. foreach var in CT ME MA NH RI VT {c -(}
{txt}  2{com}. replace state = "`var'" if state_code == `i'
{txt}  3{com}. loc i = `i' + 1
{txt}  4{com}. {c )-}
{txt}variable {bf}state{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8 real changes made)
(17 real changes made)
(15 real changes made)
(10 real changes made)
(6 real changes made)
(14 real changes made)

{com}. cap program drop state_assign
{txt}
{com}. program state_assign
{txt}  1{com}. syntax, num(string) states(namelist)
{txt}  2{com}. loc j = `num'
{txt}  3{com}. foreach var in `states' {c -(}
{txt}  4{com}. replace state = "`var'" if state_code == `j'
{txt}  5{com}. loc j = `j' + 1
{txt}  6{com}. {c )-}
{txt}  7{com}. end 
{txt}
{com}. 
. state_assign, num(11) states(DE NJ NY PA) 
{txt}(3 real changes made)
(21 real changes made)
(66 real changes made)
(69 real changes made)

{com}. state_assign, num(21) states(IL IN MI OH WI)
{txt}(104 real changes made)
(92 real changes made)
(88 real changes made)
(88 real changes made)
(78 real changes made)

{com}. state_assign, num(31) states(IA KS MN MO NE ND SD)
{txt}(102 real changes made)
(124 real changes made)
(99 real changes made)
(122 real changes made)
(104 real changes made)
(66 real changes made)
(94 real changes made)

{com}. state_assign, num(40) states(VA AL AR FL GA LA MS NC SC TX)
{txt}(191 real changes made)
(67 real changes made)
(77 real changes made)
(67 real changes made)
(162 real changes made)
(66 real changes made)
(85 real changes made)
(111 real changes made)
(48 real changes made)
(261 real changes made)

{com}. state_assign, num(51) states(KY MD OK TN)
{txt}(122 real changes made)
(26 real changes made)
(78 real changes made)
(101 real changes made)

{com}. state_assign, num(56) states(WV)
{txt}(55 real changes made)

{com}. state_assign, num(61) states(AZ CO ID MT NV NM UT WY)
{txt}(14 real changes made)
(65 real changes made)
(50 real changes made)
(62 real changes made)
(24 real changes made)
(32 real changes made)
(31 real changes made)
(25 real changes made)

{com}. state_assign, num(71) states(CA OR WA)
{txt}(64 real changes made)
(42 real changes made)
(47 real changes made)

{com}. drop if state == "" // Alaska and Hawaii 
{txt}(30 observations deleted)

{com}. order state, first
{txt}
{com}. isid state county
{txt}
{com}. replace county = lower(county)
{txt}(3,363 real changes made)

{com}. gen id_master = _n
{txt}
{com}. gen matching_char = county + " " + state
{txt}
{com}. 
. merge 1:1 state county using "${c -(}input{c )-}dma_county_crosswalk", keep(1 3) nogen keepusing(dma* state)
{res}{txt}{p 0 7 2}
(note: variable
state was 
str2, now str3 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
county was 
str17, now str28 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             416
{txt}{col 9}from master{col 30}{res}             416{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}           2,947{txt}  
{col 5}{hline 41}

{com}. save "${c -(}output{c )-}voting_clean", replace
{txt}file ~/Google Drive/Mass Media/Lily/Output/voting_clean.dta saved

{com}. ******************************************************
. merge 1:m state county using "${c -(}output{c )-}county_radio_compile"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,835
{txt}{col 9}from master{col 30}{res}           2,723{txt}  (_merge==1)
{col 9}from using{col 30}{res}             112{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,628{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. preserve
{txt}
{com}. keep if _merge == 3
{txt}(2,835 observations deleted)

{com}. drop _merge 
{txt}
{com}. save "${c -(}temp{c )-}merge_matched", replace
{txt}file ~/Google Drive/Mass Media/Lily/Temp/merge_matched.dta saved

{com}. restore
{txt}
{com}. 
. keep if _merge == 2
{txt}(8,351 observations deleted)

{com}. keep state county town year frequency station
{txt}
{com}. gen id_using = _n
{txt}
{com}. save "${c -(}temp{c )-}id_unmatched", replace
{txt}file ~/Google Drive/Mass Media/Lily/Temp/id_unmatched.dta saved

{com}. 
. gen matching_char = county + " " + state
{txt}
{com}. ** fuzzy match ** 
. matchit id_using matching_char using "${c -(}output{c )-}voting_clean.dta", idusing(id_master) txtusing(matching_char) override
Matching current dataset with ~/Google Drive/Mass Media/Lily/Output/voting_clean.dta
Similarity function: bigram
{res}Loading USING file: ~/Google Drive/Mass Media/Lily/Output/voting_clean.dta
{txt}(ELECTORAL DATA FOR COUNTIES IN THE UNITED STATES: PRESIDENTIAL AND CONGRESSIONAL)
{res}Indexing USING file.
0%
20%
40%
60%
80%
Done!
Computing results
{tab}Percent completed ...{tab}(search space saved by index so far)
{tab}20%{tab}{tab}  ...{tab}(67%)
{tab}40%{tab}{tab}  ...{tab}(61%)
{tab}60%{tab}{tab}  ...{tab}(62%)
{tab}80%{tab}{tab}  ...{tab}(63%)
{tab}Done!
Total search space saved by index: 63%
{txt}
{com}. gen state1 = substr(matching_char, -2, .)
{txt}
{com}. gen state2 = substr(matching_char1, -2, .)
{txt}
{com}. keep if state1 == state2
{txt}(581 observations deleted)

{com}. keep if similscore > .75
{txt}(38 observations deleted)

{com}. isid id_using
{txt}
{com}. merge 1:1 id_using using  "${c -(}temp{c )-}id_unmatched" 
{res}{txt}{p 0 7 2}
(note: variable
id_using was 
int, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               1
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               1{txt}  (_merge==2)

{col 5}matched{col 30}{res}             111{txt}  (_merge==3)
{col 5}{hline 41}

{com}. preserve
{txt}
{com}. keep if _merge == 2
{txt}(111 observations deleted)

{com}. save "${c -(}temp{c )-}final_unmatched", replace
{txt}file ~/Google Drive/Mass Media/Lily/Temp/final_unmatched.dta saved

{com}. restore
{txt}
{com}. keep if _merge ==3 
{txt}(1 observation deleted)

{com}. drop state1 state2 _merge id_using matching_char matching_char1 similscore
{txt}
{com}. rename county county_radio
{res}{txt}
{com}. merge m:1 id_master using "${c -(}output{c )-}voting_clean", keep(3) nogen
{res}{txt}{p 0 7 2}
(note: variable
id_master was 
int, now float to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             111{txt}  
{col 5}{hline 41}

{com}. drop county_radio  matching_char id_master
{txt}
{com}. append using "${c -(}temp{c )-}merge_matched"
{txt}(label V1 already defined)
(label V758 already defined)
(label V759 already defined)

{com}. drop town
{txt}
{com}. 
. bys station state county year: egen mean_freq = mean(frequency)
{txt}
{com}. replace frequency = mean_freq
{txt}(12 real changes made)

{com}. drop mean_freq 
{txt}
{com}. duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(8 observations deleted)

{com}. isid station state year county
{txt}
{com}. merge m:1 county state using "${c -(}output{c )-}voting_clean"
{res}{txt}(label V1 already defined)
(label V758 already defined)
(label V759 already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,713
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,713{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,731{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop matching_char  id_master _merge
{txt}
{com}.  
. gen station_num = 1 if station != ""
{txt}(2,713 missing values generated)

{com}. bys county state year: egen total_station = total(station_num)
{txt}
{com}. ** Merge to radio ownership for measuring crowd out, impact, etc
. merge m:1 state_code county using "${c -(}input{c )-}family_census_1930", keepusing(county state_code famtot totpop radiorep) keep(1 3) nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             262
{txt}{col 9}from master{col 30}{res}             262{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}           8,182{txt}  
{col 5}{hline 41}

{com}. 
. gen fraction_radio_fam = radiorep/famtot
{txt}(263 missing values generated)

{com}. save "${c -(}output{c )-}merged_radio_voting", replace
{txt}file ~/Google Drive/Mass Media/Lily/Output/merged_radio_voting.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/4_voting_county_radio.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2017, 17:22:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}