{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/5_scatter_plot.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Mar 2017, 12:10:55
{txt}
{com}. cd "~/Google Drive/Mass Media/Lily/Output/"
{res}/Users/lilyhoffman/Google Drive/Mass Media/Lily/Output
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. 
{txt}end of do-file

{com}. use "${c -(}ouput{c )-}panel_data", clear

. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. preserve
{txt}
{com}. 
. collapse (sum) radiorep famtot, by(first_dma)
{txt}
{com}. sort first_dma
{txt}
{com}. gen percent_radio = radiorep/famtot
{txt}
{com}. twoway scatter percent_radio first_dma, ysc(range(0 .5)) ylabel(0(.1).5) ytitle("Families Radio Ownership") xtitle("First Year Broadcasting in DMA") ///
>  title("Family Radio Ownership by DMA First Broadcasting Year") subtitle("1930 Census") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership", replace)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership.gph saved)

{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. preserve
{txt}
{com}. 
. collapse (sum) radiorep famtot, by(first_county)
{txt}
{com}. sort first_dma
{err}variable {bf}first_dma{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. preserve
{txt}
{com}. collapse (sum) radiorep famtot, by(first_county)
{txt}
{com}. sort first_county
{txt}
{com}. gen percent_radio = radiorep/famtot
{txt}
{com}. twoway scatter percent_radio first_county, ysc(range(0 .5)) ylabel(0(.1).5) ytitle("Families Radio Ownership") xtitle("First Year Broadcasting in DMA") ///
>  title("Family Radio Ownership by DMA First Broadcasting Year") subtitle("1930 Census") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership", replace)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership.gph saved)

{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. preserve
{txt}
{com}. 
. collapse (sum) radiorep famtot, by(first_dma)
{txt}
{com}. sort first_dma
{txt}
{com}. gen percent_radio = radiorep/famtot
{txt}
{com}. twoway scatter percent_radio first_dma, ysc(range(0 .5)) ylabel(0(.1).5) ytitle("Families Radio Ownership") xtitle("First Year Broadcasting in DMA") ///
>  title("Family Radio Ownership by DMA First Broadcasting Year") subtitle("1930 Census") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_dma", replace)
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_dma.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_dma.gph saved)

{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. preserve
{txt}
{com}. collapse (sum) radiorep famtot, by(first_county)
{txt}
{com}. sort first_county
{txt}
{com}. gen percent_radio = radiorep/famtot
{txt}
{com}. twoway scatter percent_radio first_county, ysc(range(0 .5)) ylabel(0(.1).5) ytitle("Families Radio Ownership") xtitle("First Year Broadcasting in County") ///
>  title("Family Radio Ownership by County First Broadcasting Year") subtitle("1930 Census") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_county", replace)
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_county.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership_county.gph saved)

{com}. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.                 {c )-}
{txt}
{com}.                 
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    90,256
{txt}{col 49}F({res}  32{txt},{res}  87119{txt}){col 67}= {res}   1519.33
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.8193
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8128
{txt}{col 49}Root MSE{col 67}= {res}    0.1061

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2} .0029661{col 26}{space 2}   .00515{col 37}{space 1}    0.58{col 46}{space 3}0.565{col 54}{space 4}-.0071278{col 67}{space 3}   .01306
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0029728{col 26}{space 2} .0073035{col 37}{space 1}   -0.41{col 46}{space 3}0.684{col 54}{space 4}-.0172877{col 67}{space 3} .0113421
{txt}inter_2_1924 {c |}{col 14}{res}{space 2} .0153489{col 26}{space 2} .0051257{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} .0053026{col 67}{space 3} .0253952
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0052938{col 26}{space 2} .0069829{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4}-.0189802{col 67}{space 3} .0083926
{txt}inter_2_1928 {c |}{col 14}{res}{space 2} .0290568{col 26}{space 2} .0051167{col 37}{space 1}    5.68{col 46}{space 3}0.000{col 54}{space 4}  .019028{col 67}{space 3} .0390856
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0093364{col 26}{space 2} .0069577{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-.0229734{col 67}{space 3} .0043006
{txt}inter_2_1932 {c |}{col 14}{res}{space 2} .0123941{col 26}{space 2} .0051079{col 37}{space 1}    2.43{col 46}{space 3}0.015{col 54}{space 4} .0023827{col 67}{space 3} .0224056
{txt}inter_2_1934 {c |}{col 14}{res}{space 2} .0163889{col 26}{space 2} .0069422{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0027822{col 67}{space 3} .0299955
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}  .018839{col 26}{space 2} .0051445{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0087558{col 67}{space 3} .0289221
{txt}inter_2_1938 {c |}{col 14}{res}{space 2} .0248658{col 26}{space 2} .0069424{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .0112588{col 67}{space 3} .0384729
{txt}inter_2_1940 {c |}{col 14}{res}{space 2} .0226207{col 26}{space 2} .0051336{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .0125588{col 67}{space 3} .0326825
{txt}inter_2_1942 {c |}{col 14}{res}{space 2} .0119775{col 26}{space 2} .0069796{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0017025{col 67}{space 3} .0256575
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1912  {c |}{col 14}{res}{space 2}-.1284344{col 26}{space 2} .0026606{col 37}{space 1}  -48.27{col 46}{space 3}0.000{col 54}{space 4}-.1336492{col 67}{space 3}-.1232196
{txt}{space 7}1914  {c |}{col 14}{res}{space 2}-.0083171{col 26}{space 2} .0029692{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.0141367{col 67}{space 3}-.0024975
{txt}{space 7}1916  {c |}{col 14}{res}{space 2} .1084489{col 26}{space 2} .0025795{col 37}{space 1}   42.04{col 46}{space 3}0.000{col 54}{space 4}  .103393{col 67}{space 3} .1135047
{txt}{space 7}1918  {c |}{col 14}{res}{space 2}-.0812863{col 26}{space 2} .0029722{col 37}{space 1}  -27.35{col 46}{space 3}0.000{col 54}{space 4}-.0871118{col 67}{space 3}-.0754607
{txt}{space 7}1920  {c |}{col 14}{res}{space 2} .0314333{col 26}{space 2} .0025981{col 37}{space 1}   12.10{col 46}{space 3}0.000{col 54}{space 4} .0263411{col 67}{space 3} .0365256
{txt}{space 7}1922  {c |}{col 14}{res}{space 2}-.0926608{col 26}{space 2} .0030199{col 37}{space 1}  -30.68{col 46}{space 3}0.000{col 54}{space 4}-.0985797{col 67}{space 3}-.0867418
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .0007516{col 26}{space 2} .0025868{col 37}{space 1}    0.29{col 46}{space 3}0.771{col 54}{space 4}-.0043185{col 67}{space 3} .0058216
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.1187148{col 26}{space 2} .0029632{col 37}{space 1}  -40.06{col 46}{space 3}0.000{col 54}{space 4}-.1245227{col 67}{space 3}-.1129069
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0467494{col 26}{space 2} .0025844{col 37}{space 1}   18.09{col 46}{space 3}0.000{col 54}{space 4} .0416841{col 67}{space 3} .0518148
{txt}{space 7}1930  {c |}{col 14}{res}{space 2}-.0765268{col 26}{space 2}  .002956{col 37}{space 1}  -25.89{col 46}{space 3}0.000{col 54}{space 4}-.0823206{col 67}{space 3}-.0707331
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .0840764{col 26}{space 2} .0025812{col 37}{space 1}   32.57{col 46}{space 3}0.000{col 54}{space 4} .0790173{col 67}{space 3} .0891355
{txt}{space 7}1934  {c |}{col 14}{res}{space 2}-.0112148{col 26}{space 2} .0029446{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0169862{col 67}{space 3}-.0054435
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .0977046{col 26}{space 2}  .002587{col 37}{space 1}   37.77{col 46}{space 3}0.000{col 54}{space 4} .0926342{col 67}{space 3}  .102775
{txt}{space 7}1938  {c |}{col 14}{res}{space 2}-.0247997{col 26}{space 2} .0029451{col 37}{space 1}   -8.42{col 46}{space 3}0.000{col 54}{space 4}-.0305721{col 67}{space 3}-.0190274
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .1066434{col 26}{space 2} .0025961{col 37}{space 1}   41.08{col 46}{space 3}0.000{col 54}{space 4} .1015551{col 67}{space 3} .1117318
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.1449261{col 26}{space 2} .0029559{col 37}{space 1}  -49.03{col 46}{space 3}0.000{col 54}{space 4}-.1507196{col 67}{space 3}-.1391326
{txt}{space 7}1944  {c |}{col 14}{res}{space 2} .0290493{col 26}{space 2} .0025374{col 37}{space 1}   11.45{col 46}{space 3}0.000{col 54}{space 4} .0240761{col 67}{space 3} .0340225
{txt}{space 7}1946  {c |}{col 14}{res}{space 2}-.1050578{col 26}{space 2} .0028812{col 37}{space 1}  -36.46{col 46}{space 3}0.000{col 54}{space 4} -.110705{col 67}{space 3}-.0994106
{txt}{space 7}1948  {c |}{col 14}{res}{space 2} .0288752{col 26}{space 2}  .002544{col 37}{space 1}   11.35{col 46}{space 3}0.000{col 54}{space 4} .0238889{col 67}{space 3} .0338614
{txt}{space 7}1950  {c |}{col 14}{res}{space 2}-.0428454{col 26}{space 2} .0028961{col 37}{space 1}  -14.79{col 46}{space 3}0.000{col 54}{space 4}-.0485217{col 67}{space 3}-.0371692
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4594437{col 26}{space 2} .0021456{col 37}{space 1}  214.14{col 46}{space 3}0.000{col 54}{space 4} .4552384{col 67}{space 3} .4636489
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3104, 87119) = {res}   111.776   0.000        {txt}(3105 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1920
{txt}(21,770 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_* i.year, absorb(county_id)
{p 0 6 2}{txt}note: inter_2_1942 omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    54,173
{txt}{col 49}F({res}  22{txt},{res}  51055{txt}){col 67}= {res}   2586.27
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9121
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9068
{txt}{col 49}Root MSE{col 67}= {res}    0.0761

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0085642{col 26}{space 2} .0059146{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-.0201568{col 67}{space 3} .0030284
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0148707{col 26}{space 2} .0069891{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-.0285694{col 67}{space 3} -.001172
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}  .003227{col 26}{space 2} .0059039{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4}-.0083446{col 67}{space 3} .0147986
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0169406{col 26}{space 2} .0068142{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.0302966{col 67}{space 3}-.0035847
{txt}inter_2_1928 {c |}{col 14}{res}{space 2} .0171411{col 26}{space 2} .0058996{col 37}{space 1}    2.91{col 46}{space 3}0.004{col 54}{space 4} .0055778{col 67}{space 3} .0287044
{txt}inter_2_1930 {c |}{col 14}{res}{space 2} -.020714{col 26}{space 2} .0068003{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.0340427{col 67}{space 3}-.0073853
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}  .000404{col 26}{space 2} .0058949{col 37}{space 1}    0.07{col 46}{space 3}0.945{col 54}{space 4}  -.01115{col 67}{space 3}  .011958
{txt}inter_2_1934 {c |}{col 14}{res}{space 2} .0044137{col 26}{space 2} .0067917{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4}-.0088981{col 67}{space 3} .0177255
{txt}inter_2_1936 {c |}{col 14}{res}{space 2} .0068706{col 26}{space 2} .0059119{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-.0047167{col 67}{space 3}  .018458
{txt}inter_2_1938 {c |}{col 14}{res}{space 2} .0130415{col 26}{space 2} .0067918{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0002706{col 67}{space 3} .0263535
{txt}inter_2_1940 {c |}{col 14}{res}{space 2} .0114719{col 26}{space 2} .0059066{col 37}{space 1}    1.94{col 46}{space 3}0.052{col 54}{space 4}-.0001052{col 67}{space 3} .0230489
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 8}year {c |}
{space 7}1922  {c |}{col 14}{res}{space 2}-.1242758{col 26}{space 2} .0018447{col 37}{space 1}  -67.37{col 46}{space 3}0.000{col 54}{space 4}-.1278915{col 67}{space 3}-.1206601
{txt}{space 7}1924  {c |}{col 14}{res}{space 2}-.0298898{col 26}{space 2} .0014632{col 37}{space 1}  -20.43{col 46}{space 3}0.000{col 54}{space 4}-.0327577{col 67}{space 3} -.027022
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.1496473{col 26}{space 2} .0017939{col 37}{space 1}  -83.42{col 46}{space 3}0.000{col 54}{space 4}-.1531634{col 67}{space 3}-.1461313
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0160483{col 26}{space 2} .0014608{col 37}{space 1}   10.99{col 46}{space 3}0.000{col 54}{space 4} .0131852{col 67}{space 3} .0189114
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} -.107623{col 26}{space 2} .0017885{col 37}{space 1}  -60.18{col 46}{space 3}0.000{col 54}{space 4}-.1111284{col 67}{space 3}-.1041177
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .0535054{col 26}{space 2} .0014583{col 37}{space 1}   36.69{col 46}{space 3}0.000{col 54}{space 4} .0506471{col 67}{space 3} .0563638
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} -.041695{col 26}{space 2} .0017778{col 37}{space 1}  -23.45{col 46}{space 3}0.000{col 54}{space 4}-.0451794{col 67}{space 3}-.0382105
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .0669827{col 26}{space 2} .0014636{col 37}{space 1}   45.77{col 46}{space 3}0.000{col 54}{space 4} .0641141{col 67}{space 3} .0698513
{txt}{space 7}1938  {c |}{col 14}{res}{space 2}-.0554307{col 26}{space 2} .0017783{col 37}{space 1}  -31.17{col 46}{space 3}0.000{col 54}{space 4}-.0589161{col 67}{space 3}-.0519453
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .0751066{col 26}{space 2} .0014728{col 37}{space 1}   50.99{col 46}{space 3}0.000{col 54}{space 4} .0722199{col 67}{space 3} .0779934
{txt}{space 7}1942  {c |}{col 14}{res}{space 2} -.175709{col 26}{space 2} .0017885{col 37}{space 1}  -98.25{col 46}{space 3}0.000{col 54}{space 4}-.1792144{col 67}{space 3}-.1722036
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4892509{col 26}{space 2} .0011312{col 37}{space 1}  432.49{col 46}{space 3}0.000{col 54}{space 4} .4870337{col 67}{space 3} .4914681
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3095, 51055) = {res}   152.305   0.000        {txt}(3096 categories)

{com}. for counties and DMAs****
{err}invalid syntax
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.                 {c )-}
{txt}
{com}.                 
. 
.         preserve
{txt}
{com}.                 keep group totpop county_id
{txt}
{com}.                 duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}.                 isid county_id
{txt}
{com}.                 gen scal_totpop = totpop/1000000
{txt}(12 missing values generated)

{com}.                 graph hbar (sum) scal_totpop , over(group) ytitle("Population (Millions)") title("Waves of Radio by 1930 Population") 
{res}{txt}
{com}.         restore 
{txt}
{com}. 
. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  24{txt},{res}  53705{txt}){col 67}= {res}   2458.26
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9079
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9025
{txt}{col 49}Root MSE{col 67}= {res}    0.0775

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2} .0052012{col 26}{space 2} .0061505{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-.0068538{col 67}{space 3} .0172563
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0011729{col 26}{space 2}  .007227{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-.0153379{col 67}{space 3} .0129922
{txt}inter_2_1924 {c |}{col 14}{res}{space 2} .0170184{col 26}{space 2} .0061417{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0049806{col 67}{space 3} .0290563
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0031638{col 26}{space 2} .0070522{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-.0169863{col 67}{space 3} .0106586
{txt}inter_2_1928 {c |}{col 14}{res}{space 2} .0309083{col 26}{space 2}  .006138{col 37}{space 1}    5.04{col 46}{space 3}0.000{col 54}{space 4} .0188779{col 67}{space 3} .0429388
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0069675{col 26}{space 2}  .007039{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-.0207639{col 67}{space 3}  .006829
{txt}inter_2_1932 {c |}{col 14}{res}{space 2} .0141895{col 26}{space 2} .0061349{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4}  .002165{col 67}{space 3} .0262141
{txt}inter_2_1934 {c |}{col 14}{res}{space 2} .0181713{col 26}{space 2} .0070312{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} .0043901{col 67}{space 3} .0319524
{txt}inter_2_1936 {c |}{col 14}{res}{space 2} .0206275{col 26}{space 2} .0061521{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0085693{col 67}{space 3} .0326856
{txt}inter_2_1938 {c |}{col 14}{res}{space 2} .0267968{col 26}{space 2} .0070313{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0130154{col 67}{space 3} .0405782
{txt}inter_2_1940 {c |}{col 14}{res}{space 2} .0251752{col 26}{space 2} .0061439{col 37}{space 1}    4.10{col 46}{space 3}0.000{col 54}{space 4} .0131332{col 67}{space 3} .0372173
{txt}inter_2_1942 {c |}{col 14}{res}{space 2} .0137595{col 26}{space 2}   .00705{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0000586{col 67}{space 3} .0275777
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1135762{col 26}{space 2} .0019119{col 37}{space 1}   59.40{col 46}{space 3}0.000{col 54}{space 4} .1098289{col 67}{space 3} .1173236
{txt}{space 7}1922  {c |}{col 14}{res}{space 2}-.0108033{col 26}{space 2} .0022213{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-.0151571{col 67}{space 3}-.0064495
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .0836638{col 26}{space 2} .0019043{col 37}{space 1}   43.94{col 46}{space 3}0.000{col 54}{space 4} .0799314{col 67}{space 3} .0873961
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0360688{col 26}{space 2} .0021777{col 37}{space 1}  -16.56{col 46}{space 3}0.000{col 54}{space 4}-.0403371{col 67}{space 3}-.0318006
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1296106{col 26}{space 2} .0019027{col 37}{space 1}   68.12{col 46}{space 3}0.000{col 54}{space 4} .1258814{col 67}{space 3} .1333398
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0059439{col 26}{space 2} .0021729{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4}  .001685{col 67}{space 3} .0102028
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .1670587{col 26}{space 2} .0019007{col 37}{space 1}   87.89{col 46}{space 3}0.000{col 54}{space 4} .1633333{col 67}{space 3} .1707841
{txt}{space 7}1934  {c |}{col 14}{res}{space 2}  .071861{col 26}{space 2} .0021644{col 37}{space 1}   33.20{col 46}{space 3}0.000{col 54}{space 4} .0676187{col 67}{space 3} .0761033
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .1805795{col 26}{space 2} .0019049{col 37}{space 1}   94.80{col 46}{space 3}0.000{col 54}{space 4} .1768459{col 67}{space 3} .1843132
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .0581275{col 26}{space 2} .0021649{col 37}{space 1}   26.85{col 46}{space 3}0.000{col 54}{space 4} .0538844{col 67}{space 3} .0623706
{txt}{space 7}1940  {c |}{col 14}{res}{space 2}  .188672{col 26}{space 2} .0019109{col 37}{space 1}   98.74{col 46}{space 3}0.000{col 54}{space 4} .1849267{col 67}{space 3} .1924174
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0621498{col 26}{space 2} .0021725{col 37}{space 1}  -28.61{col 46}{space 3}0.000{col 54}{space 4}-.0664078{col 67}{space 3}-.0578918
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3749356{col 26}{space 2} .0015112{col 37}{space 1}  248.11{col 46}{space 3}0.000{col 54}{space 4} .3719737{col 67}{space 3} .3778975
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53705) = {res}   151.532   0.000        {txt}(3098 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2 = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 {c )-}
{txt}(556 real changes made)
(278 real changes made)
(556 real changes made)
(278 real changes made)
(556 real changes made)
(278 real changes made)
(556 real changes made)
(278 real changes made)
(556 real changes made)
(278 real changes made)
(556 real changes made)
(278 real changes made)

{com}.         sort year
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929) ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_*  inter_3_* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  60{txt},{res}  53669{txt}){col 67}= {res}   1011.02
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9092
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9039
{txt}{col 49}Root MSE{col 67}= {res}    0.0770

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         turnout{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}inter_2_1920 {c |}{col 18}{res}{space 2}-.0146716{col 30}{space 2} .0077485{col 41}{space 1}   -1.89{col 50}{space 3}0.058{col 58}{space 4}-.0298588{col 71}{space 3} .0005156
{txt}inter_2_dma_1920 {c |}{col 18}{res}{space 2} .0170365{col 30}{space 2} .0053415{col 41}{space 1}    3.19{col 50}{space 3}0.001{col 58}{space 4} .0065671{col 71}{space 3} .0275059
{txt}{space 4}inter_2_1922 {c |}{col 18}{res}{space 2}-.0209837{col 30}{space 2} .0091078{col 41}{space 1}   -2.30{col 50}{space 3}0.021{col 58}{space 4}-.0388351{col 71}{space 3}-.0031323
{txt}inter_2_dma_1922 {c |}{col 18}{res}{space 2} .0124114{col 30}{space 2} .0061214{col 41}{space 1}    2.03{col 50}{space 3}0.043{col 58}{space 4} .0004135{col 71}{space 3} .0244093
{txt}{space 4}inter_2_1924 {c |}{col 18}{res}{space 2}-.0240329{col 30}{space 2} .0077401{col 41}{space 1}   -3.10{col 50}{space 3}0.002{col 58}{space 4}-.0392036{col 71}{space 3}-.0088622
{txt}inter_2_dma_1924 {c |}{col 18}{res}{space 2}-.0002805{col 30}{space 2} .0053087{col 41}{space 1}   -0.05{col 50}{space 3}0.958{col 58}{space 4}-.0106856{col 71}{space 3} .0101246
{txt}{space 4}inter_2_1926 {c |}{col 18}{res}{space 2}-.0173018{col 30}{space 2} .0089012{col 41}{space 1}   -1.94{col 50}{space 3}0.052{col 58}{space 4}-.0347482{col 71}{space 3} .0001446
{txt}inter_2_dma_1926 {c |}{col 18}{res}{space 2} .0046393{col 30}{space 2} .0060523{col 41}{space 1}    0.77{col 50}{space 3}0.443{col 58}{space 4}-.0072232{col 71}{space 3} .0165018
{txt}{space 4}inter_2_1928 {c |}{col 18}{res}{space 2}-.0271862{col 30}{space 2} .0077322{col 41}{space 1}   -3.52{col 50}{space 3}0.000{col 58}{space 4}-.0423414{col 71}{space 3}-.0120311
{txt}inter_2_dma_1928 {c |}{col 18}{res}{space 2}-.0059968{col 30}{space 2} .0053079{col 41}{space 1}   -1.13{col 50}{space 3}0.259{col 58}{space 4}-.0164003{col 71}{space 3} .0044067
{txt}{space 4}inter_2_1930 {c |}{col 18}{res}{space 2}-.0111518{col 30}{space 2} .0088822{col 41}{space 1}   -1.26{col 50}{space 3}0.209{col 58}{space 4} -.028561{col 71}{space 3} .0062574
{txt}inter_2_dma_1930 {c |}{col 18}{res}{space 2}-.0016448{col 30}{space 2} .0060149{col 41}{space 1}   -0.27{col 50}{space 3}0.785{col 58}{space 4}-.0134341{col 71}{space 3} .0101446
{txt}{space 4}inter_2_1932 {c |}{col 18}{res}{space 2}-.0214567{col 30}{space 2} .0077279{col 41}{space 1}   -2.78{col 50}{space 3}0.005{col 58}{space 4}-.0366033{col 71}{space 3}  -.00631
{txt}inter_2_dma_1932 {c |}{col 18}{res}{space 2}-.0031112{col 30}{space 2} .0052972{col 41}{space 1}   -0.59{col 50}{space 3}0.557{col 58}{space 4}-.0134936{col 71}{space 3} .0072713
{txt}{space 4}inter_2_1934 {c |}{col 18}{res}{space 2}-.0123386{col 30}{space 2} .0088727{col 41}{space 1}   -1.39{col 50}{space 3}0.164{col 58}{space 4}-.0297292{col 71}{space 3}  .005052
{txt}inter_2_dma_1934 {c |}{col 18}{res}{space 2}-.0013501{col 30}{space 2} .0059979{col 41}{space 1}   -0.23{col 50}{space 3}0.822{col 58}{space 4}-.0131061{col 71}{space 3} .0104059
{txt}{space 4}inter_2_1936 {c |}{col 18}{res}{space 2}-.0369159{col 30}{space 2} .0077396{col 41}{space 1}   -4.77{col 50}{space 3}0.000{col 58}{space 4}-.0520856{col 71}{space 3}-.0217463
{txt}inter_2_dma_1936 {c |}{col 18}{res}{space 2}-.0030325{col 30}{space 2} .0053492{col 41}{space 1}   -0.57{col 50}{space 3}0.571{col 58}{space 4}-.0135169{col 71}{space 3}  .007452
{txt}{space 4}inter_2_1938 {c |}{col 18}{res}{space 2} -.029939{col 30}{space 2}  .008873{col 41}{space 1}   -3.37{col 50}{space 3}0.001{col 58}{space 4}-.0473301{col 71}{space 3} -.012548
{txt}inter_2_dma_1938 {c |}{col 18}{res}{space 2} -.007315{col 30}{space 2}  .006006{col 41}{space 1}   -1.22{col 50}{space 3}0.223{col 58}{space 4}-.0190868{col 71}{space 3} .0044568
{txt}{space 4}inter_2_1940 {c |}{col 18}{res}{space 2}-.0428581{col 30}{space 2} .0077384{col 41}{space 1}   -5.54{col 50}{space 3}0.000{col 58}{space 4}-.0580254{col 71}{space 3}-.0276908
{txt}inter_2_dma_1940 {c |}{col 18}{res}{space 2}-.0010366{col 30}{space 2} .0053382{col 41}{space 1}   -0.19{col 50}{space 3}0.846{col 58}{space 4}-.0114995{col 71}{space 3} .0094263
{txt}{space 4}inter_2_1942 {c |}{col 18}{res}{space 2}-.0309564{col 30}{space 2} .0088947{col 41}{space 1}   -3.48{col 50}{space 3}0.001{col 58}{space 4}  -.04839{col 71}{space 3}-.0135228
{txt}inter_2_dma_1942 {c |}{col 18}{res}{space 2} .0315308{col 30}{space 2} .0060089{col 41}{space 1}    5.25{col 50}{space 3}0.000{col 58}{space 4} .0197532{col 71}{space 3} .0433083
{txt}{space 4}inter_3_1920 {c |}{col 18}{res}{space 2}-.0214106{col 30}{space 2} .0054918{col 41}{space 1}   -3.90{col 50}{space 3}0.000{col 58}{space 4}-.0321747{col 71}{space 3}-.0106466
{txt}inter_3_dma_1920 {c |}{col 18}{res}{space 2}-.0195652{col 30}{space 2} .0119706{col 41}{space 1}   -1.63{col 50}{space 3}0.102{col 58}{space 4}-.0430276{col 71}{space 3} .0038973
{txt}{space 4}inter_3_1922 {c |}{col 18}{res}{space 2}-.0214354{col 30}{space 2}  .006436{col 41}{space 1}   -3.33{col 50}{space 3}0.001{col 58}{space 4}-.0340501{col 71}{space 3}-.0088207
{txt}inter_3_dma_1922 {c |}{col 18}{res}{space 2}-.0320614{col 30}{space 2} .0144349{col 41}{space 1}   -2.22{col 50}{space 3}0.026{col 58}{space 4} -.060354{col 71}{space 3}-.0037688
{txt}{space 4}inter_3_1924 {c |}{col 18}{res}{space 2}-.0466593{col 30}{space 2} .0054852{col 41}{space 1}   -8.51{col 50}{space 3}0.000{col 58}{space 4}-.0574104{col 71}{space 3}-.0359082
{txt}inter_3_dma_1924 {c |}{col 18}{res}{space 2}-.0486137{col 30}{space 2} .0119589{col 41}{space 1}   -4.07{col 50}{space 3}0.000{col 58}{space 4}-.0720532{col 71}{space 3}-.0251742
{txt}{space 4}inter_3_1926 {c |}{col 18}{res}{space 2}-.0159606{col 30}{space 2} .0063095{col 41}{space 1}   -2.53{col 50}{space 3}0.011{col 58}{space 4}-.0283273{col 71}{space 3} -.003594
{txt}inter_3_dma_1926 {c |}{col 18}{res}{space 2}-.0225457{col 30}{space 2} .0136486{col 41}{space 1}   -1.65{col 50}{space 3}0.099{col 58}{space 4} -.049297{col 71}{space 3} .0042056
{txt}{space 4}inter_3_1928 {c |}{col 18}{res}{space 2}-.0677366{col 30}{space 2} .0054771{col 41}{space 1}  -12.37{col 50}{space 3}0.000{col 58}{space 4}-.0784717{col 71}{space 3}-.0570014
{txt}inter_3_dma_1928 {c |}{col 18}{res}{space 2}-.0172994{col 30}{space 2} .0119585{col 41}{space 1}   -1.45{col 50}{space 3}0.148{col 58}{space 4}-.0407382{col 71}{space 3} .0061394
{txt}{space 4}inter_3_1930 {c |}{col 18}{res}{space 2} -.004895{col 30}{space 2} .0062956{col 41}{space 1}   -0.78{col 50}{space 3}0.437{col 58}{space 4}-.0172343{col 71}{space 3} .0074444
{txt}inter_3_dma_1930 {c |}{col 18}{res}{space 2}-.0287891{col 30}{space 2} .0134325{col 41}{space 1}   -2.14{col 50}{space 3}0.032{col 58}{space 4}-.0551169{col 71}{space 3}-.0024613
{txt}{space 4}inter_3_1932 {c |}{col 18}{res}{space 2}-.0411678{col 30}{space 2}  .005474{col 41}{space 1}   -7.52{col 50}{space 3}0.000{col 58}{space 4}-.0518968{col 71}{space 3}-.0304388
{txt}inter_3_dma_1932 {c |}{col 18}{res}{space 2}-.0329835{col 30}{space 2} .0118495{col 41}{space 1}   -2.78{col 50}{space 3}0.005{col 58}{space 4}-.0562086{col 71}{space 3}-.0097584
{txt}{space 4}inter_3_1934 {c |}{col 18}{res}{space 2}-.0334227{col 30}{space 2} .0062842{col 41}{space 1}   -5.32{col 50}{space 3}0.000{col 58}{space 4}-.0457398{col 71}{space 3}-.0211055
{txt}inter_3_dma_1934 {c |}{col 18}{res}{space 2}-.0863198{col 30}{space 2} .0134303{col 41}{space 1}   -6.43{col 50}{space 3}0.000{col 58}{space 4}-.1126432{col 71}{space 3}-.0599963
{txt}{space 4}inter_3_1936 {c |}{col 18}{res}{space 2}-.0664179{col 30}{space 2} .0054747{col 41}{space 1}  -12.13{col 50}{space 3}0.000{col 58}{space 4}-.0771483{col 71}{space 3}-.0556874
{txt}inter_3_dma_1936 {c |}{col 18}{res}{space 2}-.0329247{col 30}{space 2} .0119207{col 41}{space 1}   -2.76{col 50}{space 3}0.006{col 58}{space 4}-.0562894{col 71}{space 3}  -.00956
{txt}{space 4}inter_3_1938 {c |}{col 18}{res}{space 2}-.0643569{col 30}{space 2}  .006284{col 41}{space 1}  -10.24{col 50}{space 3}0.000{col 58}{space 4}-.0766737{col 71}{space 3}-.0520402
{txt}inter_3_dma_1938 {c |}{col 18}{res}{space 2}-.0806418{col 30}{space 2} .0134715{col 41}{space 1}   -5.99{col 50}{space 3}0.000{col 58}{space 4} -.107046{col 71}{space 3}-.0542376
{txt}{space 4}inter_3_1940 {c |}{col 18}{res}{space 2}-.0779321{col 30}{space 2} .0054851{col 41}{space 1}  -14.21{col 50}{space 3}0.000{col 58}{space 4}-.0886829{col 71}{space 3}-.0671812
{txt}inter_3_dma_1940 {c |}{col 18}{res}{space 2} -.049117{col 30}{space 2} .0118676{col 41}{space 1}   -4.14{col 50}{space 3}0.000{col 58}{space 4}-.0723777{col 71}{space 3}-.0258563
{txt}{space 4}inter_3_1942 {c |}{col 18}{res}{space 2}-.0492662{col 30}{space 2}  .006302{col 41}{space 1}   -7.82{col 50}{space 3}0.000{col 58}{space 4}-.0616181{col 71}{space 3}-.0369142
{txt}inter_3_dma_1942 {c |}{col 18}{res}{space 2}-.0143951{col 30}{space 2} .0134325{col 41}{space 1}   -1.07{col 50}{space 3}0.284{col 58}{space 4}-.0407229{col 71}{space 3} .0119327
{txt}{space 16} {c |}
{space 12}year {c |}
{space 11}1920  {c |}{col 18}{res}{space 2} .1298029{col 30}{space 2} .0050135{col 41}{space 1}   25.89{col 50}{space 3}0.000{col 58}{space 4} .1199764{col 71}{space 3} .1396293
{txt}{space 11}1922  {c |}{col 18}{res}{space 2} .0062647{col 30}{space 2}  .005885{col 41}{space 1}    1.06{col 50}{space 3}0.287{col 58}{space 4}-.0052698{col 71}{space 3} .0177993
{txt}{space 11}1924  {c |}{col 18}{res}{space 2} .1247983{col 30}{space 2} .0050102{col 41}{space 1}   24.91{col 50}{space 3}0.000{col 58}{space 4} .1149783{col 71}{space 3} .1346184
{txt}{space 11}1926  {c |}{col 18}{res}{space 2}-.0229049{col 30}{space 2} .0057703{col 41}{space 1}   -3.97{col 50}{space 3}0.000{col 58}{space 4}-.0342147{col 71}{space 3}-.0115952
{txt}{space 11}1928  {c |}{col 18}{res}{space 2} .1890121{col 30}{space 2} .0050022{col 41}{space 1}   37.79{col 50}{space 3}0.000{col 58}{space 4} .1792077{col 71}{space 3} .1988164
{txt}{space 11}1930  {c |}{col 18}{res}{space 2} .0105116{col 30}{space 2} .0057556{col 41}{space 1}    1.83{col 50}{space 3}0.068{col 58}{space 4}-.0007695{col 71}{space 3} .0217927
{txt}{space 11}1932  {c |}{col 18}{res}{space 2} .2033879{col 30}{space 2} .0049992{col 41}{space 1}   40.68{col 50}{space 3}0.000{col 58}{space 4} .1935894{col 71}{space 3} .2131864
{txt}{space 11}1934  {c |}{col 18}{res}{space 2} .1026868{col 30}{space 2} .0057485{col 41}{space 1}   17.86{col 50}{space 3}0.000{col 58}{space 4} .0914197{col 71}{space 3} .1139539
{txt}{space 11}1936  {c |}{col 18}{res}{space 2} .2387371{col 30}{space 2} .0049992{col 41}{space 1}   47.75{col 50}{space 3}0.000{col 58}{space 4} .2289386{col 71}{space 3} .2485356
{txt}{space 11}1938  {c |}{col 18}{res}{space 2} .1164667{col 30}{space 2} .0057485{col 41}{space 1}   20.26{col 50}{space 3}0.000{col 58}{space 4} .1051996{col 71}{space 3} .1277338
{txt}{space 11}1940  {c |}{col 18}{res}{space 2} .2569515{col 30}{space 2} .0050061{col 41}{space 1}   51.33{col 50}{space 3}0.000{col 58}{space 4} .2471395{col 71}{space 3} .2667635
{txt}{space 11}1942  {c |}{col 18}{res}{space 2}-.0241735{col 30}{space 2} .0057627{col 41}{space 1}   -4.19{col 50}{space 3}0.000{col 58}{space 4}-.0354685{col 71}{space 3}-.0128785
{txt}{space 16} {c |}
{space 11}_cons {c |}{col 18}{res}{space 2} .3755116{col 30}{space 2} .0015017{col 41}{space 1}  250.05{col 50}{space 3}0.000{col 58}{space 4} .3725682{col 71}{space 3}  .378455
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       county_id {c |}    F(3097, 53669) = {res}   146.909   0.000        {txt}(3098 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. 
. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. 
. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. ** Include interaction because group is completely determine by 
. areg turnout inter_2_*  inter_3_* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  60{txt},{res}  53669{txt}){col 67}= {res}   1011.02
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9092
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9039
{txt}{col 49}Root MSE{col 67}= {res}    0.0770

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         turnout{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}inter_2_1920 {c |}{col 18}{res}{space 2}-.0146716{col 30}{space 2} .0077485{col 41}{space 1}   -1.89{col 50}{space 3}0.058{col 58}{space 4}-.0298588{col 71}{space 3} .0005156
{txt}inter_2_dma_1920 {c |}{col 18}{res}{space 2} .0170365{col 30}{space 2} .0053415{col 41}{space 1}    3.19{col 50}{space 3}0.001{col 58}{space 4} .0065671{col 71}{space 3} .0275059
{txt}{space 4}inter_2_1922 {c |}{col 18}{res}{space 2}-.0209837{col 30}{space 2} .0091078{col 41}{space 1}   -2.30{col 50}{space 3}0.021{col 58}{space 4}-.0388351{col 71}{space 3}-.0031323
{txt}inter_2_dma_1922 {c |}{col 18}{res}{space 2} .0124114{col 30}{space 2} .0061214{col 41}{space 1}    2.03{col 50}{space 3}0.043{col 58}{space 4} .0004135{col 71}{space 3} .0244093
{txt}{space 4}inter_2_1924 {c |}{col 18}{res}{space 2}-.0240329{col 30}{space 2} .0077401{col 41}{space 1}   -3.10{col 50}{space 3}0.002{col 58}{space 4}-.0392036{col 71}{space 3}-.0088622
{txt}inter_2_dma_1924 {c |}{col 18}{res}{space 2}-.0002805{col 30}{space 2} .0053087{col 41}{space 1}   -0.05{col 50}{space 3}0.958{col 58}{space 4}-.0106856{col 71}{space 3} .0101246
{txt}{space 4}inter_2_1926 {c |}{col 18}{res}{space 2}-.0173018{col 30}{space 2} .0089012{col 41}{space 1}   -1.94{col 50}{space 3}0.052{col 58}{space 4}-.0347482{col 71}{space 3} .0001446
{txt}inter_2_dma_1926 {c |}{col 18}{res}{space 2} .0046393{col 30}{space 2} .0060523{col 41}{space 1}    0.77{col 50}{space 3}0.443{col 58}{space 4}-.0072232{col 71}{space 3} .0165018
{txt}{space 4}inter_2_1928 {c |}{col 18}{res}{space 2}-.0271862{col 30}{space 2} .0077322{col 41}{space 1}   -3.52{col 50}{space 3}0.000{col 58}{space 4}-.0423414{col 71}{space 3}-.0120311
{txt}inter_2_dma_1928 {c |}{col 18}{res}{space 2}-.0059968{col 30}{space 2} .0053079{col 41}{space 1}   -1.13{col 50}{space 3}0.259{col 58}{space 4}-.0164003{col 71}{space 3} .0044067
{txt}{space 4}inter_2_1930 {c |}{col 18}{res}{space 2}-.0111518{col 30}{space 2} .0088822{col 41}{space 1}   -1.26{col 50}{space 3}0.209{col 58}{space 4} -.028561{col 71}{space 3} .0062574
{txt}inter_2_dma_1930 {c |}{col 18}{res}{space 2}-.0016448{col 30}{space 2} .0060149{col 41}{space 1}   -0.27{col 50}{space 3}0.785{col 58}{space 4}-.0134341{col 71}{space 3} .0101446
{txt}{space 4}inter_2_1932 {c |}{col 18}{res}{space 2}-.0214567{col 30}{space 2} .0077279{col 41}{space 1}   -2.78{col 50}{space 3}0.005{col 58}{space 4}-.0366033{col 71}{space 3}  -.00631
{txt}inter_2_dma_1932 {c |}{col 18}{res}{space 2}-.0031112{col 30}{space 2} .0052972{col 41}{space 1}   -0.59{col 50}{space 3}0.557{col 58}{space 4}-.0134936{col 71}{space 3} .0072713
{txt}{space 4}inter_2_1934 {c |}{col 18}{res}{space 2}-.0123386{col 30}{space 2} .0088727{col 41}{space 1}   -1.39{col 50}{space 3}0.164{col 58}{space 4}-.0297292{col 71}{space 3}  .005052
{txt}inter_2_dma_1934 {c |}{col 18}{res}{space 2}-.0013501{col 30}{space 2} .0059979{col 41}{space 1}   -0.23{col 50}{space 3}0.822{col 58}{space 4}-.0131061{col 71}{space 3} .0104059
{txt}{space 4}inter_2_1936 {c |}{col 18}{res}{space 2}-.0369159{col 30}{space 2} .0077396{col 41}{space 1}   -4.77{col 50}{space 3}0.000{col 58}{space 4}-.0520856{col 71}{space 3}-.0217463
{txt}inter_2_dma_1936 {c |}{col 18}{res}{space 2}-.0030325{col 30}{space 2} .0053492{col 41}{space 1}   -0.57{col 50}{space 3}0.571{col 58}{space 4}-.0135169{col 71}{space 3}  .007452
{txt}{space 4}inter_2_1938 {c |}{col 18}{res}{space 2} -.029939{col 30}{space 2}  .008873{col 41}{space 1}   -3.37{col 50}{space 3}0.001{col 58}{space 4}-.0473301{col 71}{space 3} -.012548
{txt}inter_2_dma_1938 {c |}{col 18}{res}{space 2} -.007315{col 30}{space 2}  .006006{col 41}{space 1}   -1.22{col 50}{space 3}0.223{col 58}{space 4}-.0190868{col 71}{space 3} .0044568
{txt}{space 4}inter_2_1940 {c |}{col 18}{res}{space 2}-.0428581{col 30}{space 2} .0077384{col 41}{space 1}   -5.54{col 50}{space 3}0.000{col 58}{space 4}-.0580254{col 71}{space 3}-.0276908
{txt}inter_2_dma_1940 {c |}{col 18}{res}{space 2}-.0010366{col 30}{space 2} .0053382{col 41}{space 1}   -0.19{col 50}{space 3}0.846{col 58}{space 4}-.0114995{col 71}{space 3} .0094263
{txt}{space 4}inter_2_1942 {c |}{col 18}{res}{space 2}-.0309564{col 30}{space 2} .0088947{col 41}{space 1}   -3.48{col 50}{space 3}0.001{col 58}{space 4}  -.04839{col 71}{space 3}-.0135228
{txt}inter_2_dma_1942 {c |}{col 18}{res}{space 2} .0315308{col 30}{space 2} .0060089{col 41}{space 1}    5.25{col 50}{space 3}0.000{col 58}{space 4} .0197532{col 71}{space 3} .0433083
{txt}{space 4}inter_3_1920 {c |}{col 18}{res}{space 2}-.0214106{col 30}{space 2} .0054918{col 41}{space 1}   -3.90{col 50}{space 3}0.000{col 58}{space 4}-.0321747{col 71}{space 3}-.0106466
{txt}inter_3_dma_1920 {c |}{col 18}{res}{space 2}-.0195652{col 30}{space 2} .0119706{col 41}{space 1}   -1.63{col 50}{space 3}0.102{col 58}{space 4}-.0430276{col 71}{space 3} .0038973
{txt}{space 4}inter_3_1922 {c |}{col 18}{res}{space 2}-.0214354{col 30}{space 2}  .006436{col 41}{space 1}   -3.33{col 50}{space 3}0.001{col 58}{space 4}-.0340501{col 71}{space 3}-.0088207
{txt}inter_3_dma_1922 {c |}{col 18}{res}{space 2}-.0320614{col 30}{space 2} .0144349{col 41}{space 1}   -2.22{col 50}{space 3}0.026{col 58}{space 4} -.060354{col 71}{space 3}-.0037688
{txt}{space 4}inter_3_1924 {c |}{col 18}{res}{space 2}-.0466593{col 30}{space 2} .0054852{col 41}{space 1}   -8.51{col 50}{space 3}0.000{col 58}{space 4}-.0574104{col 71}{space 3}-.0359082
{txt}inter_3_dma_1924 {c |}{col 18}{res}{space 2}-.0486137{col 30}{space 2} .0119589{col 41}{space 1}   -4.07{col 50}{space 3}0.000{col 58}{space 4}-.0720532{col 71}{space 3}-.0251742
{txt}{space 4}inter_3_1926 {c |}{col 18}{res}{space 2}-.0159606{col 30}{space 2} .0063095{col 41}{space 1}   -2.53{col 50}{space 3}0.011{col 58}{space 4}-.0283273{col 71}{space 3} -.003594
{txt}inter_3_dma_1926 {c |}{col 18}{res}{space 2}-.0225457{col 30}{space 2} .0136486{col 41}{space 1}   -1.65{col 50}{space 3}0.099{col 58}{space 4} -.049297{col 71}{space 3} .0042056
{txt}{space 4}inter_3_1928 {c |}{col 18}{res}{space 2}-.0677366{col 30}{space 2} .0054771{col 41}{space 1}  -12.37{col 50}{space 3}0.000{col 58}{space 4}-.0784717{col 71}{space 3}-.0570014
{txt}inter_3_dma_1928 {c |}{col 18}{res}{space 2}-.0172994{col 30}{space 2} .0119585{col 41}{space 1}   -1.45{col 50}{space 3}0.148{col 58}{space 4}-.0407382{col 71}{space 3} .0061394
{txt}{space 4}inter_3_1930 {c |}{col 18}{res}{space 2} -.004895{col 30}{space 2} .0062956{col 41}{space 1}   -0.78{col 50}{space 3}0.437{col 58}{space 4}-.0172343{col 71}{space 3} .0074444
{txt}inter_3_dma_1930 {c |}{col 18}{res}{space 2}-.0287891{col 30}{space 2} .0134325{col 41}{space 1}   -2.14{col 50}{space 3}0.032{col 58}{space 4}-.0551169{col 71}{space 3}-.0024613
{txt}{space 4}inter_3_1932 {c |}{col 18}{res}{space 2}-.0411678{col 30}{space 2}  .005474{col 41}{space 1}   -7.52{col 50}{space 3}0.000{col 58}{space 4}-.0518968{col 71}{space 3}-.0304388
{txt}inter_3_dma_1932 {c |}{col 18}{res}{space 2}-.0329835{col 30}{space 2} .0118495{col 41}{space 1}   -2.78{col 50}{space 3}0.005{col 58}{space 4}-.0562086{col 71}{space 3}-.0097584
{txt}{space 4}inter_3_1934 {c |}{col 18}{res}{space 2}-.0334227{col 30}{space 2} .0062842{col 41}{space 1}   -5.32{col 50}{space 3}0.000{col 58}{space 4}-.0457398{col 71}{space 3}-.0211055
{txt}inter_3_dma_1934 {c |}{col 18}{res}{space 2}-.0863198{col 30}{space 2} .0134303{col 41}{space 1}   -6.43{col 50}{space 3}0.000{col 58}{space 4}-.1126432{col 71}{space 3}-.0599963
{txt}{space 4}inter_3_1936 {c |}{col 18}{res}{space 2}-.0664179{col 30}{space 2} .0054747{col 41}{space 1}  -12.13{col 50}{space 3}0.000{col 58}{space 4}-.0771483{col 71}{space 3}-.0556874
{txt}inter_3_dma_1936 {c |}{col 18}{res}{space 2}-.0329247{col 30}{space 2} .0119207{col 41}{space 1}   -2.76{col 50}{space 3}0.006{col 58}{space 4}-.0562894{col 71}{space 3}  -.00956
{txt}{space 4}inter_3_1938 {c |}{col 18}{res}{space 2}-.0643569{col 30}{space 2}  .006284{col 41}{space 1}  -10.24{col 50}{space 3}0.000{col 58}{space 4}-.0766737{col 71}{space 3}-.0520402
{txt}inter_3_dma_1938 {c |}{col 18}{res}{space 2}-.0806418{col 30}{space 2} .0134715{col 41}{space 1}   -5.99{col 50}{space 3}0.000{col 58}{space 4} -.107046{col 71}{space 3}-.0542376
{txt}{space 4}inter_3_1940 {c |}{col 18}{res}{space 2}-.0779321{col 30}{space 2} .0054851{col 41}{space 1}  -14.21{col 50}{space 3}0.000{col 58}{space 4}-.0886829{col 71}{space 3}-.0671812
{txt}inter_3_dma_1940 {c |}{col 18}{res}{space 2} -.049117{col 30}{space 2} .0118676{col 41}{space 1}   -4.14{col 50}{space 3}0.000{col 58}{space 4}-.0723777{col 71}{space 3}-.0258563
{txt}{space 4}inter_3_1942 {c |}{col 18}{res}{space 2}-.0492662{col 30}{space 2}  .006302{col 41}{space 1}   -7.82{col 50}{space 3}0.000{col 58}{space 4}-.0616181{col 71}{space 3}-.0369142
{txt}inter_3_dma_1942 {c |}{col 18}{res}{space 2}-.0143951{col 30}{space 2} .0134325{col 41}{space 1}   -1.07{col 50}{space 3}0.284{col 58}{space 4}-.0407229{col 71}{space 3} .0119327
{txt}{space 16} {c |}
{space 12}year {c |}
{space 11}1920  {c |}{col 18}{res}{space 2} .1298029{col 30}{space 2} .0050135{col 41}{space 1}   25.89{col 50}{space 3}0.000{col 58}{space 4} .1199764{col 71}{space 3} .1396293
{txt}{space 11}1922  {c |}{col 18}{res}{space 2} .0062647{col 30}{space 2}  .005885{col 41}{space 1}    1.06{col 50}{space 3}0.287{col 58}{space 4}-.0052698{col 71}{space 3} .0177993
{txt}{space 11}1924  {c |}{col 18}{res}{space 2} .1247983{col 30}{space 2} .0050102{col 41}{space 1}   24.91{col 50}{space 3}0.000{col 58}{space 4} .1149783{col 71}{space 3} .1346184
{txt}{space 11}1926  {c |}{col 18}{res}{space 2}-.0229049{col 30}{space 2} .0057703{col 41}{space 1}   -3.97{col 50}{space 3}0.000{col 58}{space 4}-.0342147{col 71}{space 3}-.0115952
{txt}{space 11}1928  {c |}{col 18}{res}{space 2} .1890121{col 30}{space 2} .0050022{col 41}{space 1}   37.79{col 50}{space 3}0.000{col 58}{space 4} .1792077{col 71}{space 3} .1988164
{txt}{space 11}1930  {c |}{col 18}{res}{space 2} .0105116{col 30}{space 2} .0057556{col 41}{space 1}    1.83{col 50}{space 3}0.068{col 58}{space 4}-.0007695{col 71}{space 3} .0217927
{txt}{space 11}1932  {c |}{col 18}{res}{space 2} .2033879{col 30}{space 2} .0049992{col 41}{space 1}   40.68{col 50}{space 3}0.000{col 58}{space 4} .1935894{col 71}{space 3} .2131864
{txt}{space 11}1934  {c |}{col 18}{res}{space 2} .1026868{col 30}{space 2} .0057485{col 41}{space 1}   17.86{col 50}{space 3}0.000{col 58}{space 4} .0914197{col 71}{space 3} .1139539
{txt}{space 11}1936  {c |}{col 18}{res}{space 2} .2387371{col 30}{space 2} .0049992{col 41}{space 1}   47.75{col 50}{space 3}0.000{col 58}{space 4} .2289386{col 71}{space 3} .2485356
{txt}{space 11}1938  {c |}{col 18}{res}{space 2} .1164667{col 30}{space 2} .0057485{col 41}{space 1}   20.26{col 50}{space 3}0.000{col 58}{space 4} .1051996{col 71}{space 3} .1277338
{txt}{space 11}1940  {c |}{col 18}{res}{space 2} .2569515{col 30}{space 2} .0050061{col 41}{space 1}   51.33{col 50}{space 3}0.000{col 58}{space 4} .2471395{col 71}{space 3} .2667635
{txt}{space 11}1942  {c |}{col 18}{res}{space 2}-.0241735{col 30}{space 2} .0057627{col 41}{space 1}   -4.19{col 50}{space 3}0.000{col 58}{space 4}-.0354685{col 71}{space 3}-.0128785
{txt}{space 16} {c |}
{space 11}_cons {c |}{col 18}{res}{space 2} .3755116{col 30}{space 2} .0015017{col 41}{space 1}  250.05{col 50}{space 3}0.000{col 58}{space 4} .3725682{col 71}{space 3}  .378455
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       county_id {c |}    F(3097, 53669) = {res}   146.909   0.000        {txt}(3098 categories)

{com}. 
. ** graph the coefficients ** 
. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}. gen group_3 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2_19* = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_3_19* = _b[inter_3_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{err}variable group_2_19* not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. d DMAs****
{err}variable DMAs**** not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
.         preserve
{txt}
{com}.                 keep group totpop county_id
{txt}
{com}.                 duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}.                 isid county_id
{txt}
{com}.                 gen scal_totpop = totpop/1000000
{txt}(12 missing values generated)

{com}.                 graph hbar (sum) scal_totpop , over(group) ytitle("Population (Millions)") title("Waves of Radio by 1930 Population") 
{res}{txt}
{com}.         restore 
{txt}
{com}. 
. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. ** Include interaction because group is completely determine by 
. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. 
. ** graph the coefficients ** 
. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}. gen group_3 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2 = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_3 = _b[inter_3_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{txt}(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}.         sort year
{txt}
{com}.         
. scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929) ///

{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929) ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. 
. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
.         preserve
{txt}
{com}.                 keep group totpop county_id
{txt}
{com}.                 duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}.                 isid county_id
{txt}
{com}.                 gen scal_totpop = totpop/1000000
{txt}(12 missing values generated)

{com}.                 graph hbar (sum) scal_totpop , over(group) ytitle("Population (Millions)") title("Waves of Radio by 1930 Population") 
{res}{txt}
{com}.         restore 
{txt}
{com}. 
. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. ** Include interaction because group is completely determine by 
. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. 
. ** graph the coefficients ** 
. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}. gen group_3 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2 = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_3 = _b[inter_3_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{txt}(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. drop if year > 1942
{txt}(0 observations deleted)

{com}. drop if year < 1918
{txt}(0 observations deleted)

{com}. ** Include interaction because group is completely determine by 
. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. gen group_2 = . 
{err}variable {bf}group_2{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}.         
. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}.         sort year
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_pres.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_pres.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}.         sort year
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(1 "Group 2" 2 "Group 3")
{err}option {bf:1} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. help legend

. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_nonpres.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_nonpres.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. drop if  mi(dmaindex)
{txt}(3,173 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_dma_* i.year, absorb(county_id)
{err}variable {bf}inter_dma_*{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. areg turnout inter_2_dma_* inter_3_dma_* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    54,048
{txt}{col 49}F({res}  36{txt},{res}  51070{txt}){col 67}= {res}   1566.66
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9046
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8990
{txt}{col 49}Root MSE{col 67}= {res}    0.0779

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         turnout{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_dma_1920 {c |}{col 18}{res}{space 2} .0119471{col 30}{space 2} .0053556{col 41}{space 1}    2.23{col 50}{space 3}0.026{col 58}{space 4} .0014502{col 71}{space 3} .0224441
{txt}inter_2_dma_1922 {c |}{col 18}{res}{space 2} .0077038{col 30}{space 2} .0061357{col 41}{space 1}    1.26{col 50}{space 3}0.209{col 58}{space 4}-.0043223{col 71}{space 3} .0197299
{txt}inter_2_dma_1924 {c |}{col 18}{res}{space 2}-.0082297{col 30}{space 2} .0053231{col 41}{space 1}   -1.55{col 50}{space 3}0.122{col 58}{space 4}-.0186632{col 71}{space 3} .0022037
{txt}inter_2_dma_1926 {c |}{col 18}{res}{space 2} .0021048{col 30}{space 2} .0060692{col 41}{space 1}    0.35{col 50}{space 3}0.729{col 58}{space 4} -.009791{col 71}{space 3} .0140005
{txt}inter_2_dma_1928 {c |}{col 18}{res}{space 2}-.0145879{col 30}{space 2} .0053223{col 41}{space 1}   -2.74{col 50}{space 3}0.006{col 58}{space 4}-.0250196{col 71}{space 3}-.0041561
{txt}inter_2_dma_1930 {c |}{col 18}{res}{space 2}-.0020728{col 30}{space 2} .0060316{col 41}{space 1}   -0.34{col 50}{space 3}0.731{col 58}{space 4}-.0138947{col 71}{space 3} .0097492
{txt}inter_2_dma_1932 {c |}{col 18}{res}{space 2}-.0100112{col 30}{space 2} .0053116{col 41}{space 1}   -1.88{col 50}{space 3}0.059{col 58}{space 4} -.020422{col 71}{space 3} .0003996
{txt}inter_2_dma_1934 {c |}{col 18}{res}{space 2}-.0062037{col 30}{space 2} .0060147{col 41}{space 1}   -1.03{col 50}{space 3}0.302{col 58}{space 4}-.0179926{col 71}{space 3} .0055853
{txt}inter_2_dma_1936 {c |}{col 18}{res}{space 2}-.0129367{col 30}{space 2} .0053644{col 41}{space 1}   -2.41{col 50}{space 3}0.016{col 58}{space 4}-.0234511{col 71}{space 3}-.0024223
{txt}inter_2_dma_1938 {c |}{col 18}{res}{space 2}-.0169469{col 30}{space 2} .0060228{col 41}{space 1}   -2.81{col 50}{space 3}0.005{col 58}{space 4}-.0287517{col 71}{space 3}-.0051421
{txt}inter_2_dma_1940 {c |}{col 18}{res}{space 2} -.012018{col 30}{space 2} .0053523{col 41}{space 1}   -2.25{col 50}{space 3}0.025{col 58}{space 4}-.0225086{col 71}{space 3}-.0015275
{txt}inter_2_dma_1942 {c |}{col 18}{res}{space 2} .0266194{col 30}{space 2} .0060256{col 41}{space 1}    4.42{col 50}{space 3}0.000{col 58}{space 4} .0148092{col 71}{space 3} .0384297
{txt}inter_3_dma_1920 {c |}{col 18}{res}{space 2}-.0257519{col 30}{space 2} .0120743{col 41}{space 1}   -2.13{col 50}{space 3}0.033{col 58}{space 4}-.0494177{col 71}{space 3}-.0020862
{txt}inter_3_dma_1922 {c |}{col 18}{res}{space 2}-.0370963{col 30}{space 2} .0145638{col 41}{space 1}   -2.55{col 50}{space 3}0.011{col 58}{space 4}-.0656415{col 71}{space 3} -.008551
{txt}inter_3_dma_1924 {c |}{col 18}{res}{space 2}-.0599013{col 30}{space 2} .0120629{col 41}{space 1}   -4.97{col 50}{space 3}0.000{col 58}{space 4}-.0835448{col 71}{space 3}-.0362578
{txt}inter_3_dma_1926 {c |}{col 18}{res}{space 2} -.025124{col 30}{space 2} .0137678{col 41}{space 1}   -1.82{col 50}{space 3}0.068{col 58}{space 4}-.0521091{col 71}{space 3} .0018611
{txt}inter_3_dma_1928 {c |}{col 18}{res}{space 2}-.0316536{col 30}{space 2} .0120626{col 41}{space 1}   -2.62{col 50}{space 3}0.009{col 58}{space 4}-.0552964{col 71}{space 3}-.0080108
{txt}inter_3_dma_1930 {c |}{col 18}{res}{space 2}-.0286595{col 30}{space 2} .0135486{col 41}{space 1}   -2.12{col 50}{space 3}0.034{col 58}{space 4}-.0552149{col 71}{space 3} -.002104
{txt}inter_3_dma_1932 {c |}{col 18}{res}{space 2}-.0428372{col 30}{space 2}  .011952{col 41}{space 1}   -3.58{col 50}{space 3}0.000{col 58}{space 4}-.0662632{col 71}{space 3}-.0194112
{txt}inter_3_dma_1934 {c |}{col 18}{res}{space 2}-.0943129{col 30}{space 2} .0135469{col 41}{space 1}   -6.96{col 50}{space 3}0.000{col 58}{space 4}-.1208649{col 71}{space 3}-.0677609
{txt}inter_3_dma_1936 {c |}{col 18}{res}{space 2}-.0470953{col 30}{space 2} .0120241{col 41}{space 1}   -3.92{col 50}{space 3}0.000{col 58}{space 4}-.0706627{col 71}{space 3}-.0235279
{txt}inter_3_dma_1938 {c |}{col 18}{res}{space 2}-.0952105{col 30}{space 2} .0135888{col 41}{space 1}   -7.01{col 50}{space 3}0.000{col 58}{space 4}-.1218446{col 71}{space 3}-.0685764
{txt}inter_3_dma_1940 {c |}{col 18}{res}{space 2}-.0652064{col 30}{space 2} .0119697{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4}-.0886672{col 71}{space 3}-.0417456
{txt}inter_3_dma_1942 {c |}{col 18}{res}{space 2}-.0220786{col 30}{space 2} .0135486{col 41}{space 1}   -1.63{col 50}{space 3}0.103{col 58}{space 4}-.0486339{col 71}{space 3} .0044768
{txt}{space 16} {c |}
{space 12}year {c |}
{space 11}1920  {c |}{col 18}{res}{space 2}  .114579{col 30}{space 2} .0020537{col 41}{space 1}   55.79{col 50}{space 3}0.000{col 58}{space 4} .1105538{col 71}{space 3} .1186042
{txt}{space 11}1922  {c |}{col 18}{res}{space 2}-.0101358{col 30}{space 2} .0023906{col 41}{space 1}   -4.24{col 50}{space 3}0.000{col 58}{space 4}-.0148213{col 71}{space 3}-.0054502
{txt}{space 11}1924  {c |}{col 18}{res}{space 2} .0894267{col 30}{space 2} .0020469{col 41}{space 1}   43.69{col 50}{space 3}0.000{col 58}{space 4} .0854148{col 71}{space 3} .0934386
{txt}{space 11}1926  {c |}{col 18}{res}{space 2}-.0362873{col 30}{space 2} .0023434{col 41}{space 1}  -15.48{col 50}{space 3}0.000{col 58}{space 4}-.0408804{col 71}{space 3}-.0316941
{txt}{space 11}1928  {c |}{col 18}{res}{space 2} .1356296{col 30}{space 2} .0020448{col 41}{space 1}   66.33{col 50}{space 3}0.000{col 58}{space 4} .1316218{col 71}{space 3} .1396375
{txt}{space 11}1930  {c |}{col 18}{res}{space 2}  .005487{col 30}{space 2} .0023424{col 41}{space 1}    2.34{col 50}{space 3}0.019{col 58}{space 4} .0008958{col 71}{space 3} .0100782
{txt}{space 11}1932  {c |}{col 18}{res}{space 2} .1720738{col 30}{space 2}  .002044{col 41}{space 1}   84.19{col 50}{space 3}0.000{col 58}{space 4} .1680676{col 71}{space 3} .1760801
{txt}{space 11}1934  {c |}{col 18}{res}{space 2} .0772573{col 30}{space 2} .0023323{col 41}{space 1}   33.13{col 50}{space 3}0.000{col 58}{space 4}  .072686{col 71}{space 3} .0818286
{txt}{space 11}1936  {c |}{col 18}{res}{space 2} .1864899{col 30}{space 2} .0020451{col 41}{space 1}   91.19{col 50}{space 3}0.000{col 58}{space 4} .1824814{col 71}{space 3} .1904984
{txt}{space 11}1938  {c |}{col 18}{res}{space 2} .0666785{col 30}{space 2} .0023319{col 41}{space 1}   28.59{col 50}{space 3}0.000{col 58}{space 4}  .062108{col 71}{space 3}  .071249
{txt}{space 11}1940  {c |}{col 18}{res}{space 2} .1951088{col 30}{space 2} .0020534{col 41}{space 1}   95.02{col 50}{space 3}0.000{col 58}{space 4} .1910842{col 71}{space 3} .1991334
{txt}{space 11}1942  {c |}{col 18}{res}{space 2}-.0657562{col 30}{space 2} .0023421{col 41}{space 1}  -28.08{col 50}{space 3}0.000{col 58}{space 4}-.0703467{col 71}{space 3}-.0611657
{txt}{space 16} {c |}
{space 11}_cons {c |}{col 18}{res}{space 2}  .384329{col 30}{space 2} .0015582{col 41}{space 1}  246.66{col 50}{space 3}0.000{col 58}{space 4}  .381275{col 71}{space 3}  .387383
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       county_id {c |}    F(2941, 51070) = {res}   137.067   0.000        {txt}(2942 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. gen group_dma_2 = .
{txt}(55,917 missing values generated)

{com}. gen group_dma_3 = .
{txt}(55,917 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}.         forvalues i = 1920(2)1932 {c -(}
{txt}  2{com}.                 replace group_dma_2 = _b[inter_2_dma_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_dma_3 = _b[inter_3_dma_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{txt}(526 real changes made)
(4,648 real changes made)
(263 real changes made)
(2,324 real changes made)
(526 real changes made)
(4,648 real changes made)
(263 real changes made)
(2,324 real changes made)
(526 real changes made)
(4,648 real changes made)
(263 real changes made)
(2,324 real changes made)
(526 real changes made)
(4,648 real changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_dma_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_dma_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3")) note("DMA-Level Analysis")
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_pres_dma.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_pres_dma.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_dma_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_dma_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls. DMA Level Analysis") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3")) 
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_pres_dma.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_pres_dma.png written in PNG format)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. twoway (scatter group_dma_2 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_dma_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls. DMA Level Analysis") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD13748.000000"
{txt}
{com}. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
.         preserve
{txt}
{com}.                 keep group totpop county_id
{txt}
{com}.                 duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}.                 isid county_id
{txt}
{com}.                 gen scal_totpop = totpop/1000000
{txt}(12 missing values generated)

{com}.                 graph hbar (sum) scal_totpop , over(group) ytitle("Population (Millions)") title("Waves of Radio by 1930 Population") 
{res}{txt}
{com}.         restore 
{txt}
{com}. 
. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. ** Include interaction because group is completely determine by 
. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. 
. ** graph the coefficients ** 
. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}. gen group_3 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2 = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_3 = _b[inter_3_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{txt}(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)

{com}.         sort year
{txt}
{com}. 
.         sort year
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_pres.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_pres.png written in PNG format)

{com}. 
. twoway (scatter group_2 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. graph export  "/Users/lilyhoffman/Desktop/intercept_nonpres.png", as(png) replace
{txt}(file /Users/lilyhoffman/Desktop/intercept_nonpres.png written in PNG format)

{com}. 
. ****** DMA interactions ********** 
. 
{txt}end of do-file

{com}. 