{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/5_scatter_plot.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2017, 17:54:10
{txt}
{com}. cd "~/Google Drive/Mass Media/Lily/Output/"
{res}/Users/lilyhoffman/Google Drive/Mass Media/Lily/Output
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. 
. use "${c -(}output{c )-}merged_radio_voting", clear
{txt}
{com}. ** clean by outcome (voting) 
. ** elections: 
. forvalues i = 4/401 {c -(}
{txt}  2{com}.         drop V`i'
{txt}  3{com}.         {c )-}       
{txt}
{com}. forvalues i = 511/759 {c -(}
{txt}  2{com}.         drop V`i'
{txt}  3{com}.         {c )-}
{txt}
{com}. loc j = 1
{txt}
{com}. foreach var in V402 V409 V418 V428 V434 V443 V452 V458 V468 V477 V483 V490 V498 V504 {c -(}
{txt}  2{com}.         replace `var' = . if `var' > 100
{txt}  3{com}.         replace `var' = . if `var' == 0 
{txt}  4{com}.         rename `var' dem`j'
{txt}  5{com}.         loc j = `j' + 1
{txt}  6{com}.         {c )-}
{txt}(347 real changes made, 347 to missing)
(1 real change made, 1 to missing)
{res}{txt}(874 real changes made, 874 to missing)
(601 real changes made, 601 to missing)
{res}{txt}(698 real changes made, 698 to missing)
(894 real changes made, 894 to missing)
{res}{txt}(312 real changes made, 312 to missing)
(0 real changes made)
{res}{txt}(542 real changes made, 542 to missing)
(946 real changes made, 946 to missing)
{res}{txt}(596 real changes made, 596 to missing)
(969 real changes made, 969 to missing)
{res}{txt}(300 real changes made, 300 to missing)
(0 real changes made)
{res}{txt}(323 real changes made, 323 to missing)
(776 real changes made, 776 to missing)
{res}{txt}(349 real changes made, 349 to missing)
(969 real changes made, 969 to missing)
{res}{txt}(273 real changes made, 273 to missing)
(0 real changes made)
{res}{txt}(283 real changes made, 283 to missing)
(509 real changes made, 509 to missing)
{res}{txt}(374 real changes made, 374 to missing)
(824 real changes made, 824 to missing)
{res}{txt}(272 real changes made, 272 to missing)
(0 real changes made)
{res}{txt}(295 real changes made, 295 to missing)
(100 real changes made, 100 to missing)
{res}{txt}
{com}. loc k = 1
{txt}
{com}. foreach var in V403 V410 V419 V429 V435 V444 V453 V459 V469 V478 V484 V491 V499 V505 {c -(}
{txt}  2{com}.         replace `var' = . if `var' > 100
{txt}  3{com}.         replace `var' = . if `var' == 0 
{txt}  4{com}.         rename `var' rep`k'
{txt}  5{com}.         loc k = `k' + 1
{txt}  6{com}.         {c )-}
{txt}(347 real changes made, 347 to missing)
(21 real changes made, 21 to missing)
{res}{txt}(874 real changes made, 874 to missing)
(925 real changes made, 925 to missing)
{res}{txt}(698 real changes made, 698 to missing)
(1,785 real changes made, 1,785 to missing)
{res}{txt}(312 real changes made, 312 to missing)
(11 real changes made, 11 to missing)
{res}{txt}(542 real changes made, 542 to missing)
(971 real changes made, 971 to missing)
{res}{txt}(596 real changes made, 596 to missing)
(1,059 real changes made, 1,059 to missing)
{res}{txt}(300 real changes made, 300 to missing)
(7 real changes made, 7 to missing)
{res}{txt}(323 real changes made, 323 to missing)
(1,116 real changes made, 1,116 to missing)
{res}{txt}(349 real changes made, 349 to missing)
(1,054 real changes made, 1,054 to missing)
{res}{txt}(273 real changes made, 273 to missing)
(9 real changes made, 9 to missing)
{res}{txt}(279 real changes made, 279 to missing)
(1,238 real changes made, 1,238 to missing)
{res}{txt}(334 real changes made, 334 to missing)
(1,624 real changes made, 1,624 to missing)
{res}{txt}(272 real changes made, 272 to missing)
(113 real changes made, 113 to missing)
{res}{txt}(294 real changes made, 294 to missing)
(706 real changes made, 706 to missing)
{res}{txt}
{com}. loc i = 1
{txt}
{com}. foreach var in V408 V417 V427 V433 V442 V451 V457 V467 V476 V482 V489 V497 V503 V510 {c -(}
{txt}  2{com}.         replace `var' = . if `var' > 100
{txt}  3{com}.         replace `var' = . if `var' == 0 
{txt}  4{com}.         rename `var' percent_vote`i'
{txt}  5{com}.         loc i = `i' + 1
{txt}  6{com}.         {c )-}
{txt}(586 real changes made, 586 to missing)
(0 real changes made)
{res}{txt}(1,096 real changes made, 1,096 to missing)
(0 real changes made)
{res}{txt}(936 real changes made, 936 to missing)
(0 real changes made)
{res}{txt}(432 real changes made, 432 to missing)
(1 real change made, 1 to missing)
{res}{txt}(731 real changes made, 731 to missing)
(0 real changes made)
{res}{txt}(1,141 real changes made, 1,141 to missing)
(0 real changes made)
{res}{txt}(449 real changes made, 449 to missing)
(0 real changes made)
{res}{txt}(480 real changes made, 480 to missing)
(0 real changes made)
{res}{txt}(498 real changes made, 498 to missing)
(0 real changes made)
{res}{txt}(423 real changes made, 423 to missing)
(0 real changes made)
{res}{txt}(395 real changes made, 395 to missing)
(0 real changes made)
{res}{txt}(378 real changes made, 378 to missing)
(0 real changes made)
{res}{txt}(394 real changes made, 394 to missing)
(0 real changes made)
{res}{txt}(417 real changes made, 417 to missing)
(0 real changes made)
{res}{txt}
{com}. 
. loc i = 1
{txt}
{com}. foreach var in V407 V416 V426 V432 V441 V450 V456 V466 V475 V481 V488 V496 V502 V509 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 9999999
{txt}  3{com}.         replace `var' = . if `var' == 0 
{txt}  4{com}.         rename `var' total_vote`i'
{txt}  5{com}.         loc i = `i' + 1
{txt}  6{com}.         {c )-}
{txt}(347 real changes made, 347 to missing)
(0 real changes made)
{res}{txt}(874 real changes made, 874 to missing)
(0 real changes made)
{res}{txt}(698 real changes made, 698 to missing)
(0 real changes made)
{res}{txt}(311 real changes made, 311 to missing)
(1 real change made, 1 to missing)
{res}{txt}(542 real changes made, 542 to missing)
(0 real changes made)
{res}{txt}(596 real changes made, 596 to missing)
(0 real changes made)
{res}{txt}(300 real changes made, 300 to missing)
(0 real changes made)
{res}{txt}(323 real changes made, 323 to missing)
(0 real changes made)
{res}{txt}(349 real changes made, 349 to missing)
(0 real changes made)
{res}{txt}(273 real changes made, 273 to missing)
(0 real changes made)
{res}{txt}(283 real changes made, 283 to missing)
(0 real changes made)
{res}{txt}(334 real changes made, 334 to missing)
(0 real changes made)
{res}{txt}(271 real changes made, 271 to missing)
(1 real change made, 1 to missing)
{res}{txt}(295 real changes made, 295 to missing)
(0 real changes made)
{res}{txt}
{com}. 
. drop V*
{txt}
{com}. egen max_total_vote = rowmax(total_vote*) 
{txt}(260 missing values generated)

{com}. egen max_total_perc = rowmax(percent_vote*)
{txt}(269 missing values generated)

{com}. drop if missing(max_total_perc) & missing(max_total_vote) & station == ""
{txt}(257 observations deleted)

{com}. drop max_total_perc max_total_vote
{txt}
{com}. 
. 
. replace frequency = . if frequency >= 99999
{txt}(17 real changes made, 17 to missing)

{com}. bys dmaindex year: egen min_freq_dma = min(frequency) 
{txt}(2460 missing values generated)

{com}. bys dmaindex year: egen total_dma = total(total_station)
{txt}
{com}. 
. drop  station frequency
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(2,538 observations deleted)

{com}. 
. 
. bys dmaindex: egen first_dma = min(year)
{txt}(77 missing values generated)

{com}. bys dmaindex2: egen first_dma2 = min(year) 
{txt}(5 missing values generated)

{com}. replace first_dma = first_dma2 if first_dma2 < first_dma & !missing(dmaindex2) 
{txt}(0 real changes made)

{com}. bys county state: egen first_county = min(year)
{txt}(2456 missing values generated)

{com}. 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)

{com}. 
. 
. preserve
{txt}
{com}. drop if missing(year)
{txt}(2,456 observations deleted)

{com}. isid state year county
{txt}
{com}. collapse (sum) total_station, by(year)
{txt}
{com}. sort year
{txt}
{com}. scatter total_station year, mlabel(total_station) ytitle("Total Stations") title("Total Broadcasting Stations by Year") connect(l) subtitle("Yearly Measurement: June 30th") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/total_stations", replace)
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/total_stations.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/total_stations.gph saved)

{com}. restore 
{txt}
{com}. 
. drop total_station year total_dma min_freq_dma
{txt}
{com}. duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(2,543 observations deleted)

{com}. isid state county
{txt}
{com}. 
. hist first_dma, frequency ytitle("Total Counties") title("Year of First Broadcasting Station") xtitle("Year") subtitle("By DMA") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_dma", replace)
{txt}(bin={res}34{txt}, start={res}1922{txt}, width={res}.26470588{txt})
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_dma.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_dma.gph saved)

{com}. hist first_county, frequency ytitle("Total Counties") title("Year of First Broadcasting Station") xtitle("Year") subtitle("By County") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_county", replace)
{txt}(bin={res}25{txt}, start={res}1922{txt}, width={res}.36{txt})
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_county.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/hist_county.gph saved)

{com}. 
. ** Table of mean by first year
. 
. preserve
{txt}
{com}. 
. collapse (sum) radiorep famtot, by(first_dma)
{txt}
{com}. sort first_dma
{txt}
{com}. gen percent_radio = radiorep/famtot
{txt}
{com}. twoway scatter percent_radio first_dma, ysc(range(0 .5)) ylabel(0(.1).5) ytitle("Families Radio Ownership") xtitle("First Year Broadcasting in DMA") ///
>  title("Family Radio Ownership by DMA First Broadcasting Year") subtitle("1930 Census") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership", replace)
{res}{txt}(note: file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership.gph not found)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/radio_ownership.gph saved)

{com}. restore
{txt}
{com}. 
. save "${c -(}ouput{c )-}panel_data", replace
{txt}file panel_data.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/5_scatter_plot.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2017, 17:54:21
{txt}{.-}
{smcl}
{txt}{sf}{ul off}