{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/6_radio_reg.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Feb 2017, 18:23:24
{txt}
{com}. 
. global input "~/Google Drive/Mass Media/Lily/Data/"
{txt}
{com}. global temp "~/Google Drive/Mass Media/Lily/Temp/"
{txt}
{com}. 
. 
. *** reshape for analysis 
. loc year = "1916 1916 1918 1920 1920 1922 1924 1924 1926 1928 1928 1930 1932 1932"
{txt}
{com}. loc pres = "10010010010010"
{txt}
{com}. 
. loc j = 1
{txt}
{com}. forvalues i = 1/14 {c -(}
{txt}  2{com}.  use "${c -(}output{c )-}panel_data.dta"
{txt}  3{com}.  rename (dem`i' rep`i' total_vote`i' percent_vote`i') (Democrat Republican overall turnout)
{txt}  4{com}. drop dem* rep* total_vote* percent_vote*
{txt}  5{com}. gen presidential = substr("`pres'", `i', 1)
{txt}  6{com}. gen year= substr("`year'", `j', 4)
{txt}  7{com}. loc j = `j' + 5
{txt}  8{com}. save "${c -(}temp{c )-}part`i'", replace
{txt}  9{com}. {c )-}
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part1.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part2.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part3.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part4.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part5.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part6.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part7.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part8.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part9.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part10.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part11.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part12.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part13.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part14.dta saved

{com}. 
.         forvalues i = 1/13 {c -(}
{txt}  2{com}.                 append using "${c -(}temp{c )-}part`i'"
{txt}  3{com}.         {c )-}
{txt}(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)

{com}.         destring year, replace
{txt}year: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}.         destring presidential, replace
{txt}presidential: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}.         assert !missing(year)
{txt}
{com}. 
. 
. gen dma_ind = 1 if first_dma <= year & !missing(first_dma)
{txt}(18,346 missing values generated)

{com}. replace dma_ind = 0 if missing(dma_ind)
{txt}(18,346 real changes made)

{com}. gen county_ind = 1 if first_county <= year & !missing(first_county) 
{txt}(38,803 missing values generated)

{com}. replace county_ind = 0 if missing(county_ind)
{txt}(38,803 real changes made)

{com}. 
. ** Create variables of interest ***  
. bys year: egen president_year = max(presidential)
{txt}
{com}.  
.         gen interest = dma_ind*(year-first_dma)
{txt}(1,078 missing values generated)

{com}.         replace interest = . if mi(dmaindex)
{txt}(2,296 real changes made, 2,296 to missing)

{com}. 
. gen interest_county = county_ind*(year-first_county)
{txt}(34,384 missing values generated)

{com}. replace interest_county = 0 if county_ind ==0 
{txt}(34,384 real changes made)

{com}. egen county_id = group(county state)
{txt}
{com}. egen county_year = group(county_id year)
{txt}
{com}. label var turnout "Overall Turnout" 
{txt}
{com}. 
. save "${c -(}output{c )-}analysis", replace
{txt}file ~/Google Drive/Mass Media/Lily/Output/analysis.dta saved

{com}. 
. 
. replace turnout = turnout/100
{txt}(41,121 real changes made)

{com}. 
.  merge m:1 county state using "${c -(}input{c )-}census_part1", keep(1 3) nogen keepusing(area urb930 totpop density area tillit10 totunemp whtot)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             196
{txt}{col 9}from master{col 30}{res}             196{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}          43,288{txt}  
{col 5}{hline 41}

{com}.  gen percent_urban = urb930/totpop
{txt}(196 missing values generated)

{com}.  gen percent_nonwhite = 1-(whtot/totpop)
{txt}(196 missing values generated)

{com}.  gen percent_illit = tillit10/totpop
{txt}(196 missing values generated)

{com}.  gen percent_unemploy = totunemp/totpop
{txt}(196 missing values generated)

{com}.  gen log_pop = log(totpop)
{txt}(112 missing values generated)

{com}. label var log_pop "Log Population" 
{txt}
{com}. 
. preserve
{txt}
{com}. collapse (sum) famtot totpop, by(year dma_ind)
{txt}
{com}. sort year
{txt}
{com}. keep if year >= 1920 & year <= 1930
{txt}(4 observations deleted)

{com}. replace totpop = totpop/1000000
{txt}(11 real changes made)

{com}. twoway (scatter totpop year if dma_ind == 1) (scatter totpop year if dma_ind == 0), ytitle("Population Total (Millions)") ///
> legend(order(1 "Broadcasting" 2 "No Broadcasting")) title("Same DMA Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_access", replace)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_access.gph saved)

{com}. restore
{txt}
{com}. 
.  ** Include absolute percentage differences between replubican and democrat percentages
.  gen percent_rep = Republican/overall
{txt}(7,061 missing values generated)

{com}.  replace percent_rep = . if percent_rep > 1
{txt}(10 real changes made, 10 to missing)

{com}.  gen percent_dem = Democrat/overall 
{txt}(3,591 missing values generated)

{com}.  replace percent_dem = . if percent_dem > 1
{txt}(249 real changes made, 249 to missing)

{com}.  
.  gen party_diff = abs(percent_rep - percent_dem) 
{txt}(8,532 missing values generated)

{com}. label var party_diff "Party Difference"
{txt}
{com}. label var interest "Years Broadcasting"
{txt}
{com}. 
. 
. gen interest_dma = interest_county if dma_ind == 1
{txt}(18,346 missing values generated)

{com}. count if dma_ind == 1 & county_ind == 0
  {res}20,457
{txt}
{com}. assert dma_ind != 0 if county_ind ==1
{txt}
{com}. lab var dma_ind "DMA Broadcasting"
{txt}
{com}. 
. gen interest_pres_county = interest_county*president_year
{txt}
{com}. gen interest_pres = interest*president_year
{txt}(3,374 missing values generated)

{com}. label var interest_pres "Years Broadcasting * Presidential"
{txt}
{com}. 
. label var interest_pres_county "Pres. Interaction"
{txt}
{com}. gen interest_sq = interest*interest
{txt}(3,374 missing values generated)

{com}. label var interest_sq "Quadratic Years Broadcasting"
{txt}
{com}. 
. gen county_sq = interest_county * interest_county
{txt}
{com}. 
. drop if (year < 1921 | year > 1931)
{txt}(21,742 observations deleted)

{com}. 
. foreach var in  percent_urban percent_nonwhite log_pop party_diff{c -(}
{txt}  2{com}. gen inter_`var' = interest_county * `var'
{txt}  3{com}. gen dma_inter_`var' = interest* `var'
{txt}  4{com}. {c )-}
{txt}(98 missing values generated)
(1,729 missing values generated)
(98 missing values generated)
(1,729 missing values generated)
(56 missing values generated)
(1,687 missing values generated)
(4,685 missing values generated)
(5,690 missing values generated)

{com}. 
. 
. preserve
{txt}
{com}. keep first_dma first_county county state_code percent_nonwhite percent_illit log_pop state
{txt}
{com}. duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(18,636 observations deleted)

{com}. isid state county 
{txt}
{com}. save "${c -(}temp{c )-}merge_newspaper", replace
{txt}file ~/Google Drive/Mass Media/Lily/Temp/merge_newspaper.dta saved

{com}. restore
{txt}
{com}. 
. label var inter_percent_nonwhite "Percent Nonwhite"
{txt}
{com}. label var inter_percent_urban "Percent Urban"
{txt}
{com}. label var inter_log_pop "Log Population"
{txt}
{com}. lab var interest_county "Years Broadcasting"
{txt}
{com}. lab var turnout "Turnout"
{txt}
{com}. label var interest_pres_county "Years Broadcasting * Presidential Year" 
{txt}
{com}. label var dma_ind "DMA Broadcasting"
{txt}
{com}. label var county_sq "Quadratic Years Broadcasting"
{txt}
{com}.  label var president_year "Presidential Year"
{txt}
{com}.  label var dma_inter_percent_urban "Percent Urban * Years Broadcasting"
{txt}
{com}.  label var dma_inter_percent_nonwhite "Percent Nonwhite * Years Broadcasting" 
{txt}
{com}.  label var dma_inter_log_pop "Log Population * Years Broadcasting" 
{txt}
{com}.  
. 
. eststo: areg turnout interest_county i.year,   absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    20,958
{txt}{col 49}F({res}   5{txt},{res}   3094{txt}){col 67}= {res}   1587.88
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9309
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9189
{txt}{col 49}Root MSE{col 67}= {res}    0.0670

{txt}{ralign 81:(Std. Err. adjusted for {res:3,095} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0001742{col 29}{space 2} .0005888{col 40}{space 1}   -0.30{col 49}{space 3}0.767{col 57}{space 4}-.0013288{col 70}{space 3} .0009804
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0937852{col 29}{space 2} .0020308{col 40}{space 1}   46.18{col 49}{space 3}0.000{col 57}{space 4} .0898033{col 70}{space 3} .0977671
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0276717{col 29}{space 2} .0018199{col 40}{space 1}  -15.21{col 49}{space 3}0.000{col 57}{space 4}  -.03124{col 70}{space 3}-.0241035
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .1407688{col 29}{space 2} .0024028{col 40}{space 1}   58.59{col 49}{space 3}0.000{col 57}{space 4} .1360575{col 70}{space 3}   .14548
{txt}{space 10}1930  {c |}{col 17}{res}{space 2} .0137765{col 29}{space 2} .0023048{col 40}{space 1}    5.98{col 49}{space 3}0.000{col 57}{space 4} .0092574{col 70}{space 3} .0182956
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3649708{col 29}{space 2} .0015776{col 40}{space 1}  231.35{col 49}{space 3}0.000{col 57}{space 4} .3618776{col 70}{space 3} .3680641
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3095 categories)
({res}est1{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    20,958
{txt}{col 49}F({res}   6{txt},{res}   3094{txt}){col 67}= {res}   1403.19
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9321
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9203
{txt}{col 49}Root MSE{col 67}= {res}    0.0664

{txt}{ralign 81:(Std. Err. adjusted for {res:3,095} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0038921{col 29}{space 2} .0006271{col 40}{space 1}   -6.21{col 49}{space 3}0.000{col 57}{space 4}-.0051217{col 70}{space 3}-.0026625
{txt}interest_pres~y {c |}{col 17}{res}{space 2} .0110176{col 29}{space 2}  .000897{col 40}{space 1}   12.28{col 49}{space 3}0.000{col 57}{space 4} .0092589{col 70}{space 3} .0127763
{txt}{space 1}president_year {c |}{col 17}{res}{space 2} .1347641{col 29}{space 2} .0024417{col 40}{space 1}   55.19{col 49}{space 3}0.000{col 57}{space 4} .1299765{col 70}{space 3} .1395516
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0423431{col 29}{space 2} .0014537{col 40}{space 1}  -29.13{col 49}{space 3}0.000{col 57}{space 4}-.0451934{col 70}{space 3}-.0394928
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0258804{col 29}{space 2} .0018214{col 40}{space 1}  -14.21{col 49}{space 3}0.000{col 57}{space 4}-.0294516{col 70}{space 3}-.0223092
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0183493{col 29}{space 2} .0023237{col 40}{space 1}    7.90{col 49}{space 3}0.000{col 57}{space 4} .0137932{col 70}{space 3} .0229054
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3649746{col 29}{space 2} .0015736{col 40}{space 1}  231.93{col 49}{space 3}0.000{col 57}{space 4} .3618892{col 70}{space 3} .3680601
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3095 categories)
({res}est2{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year party_diff county_sq i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,743
{txt}{col 49}F({res}   8{txt},{res}   3075{txt}){col 67}= {res}    849.12
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9237
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9065
{txt}{col 49}Root MSE{col 67}= {res}    0.0641

{txt}{ralign 81:(Std. Err. adjusted for {res:3,076} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0079674{col 29}{space 2} .0019631{col 40}{space 1}   -4.06{col 49}{space 3}0.000{col 57}{space 4}-.0118165{col 70}{space 3}-.0041182
{txt}interest_pres~y {c |}{col 17}{res}{space 2} .0126408{col 29}{space 2} .0010423{col 40}{space 1}   12.13{col 49}{space 3}0.000{col 57}{space 4} .0105972{col 70}{space 3} .0146844
{txt}{space 1}president_year {c |}{col 17}{res}{space 2} .1383083{col 29}{space 2} .0030014{col 40}{space 1}   46.08{col 49}{space 3}0.000{col 57}{space 4} .1324235{col 70}{space 3} .1441932
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.1939374{col 29}{space 2} .0258008{col 40}{space 1}   -7.52{col 49}{space 3}0.000{col 57}{space 4} -.244526{col 70}{space 3}-.1433488
{txt}{space 6}county_sq {c |}{col 17}{res}{space 2} .0004336{col 29}{space 2} .0002538{col 40}{space 1}    1.71{col 49}{space 3}0.088{col 57}{space 4} -.000064{col 70}{space 3} .0009312
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0432911{col 29}{space 2} .0015564{col 40}{space 1}  -27.81{col 49}{space 3}0.000{col 57}{space 4}-.0463428{col 70}{space 3}-.0402393
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0231223{col 29}{space 2}  .002451{col 40}{space 1}   -9.43{col 49}{space 3}0.000{col 57}{space 4}-.0279281{col 70}{space 3}-.0183164
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0244698{col 29}{space 2} .0029482{col 40}{space 1}    8.30{col 49}{space 3}0.000{col 57}{space 4} .0186892{col 70}{space 3} .0302504
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4192884{col 29}{space 2} .0021652{col 40}{space 1}  193.65{col 49}{space 3}0.000{col 57}{space 4} .4150431{col 70}{space 3} .4235337
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3076 categories)
({res}est3{txt} stored)

{com}. 
. 
.  esttab est1 est2 est3 using "/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/county.csv", label star se stats(ar2 N) replace drop(*.year) 
{res}{txt}(output written to {browse  `"/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/county.csv"'})

{com}. 
. 
. ** Allowing heteregenoeity in time and years broadcasting by 
. eststo: areg turnout interest_county i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year,   absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    20,917
{txt}{col 49}F({res}  17{txt},{res}   3088{txt}){col 67}= {res}    660.68
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9369
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9259
{txt}{col 49}Root MSE{col 67}= {res}    0.0641

{txt}{ralign 81:(Std. Err. adjusted for {res:3,089} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0022622{col 29}{space 2} .0006931{col 40}{space 1}   -3.26{col 49}{space 3}0.001{col 57}{space 4}-.0036211{col 70}{space 3}-.0009032
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0490838{col 29}{space 2}   .00867{col 40}{space 1}    5.66{col 49}{space 3}0.000{col 57}{space 4} .0320843{col 70}{space 3} .0660833
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.0726463{col 29}{space 2} .0081933{col 40}{space 1}   -8.87{col 49}{space 3}0.000{col 57}{space 4}-.0887111{col 70}{space 3}-.0565815
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0528919{col 29}{space 2} .0063566{col 40}{space 1}    8.32{col 49}{space 3}0.000{col 57}{space 4} .0404282{col 70}{space 3} .0653555
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1204058{col 29}{space 2} .0074021{col 40}{space 1}  -16.27{col 49}{space 3}0.000{col 57}{space 4}-.1349193{col 70}{space 3}-.1058923
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0062762{col 29}{space 2} .0117771{col 40}{space 1}    0.53{col 49}{space 3}0.594{col 57}{space 4}-.0168155{col 70}{space 3} .0293678
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0248633{col 29}{space 2} .0106256{col 40}{space 1}    2.34{col 49}{space 3}0.019{col 57}{space 4} .0040293{col 70}{space 3} .0456974
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0248321{col 29}{space 2} .0082537{col 40}{space 1}    3.01{col 49}{space 3}0.003{col 57}{space 4} .0086488{col 70}{space 3} .0410154
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}  .038557{col 29}{space 2} .0096873{col 40}{space 1}    3.98{col 49}{space 3}0.000{col 57}{space 4} .0195627{col 70}{space 3} .0575513
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}-.0025155{col 29}{space 2} .0032766{col 40}{space 1}   -0.77{col 49}{space 3}0.443{col 57}{space 4}-.0089401{col 70}{space 3} .0039091
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0098665{col 29}{space 2} .0029683{col 40}{space 1}    3.32{col 49}{space 3}0.001{col 57}{space 4} .0040464{col 70}{space 3} .0156866
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0066622{col 29}{space 2} .0022371{col 40}{space 1}   -2.98{col 49}{space 3}0.003{col 57}{space 4}-.0110485{col 70}{space 3}-.0022758
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0217571{col 29}{space 2} .0024955{col 40}{space 1}    8.72{col 49}{space 3}0.000{col 57}{space 4} .0168641{col 70}{space 3} .0266501
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0154847{col 29}{space 2}  .026228{col 40}{space 1}   -0.59{col 49}{space 3}0.555{col 57}{space 4}-.0669107{col 70}{space 3} .0359414
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0092479{col 29}{space 2} .0256202{col 40}{space 1}    0.36{col 49}{space 3}0.718{col 57}{space 4}-.0409864{col 70}{space 3} .0594822
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.0804821{col 29}{space 2} .0286431{col 40}{space 1}   -2.81{col 49}{space 3}0.005{col 57}{space 4}-.1366435{col 70}{space 3}-.0243207
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}-.0008131{col 29}{space 2} .0307175{col 40}{space 1}   -0.03{col 49}{space 3}0.979{col 57}{space 4} -.061042{col 70}{space 3} .0594157
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2}  .382125{col 29}{space 2} .0306658{col 40}{space 1}   12.46{col 49}{space 3}0.000{col 57}{space 4} .3219976{col 70}{space 3} .4422524
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3089 categories)
({res}est4{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    20,917
{txt}{col 49}F({res}  18{txt},{res}   3088{txt}){col 67}= {res}    623.94
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9369
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9259
{txt}{col 49}Root MSE{col 67}= {res}    0.0641

{txt}{ralign 81:(Std. Err. adjusted for {res:3,089} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0022638{col 29}{space 2} .0007769{col 40}{space 1}   -2.91{col 49}{space 3}0.004{col 57}{space 4} -.003787{col 70}{space 3}-.0007406
{txt}interest_pres~y {c |}{col 17}{res}{space 2} 4.53e-06{col 29}{space 2} .0010354{col 40}{space 1}    0.00{col 49}{space 3}0.997{col 57}{space 4}-.0020256{col 70}{space 3} .0020346
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0804666{col 29}{space 2} .0289358{col 40}{space 1}   -2.78{col 49}{space 3}0.005{col 57}{space 4}-.1372019{col 70}{space 3}-.0237314
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0490857{col 29}{space 2}   .00869{col 40}{space 1}    5.65{col 49}{space 3}0.000{col 57}{space 4} .0320469{col 70}{space 3} .0661246
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.0726437{col 29}{space 2} .0082406{col 40}{space 1}   -8.82{col 49}{space 3}0.000{col 57}{space 4}-.0888014{col 70}{space 3}-.0564861
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0528931{col 29}{space 2} .0063656{col 40}{space 1}    8.31{col 49}{space 3}0.000{col 57}{space 4} .0404118{col 70}{space 3} .0653743
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1204012{col 29}{space 2} .0075477{col 40}{space 1}  -15.95{col 49}{space 3}0.000{col 57}{space 4}-.1352002{col 70}{space 3}-.1056022
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0062708{col 29}{space 2} .0118287{col 40}{space 1}    0.53{col 49}{space 3}0.596{col 57}{space 4} -.016922{col 70}{space 3} .0294637
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0248561{col 29}{space 2}  .010672{col 40}{space 1}    2.33{col 49}{space 3}0.020{col 57}{space 4} .0039311{col 70}{space 3}  .045781
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0248289{col 29}{space 2} .0082849{col 40}{space 1}    3.00{col 49}{space 3}0.003{col 57}{space 4} .0085845{col 70}{space 3} .0410733
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0385443{col 29}{space 2} .0100164{col 40}{space 1}    3.85{col 49}{space 3}0.000{col 57}{space 4} .0189047{col 70}{space 3} .0581839
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}-.0025168{col 29}{space 2} .0032955{col 40}{space 1}   -0.76{col 49}{space 3}0.445{col 57}{space 4}-.0089784{col 70}{space 3} .0039448
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0098647{col 29}{space 2}  .003017{col 40}{space 1}    3.27{col 49}{space 3}0.001{col 57}{space 4} .0039491{col 70}{space 3} .0157803
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0066628{col 29}{space 2} .0022458{col 40}{space 1}   -2.97{col 49}{space 3}0.003{col 57}{space 4}-.0110664{col 70}{space 3}-.0022593
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0217541{col 29}{space 2} .0026245{col 40}{space 1}    8.29{col 49}{space 3}0.000{col 57}{space 4} .0166082{col 70}{space 3} .0269001
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0649864{col 29}{space 2} .0181002{col 40}{space 1}    3.59{col 49}{space 3}0.000{col 57}{space 4} .0294968{col 70}{space 3}  .100476
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0092423{col 29}{space 2} .0256628{col 40}{space 1}    0.36{col 49}{space 3}0.719{col 57}{space 4}-.0410755{col 70}{space 3} .0595601
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2}-.0008249{col 29}{space 2} .0308876{col 40}{space 1}   -0.03{col 49}{space 3}0.979{col 57}{space 4}-.0613872{col 70}{space 3} .0597374
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3821387{col 29}{space 2} .0308848{col 40}{space 1}   12.37{col 49}{space 3}0.000{col 57}{space 4} .3215818{col 70}{space 3} .4426956
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3089 categories)
({res}est5{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year party_diff i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  19{txt},{res}   3069{txt}){col 67}= {res}    473.32
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9311
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9155
{txt}{col 49}Root MSE{col 67}= {res}    0.0609

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0022461{col 29}{space 2} .0009144{col 40}{space 1}   -2.46{col 49}{space 3}0.014{col 57}{space 4} -.004039{col 70}{space 3}-.0004531
{txt}interest_pres~y {c |}{col 17}{res}{space 2}-.0008921{col 29}{space 2} .0011335{col 40}{space 1}   -0.79{col 49}{space 3}0.431{col 57}{space 4}-.0031146{col 70}{space 3} .0013304
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1796504{col 29}{space 2} .0315638{col 40}{space 1}   -5.69{col 49}{space 3}0.000{col 57}{space 4}-.2415387{col 70}{space 3} -.117762
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3793886{col 29}{space 2} .0315599{col 40}{space 1}  -12.02{col 49}{space 3}0.000{col 57}{space 4}-.4412691{col 70}{space 3} -.317508
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0279118{col 29}{space 2} .0190736{col 40}{space 1}    1.46{col 49}{space 3}0.143{col 57}{space 4}-.0094865{col 70}{space 3} .0653101
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.1170808{col 29}{space 2} .0176833{col 40}{space 1}   -6.62{col 49}{space 3}0.000{col 57}{space 4}-.1517531{col 70}{space 3}-.0824084
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0518786{col 29}{space 2} .0129506{col 40}{space 1}    4.01{col 49}{space 3}0.000{col 57}{space 4} .0264858{col 70}{space 3} .0772714
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} -.182868{col 29}{space 2} .0167053{col 40}{space 1}  -10.95{col 49}{space 3}0.000{col 57}{space 4}-.2156226{col 70}{space 3}-.1501133
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}  -.00472{col 29}{space 2} .0142144{col 40}{space 1}   -0.33{col 49}{space 3}0.740{col 57}{space 4}-.0325908{col 70}{space 3} .0231508
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0104295{col 29}{space 2} .0127912{col 40}{space 1}    0.82{col 49}{space 3}0.415{col 57}{space 4}-.0146507{col 70}{space 3} .0355097
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0198136{col 29}{space 2} .0107317{col 40}{space 1}    1.85{col 49}{space 3}0.065{col 57}{space 4}-.0012285{col 70}{space 3} .0408557
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0249555{col 29}{space 2} .0121737{col 40}{space 1}    2.05{col 49}{space 3}0.040{col 57}{space 4} .0010861{col 70}{space 3} .0488248
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0011107{col 29}{space 2} .0037053{col 40}{space 1}    0.30{col 49}{space 3}0.764{col 57}{space 4}-.0061544{col 70}{space 3} .0083759
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0194211{col 29}{space 2} .0034558{col 40}{space 1}    5.62{col 49}{space 3}0.000{col 57}{space 4} .0126452{col 70}{space 3}  .026197
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0076598{col 29}{space 2} .0027413{col 40}{space 1}   -2.79{col 49}{space 3}0.005{col 57}{space 4}-.0130348{col 70}{space 3}-.0022848
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0352816{col 29}{space 2} .0029922{col 40}{space 1}   11.79{col 49}{space 3}0.000{col 57}{space 4} .0294147{col 70}{space 3} .0411485
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .1035229{col 29}{space 2}   .01977{col 40}{space 1}    5.24{col 49}{space 3}0.000{col 57}{space 4} .0647591{col 70}{space 3} .1422867
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0554511{col 29}{space 2} .0261733{col 40}{space 1}    2.12{col 49}{space 3}0.034{col 57}{space 4} .0041321{col 70}{space 3}   .10677
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0342952{col 29}{space 2} .0342595{col 40}{space 1}    1.00{col 49}{space 3}0.317{col 57}{space 4}-.0328787{col 70}{space 3} .1014691
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4146423{col 29}{space 2} .0343089{col 40}{space 1}   12.09{col 49}{space 3}0.000{col 57}{space 4} .3473716{col 70}{space 3}  .481913
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est6{txt} stored)

{com}. 
. ** Interacted terms ** 
. 
. eststo: areg turnout interest_county interest_pres_county president_year party_diff inter_percent_urban i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  20{txt},{res}   3069{txt}){col 67}= {res}    450.02
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9312
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9156
{txt}{col 49}Root MSE{col 67}= {res}    0.0609

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0058399{col 29}{space 2} .0013155{col 40}{space 1}   -4.44{col 49}{space 3}0.000{col 57}{space 4}-.0084192{col 70}{space 3}-.0032605
{txt}interest_pres~y {c |}{col 17}{res}{space 2}-.0008837{col 29}{space 2} .0011335{col 40}{space 1}   -0.78{col 49}{space 3}0.436{col 57}{space 4}-.0031062{col 70}{space 3} .0013387
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1684446{col 29}{space 2} .0325206{col 40}{space 1}   -5.18{col 49}{space 3}0.000{col 57}{space 4}-.2322089{col 70}{space 3}-.1046803
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3785014{col 29}{space 2} .0316482{col 40}{space 1}  -11.96{col 49}{space 3}0.000{col 57}{space 4}-.4405552{col 70}{space 3}-.3164477
{txt}inter_percent~n {c |}{col 17}{res}{space 2} .0082597{col 29}{space 2} .0025546{col 40}{space 1}    3.23{col 49}{space 3}0.001{col 57}{space 4} .0032508{col 70}{space 3} .0132686
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}   .02942{col 29}{space 2} .0191094{col 40}{space 1}    1.54{col 49}{space 3}0.124{col 57}{space 4}-.0080485{col 70}{space 3} .0668884
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.1153243{col 29}{space 2} .0176628{col 40}{space 1}   -6.53{col 49}{space 3}0.000{col 57}{space 4}-.1499564{col 70}{space 3}-.0806921
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0532608{col 29}{space 2} .0128942{col 40}{space 1}    4.13{col 49}{space 3}0.000{col 57}{space 4} .0279787{col 70}{space 3}  .078543
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1815334{col 29}{space 2} .0166903{col 40}{space 1}  -10.88{col 49}{space 3}0.000{col 57}{space 4}-.2142586{col 70}{space 3}-.1488082
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0078029{col 29}{space 2} .0150173{col 40}{space 1}    0.52{col 49}{space 3}0.603{col 57}{space 4} -.021642{col 70}{space 3} .0372478
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0206227{col 29}{space 2} .0131343{col 40}{space 1}    1.57{col 49}{space 3}0.116{col 57}{space 4}-.0051302{col 70}{space 3} .0463757
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0272106{col 29}{space 2} .0110471{col 40}{space 1}    2.46{col 49}{space 3}0.014{col 57}{space 4} .0055501{col 70}{space 3} .0488712
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0291237{col 29}{space 2} .0122381{col 40}{space 1}    2.38{col 49}{space 3}0.017{col 57}{space 4}  .005128{col 70}{space 3} .0531195
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0023865{col 29}{space 2} .0037837{col 40}{space 1}    0.63{col 49}{space 3}0.528{col 57}{space 4}-.0050323{col 70}{space 3} .0098053
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0203324{col 29}{space 2} .0034782{col 40}{space 1}    5.85{col 49}{space 3}0.000{col 57}{space 4} .0135125{col 70}{space 3} .0271522
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} -.007065{col 29}{space 2} .0027683{col 40}{space 1}   -2.55{col 49}{space 3}0.011{col 57}{space 4}-.0124929{col 70}{space 3}-.0016371
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0355342{col 29}{space 2} .0029883{col 40}{space 1}   11.89{col 49}{space 3}0.000{col 57}{space 4}  .029675{col 70}{space 3} .0413934
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0961582{col 29}{space 2} .0202192{col 40}{space 1}    4.76{col 49}{space 3}0.000{col 57}{space 4} .0565138{col 70}{space 3} .1358027
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0627937{col 29}{space 2} .0264933{col 40}{space 1}    2.37{col 49}{space 3}0.018{col 57}{space 4} .0108473{col 70}{space 3} .1147401
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0487469{col 29}{space 2} .0352848{col 40}{space 1}    1.38{col 49}{space 3}0.167{col 57}{space 4}-.0204373{col 70}{space 3}  .117931
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3990893{col 29}{space 2} .0354471{col 40}{space 1}   11.26{col 49}{space 3}0.000{col 57}{space 4} .3295868{col 70}{space 3} .4685917
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est7{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year party_diff inter_percent_nonwhite i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  20{txt},{res}   3069{txt}){col 67}= {res}    450.03
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9311
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9155
{txt}{col 49}Root MSE{col 67}= {res}    0.0609

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0021487{col 29}{space 2} .0009619{col 40}{space 1}   -2.23{col 49}{space 3}0.026{col 57}{space 4}-.0040347{col 70}{space 3}-.0002627
{txt}interest_pres~y {c |}{col 17}{res}{space 2}-.0008716{col 29}{space 2} .0011373{col 40}{space 1}   -0.77{col 49}{space 3}0.444{col 57}{space 4}-.0031015{col 70}{space 3} .0013583
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1796581{col 29}{space 2} .0315641{col 40}{space 1}   -5.69{col 49}{space 3}0.000{col 57}{space 4}-.2415469{col 70}{space 3}-.1177693
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3792113{col 29}{space 2} .0315687{col 40}{space 1}  -12.01{col 49}{space 3}0.000{col 57}{space 4}-.4411093{col 70}{space 3}-.3173133
{txt}inter_percent~e {c |}{col 17}{res}{space 2}-.0017085{col 29}{space 2} .0049814{col 40}{space 1}   -0.34{col 49}{space 3}0.732{col 57}{space 4}-.0114757{col 70}{space 3} .0080586
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0266918{col 29}{space 2} .0198264{col 40}{space 1}    1.35{col 49}{space 3}0.178{col 57}{space 4}-.0121825{col 70}{space 3} .0655662
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.1180019{col 29}{space 2}  .018193{col 40}{space 1}   -6.49{col 49}{space 3}0.000{col 57}{space 4}-.1536736{col 70}{space 3}-.0823303
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0511532{col 29}{space 2} .0132776{col 40}{space 1}    3.85{col 49}{space 3}0.000{col 57}{space 4} .0251193{col 70}{space 3}  .077187
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} -.183263{col 29}{space 2} .0168437{col 40}{space 1}  -10.88{col 49}{space 3}0.000{col 57}{space 4}-.2162892{col 70}{space 3}-.1502369
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}-.0048473{col 29}{space 2} .0142322{col 40}{space 1}   -0.34{col 49}{space 3}0.733{col 57}{space 4} -.032753{col 70}{space 3} .0230583
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0102943{col 29}{space 2} .0128099{col 40}{space 1}    0.80{col 49}{space 3}0.422{col 57}{space 4}-.0148225{col 70}{space 3} .0354112
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0197603{col 29}{space 2} .0107394{col 40}{space 1}    1.84{col 49}{space 3}0.066{col 57}{space 4}-.0012969{col 70}{space 3} .0408174
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0249252{col 29}{space 2} .0121772{col 40}{space 1}    2.05{col 49}{space 3}0.041{col 57}{space 4} .0010488{col 70}{space 3} .0488015
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0011163{col 29}{space 2} .0037063{col 40}{space 1}    0.30{col 49}{space 3}0.763{col 57}{space 4}-.0061507{col 70}{space 3} .0083833
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0194238{col 29}{space 2} .0034563{col 40}{space 1}    5.62{col 49}{space 3}0.000{col 57}{space 4} .0126468{col 70}{space 3} .0262008
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0076497{col 29}{space 2}  .002742{col 40}{space 1}   -2.79{col 49}{space 3}0.005{col 57}{space 4}-.0130261{col 70}{space 3}-.0022733
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}  .035278{col 29}{space 2} .0029931{col 40}{space 1}   11.79{col 49}{space 3}0.000{col 57}{space 4} .0294093{col 70}{space 3} .0411467
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .1035379{col 29}{space 2} .0197688{col 40}{space 1}    5.24{col 49}{space 3}0.000{col 57}{space 4} .0647764{col 70}{space 3} .1422994
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0553532{col 29}{space 2} .0261701{col 40}{space 1}    2.12{col 49}{space 3}0.034{col 57}{space 4} .0040405{col 70}{space 3} .1066658
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0342243{col 29}{space 2} .0342656{col 40}{space 1}    1.00{col 49}{space 3}0.318{col 57}{space 4}-.0329615{col 70}{space 3} .1014101
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4147296{col 29}{space 2} .0343151{col 40}{space 1}   12.09{col 49}{space 3}0.000{col 57}{space 4} .3474467{col 70}{space 3} .4820125
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est8{txt} stored)

{com}. eststo: areg turnout interest_county interest_pres_county president_year party_diff inter_log_pop i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop  i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  20{txt},{res}   3069{txt}){col 67}= {res}    444.87
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9313
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9157
{txt}{col 49}Root MSE{col 67}= {res}    0.0609

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_county {c |}{col 17}{res}{space 2}-.0308566{col 29}{space 2} .0065082{col 40}{space 1}   -4.74{col 49}{space 3}0.000{col 57}{space 4}-.0436175{col 70}{space 3}-.0180957
{txt}interest_pres~y {c |}{col 17}{res}{space 2}-.0008979{col 29}{space 2} .0011336{col 40}{space 1}   -0.79{col 49}{space 3}0.428{col 57}{space 4}-.0031205{col 70}{space 3} .0013248
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1438227{col 29}{space 2} .0348609{col 40}{space 1}   -4.13{col 49}{space 3}0.000{col 57}{space 4}-.2121758{col 70}{space 3}-.0754696
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3776591{col 29}{space 2} .0317896{col 40}{space 1}  -11.88{col 49}{space 3}0.000{col 57}{space 4}  -.43999{col 70}{space 3}-.3153281
{txt}{space 2}inter_log_pop {c |}{col 17}{res}{space 2} .0026928{col 29}{space 2} .0006203{col 40}{space 1}    4.34{col 49}{space 3}0.000{col 57}{space 4} .0014765{col 70}{space 3} .0039091
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0284225{col 29}{space 2}  .019157{col 40}{space 1}    1.48{col 49}{space 3}0.138{col 57}{space 4}-.0091394{col 70}{space 3} .0659844
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} -.116052{col 29}{space 2} .0177422{col 40}{space 1}   -6.54{col 49}{space 3}0.000{col 57}{space 4}-.1508399{col 70}{space 3}-.0812642
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0528452{col 29}{space 2} .0129471{col 40}{space 1}    4.08{col 49}{space 3}0.000{col 57}{space 4} .0274594{col 70}{space 3} .0782311
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1813074{col 29}{space 2} .0167558{col 40}{space 1}  -10.82{col 49}{space 3}0.000{col 57}{space 4}-.2141611{col 70}{space 3}-.1484536
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}-.0002802{col 29}{space 2} .0142311{col 40}{space 1}   -0.02{col 49}{space 3}0.984{col 57}{space 4}-.0281836{col 70}{space 3} .0276232
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0139873{col 29}{space 2} .0127311{col 40}{space 1}    1.10{col 49}{space 3}0.272{col 57}{space 4}-.0109749{col 70}{space 3} .0389496
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0221322{col 29}{space 2} .0107331{col 40}{space 1}    2.06{col 49}{space 3}0.039{col 57}{space 4} .0010874{col 70}{space 3}  .043177
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0262201{col 29}{space 2} .0121636{col 40}{space 1}    2.16{col 49}{space 3}0.031{col 57}{space 4} .0023706{col 70}{space 3} .0500697
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}  .006278{col 29}{space 2} .0041788{col 40}{space 1}    1.50{col 49}{space 3}0.133{col 57}{space 4}-.0019155{col 70}{space 3} .0144716
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0234209{col 29}{space 2} .0037172{col 40}{space 1}    6.30{col 49}{space 3}0.000{col 57}{space 4} .0161324{col 70}{space 3} .0307093
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0048251{col 29}{space 2} .0029144{col 40}{space 1}   -1.66{col 49}{space 3}0.098{col 57}{space 4}-.0105395{col 70}{space 3} .0008893
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0367604{col 29}{space 2} .0030222{col 40}{space 1}   12.16{col 49}{space 3}0.000{col 57}{space 4} .0308347{col 70}{space 3} .0426862
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0789623{col 29}{space 2} .0217329{col 40}{space 1}    3.63{col 49}{space 3}0.000{col 57}{space 4} .0363497{col 70}{space 3} .1215748
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0780544{col 29}{space 2} .0277357{col 40}{space 1}    2.81{col 49}{space 3}0.005{col 57}{space 4}  .023672{col 70}{space 3} .1324367
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2}  .084612{col 29}{space 2} .0390902{col 40}{space 1}    2.16{col 49}{space 3}0.031{col 57}{space 4} .0079664{col 70}{space 3} .1612577
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2}  .362694{col 29}{space 2} .0393437{col 40}{space 1}    9.22{col 49}{space 3}0.000{col 57}{space 4} .2855514{col 70}{space 3} .4398366
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est9{txt} stored)

{com}. 
.  esttab est4 est5 est7 est8 est9  using "/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/county_2.csv", label star se stats(ar2 N) replace drop(*.year *c.*) 
{res}{txt}(output written to {browse  `"/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/county_2.csv"'})

{com}. 
. 
. 
. 
. ** DMA indicators
.  
.  eststo: areg turnout interest i.year, absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,455
{txt}{col 49}F({res}   5{txt},{res}   2863{txt}){col 67}= {res}   1474.24
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9271
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9145
{txt}{col 49}Root MSE{col 67}= {res}    0.0675

{txt}{ralign 78:(Std. Err. adjusted for {res:2,864} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}interest {c |}{col 14}{res}{space 2} .0013568{col 26}{space 2} .0007966{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0002051{col 67}{space 3} .0029187
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1924  {c |}{col 14}{res}{space 2} .0927993{col 26}{space 2} .0024187{col 37}{space 1}   38.37{col 46}{space 3}0.000{col 54}{space 4} .0880568{col 67}{space 3} .0975418
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0336508{col 26}{space 2} .0031539{col 37}{space 1}  -10.67{col 46}{space 3}0.000{col 54}{space 4} -.039835{col 67}{space 3}-.0274667
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1327332{col 26}{space 2} .0046392{col 37}{space 1}   28.61{col 46}{space 3}0.000{col 54}{space 4} .1236367{col 67}{space 3} .1418298
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0020137{col 26}{space 2} .0059715{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4}-.0096952{col 67}{space 3} .0137227
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3799401{col 26}{space 2}  .001648{col 37}{space 1}  230.54{col 46}{space 3}0.000{col 54}{space 4} .3767087{col 67}{space 3} .3831716
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (2864 categories)
({res}est10{txt} stored)

{com}.   eststo: areg turnout interest interest_pres president_year i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,455
{txt}{col 49}F({res}   6{txt},{res}   2863{txt}){col 67}= {res}   1245.92
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9273
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9147
{txt}{col 49}Root MSE{col 67}= {res}    0.0674

{txt}{ralign 80:(Std. Err. adjusted for {res:2,864} clusters in county_id)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}       turnout{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}interest {c |}{col 16}{res}{space 2}-.0007854{col 28}{space 2} .0008736{col 39}{space 1}   -0.90{col 48}{space 3}0.369{col 56}{space 4}-.0024984{col 69}{space 3} .0009277
{txt}{space 1}interest_pres {c |}{col 16}{res}{space 2} .0046077{col 28}{space 2} .0009579{col 39}{space 1}    4.81{col 48}{space 3}0.000{col 56}{space 4} .0027295{col 69}{space 3} .0064859
{txt}president_year {c |}{col 16}{res}{space 2} .1200526{col 28}{space 2} .0053642{col 39}{space 1}   22.38{col 48}{space 3}0.000{col 56}{space 4} .1095346{col 69}{space 3} .1305706
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}1924  {c |}{col 16}{res}{space 2}-.0309649{col 28}{space 2} .0036351{col 39}{space 1}   -8.52{col 48}{space 3}0.000{col 56}{space 4}-.0380925{col 69}{space 3}-.0238373
{txt}{space 9}1926  {c |}{col 16}{res}{space 2}-.0265871{col 28}{space 2} .0033314{col 39}{space 1}   -7.98{col 48}{space 3}0.000{col 56}{space 4}-.0331194{col 69}{space 3}-.0200549
{txt}{space 9}1928  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 9}1930  {c |}{col 16}{res}{space 2} .0172059{col 28}{space 2} .0064475{col 39}{space 1}    2.67{col 48}{space 3}0.008{col 56}{space 4} .0045636{col 69}{space 3} .0298481
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .3799317{col 28}{space 2}  .001648{col 39}{space 1}  230.54{col 48}{space 3}0.000{col 56}{space 4} .3767003{col 69}{space 3}  .383163
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     county_id {c |}   absorbed                                    (2864 categories)
({res}est11{txt} stored)

{com}.   eststo: areg turnout interest interest_pres president_year party_diff interest_sq i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    15,811
{txt}{col 49}F({res}   8{txt},{res}   2850{txt}){col 67}= {res}    756.89
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9182
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9001
{txt}{col 49}Root MSE{col 67}= {res}    0.0648

{txt}{ralign 80:(Std. Err. adjusted for {res:2,851} clusters in county_id)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}       turnout{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}interest {c |}{col 16}{res}{space 2}-.0052587{col 28}{space 2} .0020589{col 39}{space 1}   -2.55{col 48}{space 3}0.011{col 56}{space 4}-.0092957{col 69}{space 3}-.0012217
{txt}{space 1}interest_pres {c |}{col 16}{res}{space 2} .0072041{col 28}{space 2} .0014686{col 39}{space 1}    4.91{col 48}{space 3}0.000{col 56}{space 4} .0043245{col 69}{space 3} .0100836
{txt}president_year {c |}{col 16}{res}{space 2}  .129354{col 28}{space 2} .0075799{col 39}{space 1}   17.07{col 48}{space 3}0.000{col 56}{space 4} .1144914{col 69}{space 3} .1442166
{txt}{space 4}party_diff {c |}{col 16}{res}{space 2}-.1815855{col 28}{space 2} .0262439{col 39}{space 1}   -6.92{col 48}{space 3}0.000{col 56}{space 4}-.2330444{col 69}{space 3}-.1301265
{txt}{space 3}interest_sq {c |}{col 16}{res}{space 2} .0001268{col 28}{space 2} .0002022{col 39}{space 1}    0.63{col 48}{space 3}0.531{col 56}{space 4}-.0002697{col 69}{space 3} .0005232
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}1924  {c |}{col 16}{res}{space 2}-.0357295{col 28}{space 2} .0047656{col 39}{space 1}   -7.50{col 48}{space 3}0.000{col 56}{space 4}-.0450739{col 69}{space 3}-.0263851
{txt}{space 9}1926  {c |}{col 16}{res}{space 2}-.0118157{col 28}{space 2} .0058088{col 39}{space 1}   -2.03{col 48}{space 3}0.042{col 56}{space 4}-.0232054{col 69}{space 3}-.0004259
{txt}{space 9}1928  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 9}1930  {c |}{col 16}{res}{space 2}  .047631{col 28}{space 2} .0107235{col 39}{space 1}    4.44{col 48}{space 3}0.000{col 56}{space 4} .0266043{col 69}{space 3} .0686577
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}  .429522{col 28}{space 2} .0021894{col 39}{space 1}  196.18{col 48}{space 3}0.000{col 56}{space 4}  .425229{col 69}{space 3} .4338151
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     county_id {c |}   absorbed                                    (2851 categories)
({res}est12{txt} stored)

{com}. esttab est10 est11 est12 using "/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/dma_reg.csv", label star se stats(ar2 N) replace  drop(*.year)
{res}{txt}(output written to {browse  `"/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/dma_reg.csv"'})

{com}.   
.  eststo: areg turnout interest i.year#c.percent_urban i.year#c.log_pop i.year , absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  13{txt},{res}   2857{txt}){col 67}= {res}    670.44
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9303
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9182
{txt}{col 49}Root MSE{col 67}= {res}    0.0660

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2} .0007511{col 29}{space 2} .0007955{col 40}{space 1}    0.94{col 49}{space 3}0.345{col 57}{space 4}-.0008087{col 70}{space 3} .0023108
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0056072{col 29}{space 2} .0122543{col 40}{space 1}    0.46{col 49}{space 3}0.647{col 57}{space 4} -.018421{col 70}{space 3} .0296354
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0387211{col 29}{space 2} .0119669{col 40}{space 1}    3.24{col 49}{space 3}0.001{col 57}{space 4} .0152564{col 70}{space 3} .0621858
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0212996{col 29}{space 2} .0090254{col 40}{space 1}    2.36{col 49}{space 3}0.018{col 57}{space 4} .0036026{col 70}{space 3} .0389966
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0558197{col 29}{space 2}  .011117{col 40}{space 1}    5.02{col 49}{space 3}0.000{col 57}{space 4} .0340215{col 70}{space 3} .0776178
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0017325{col 29}{space 2}  .003353{col 40}{space 1}    0.52{col 49}{space 3}0.605{col 57}{space 4}-.0048421{col 70}{space 3} .0083071
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}  .010309{col 29}{space 2} .0031648{col 40}{space 1}    3.26{col 49}{space 3}0.001{col 57}{space 4} .0041035{col 70}{space 3} .0165144
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0043473{col 29}{space 2}  .002409{col 40}{space 1}   -1.80{col 49}{space 3}0.071{col 57}{space 4}-.0090709{col 70}{space 3} .0003763
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0202513{col 29}{space 2} .0027292{col 40}{space 1}    7.42{col 49}{space 3}0.000{col 57}{space 4} .0148998{col 70}{space 3} .0256028
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0025087{col 29}{space 2} .0278706{col 40}{space 1}    0.09{col 49}{space 3}0.928{col 57}{space 4}-.0521397{col 70}{space 3} .0571571
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0249123{col 29}{space 2} .0263172{col 40}{space 1}    0.95{col 49}{space 3}0.344{col 57}{space 4}-.0266904{col 70}{space 3} .0765149
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.0566468{col 29}{space 2} .0307701{col 40}{space 1}   -1.84{col 49}{space 3}0.066{col 57}{space 4}-.1169807{col 70}{space 3} .0036871
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}  .024643{col 29}{space 2} .0321077{col 40}{space 1}    0.77{col 49}{space 3}0.443{col 57}{space 4}-.0383136{col 70}{space 3} .0875996
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3616886{col 29}{space 2} .0312982{col 40}{space 1}   11.56{col 49}{space 3}0.000{col 57}{space 4} .3003192{col 70}{space 3}  .423058
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est13{txt} stored)

{com}.   eststo: areg turnout interest interest_pres president_year i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  14{txt},{res}   2857{txt}){col 67}= {res}    625.56
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9304
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9183
{txt}{col 49}Root MSE{col 67}= {res}    0.0660

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2}-.0003207{col 29}{space 2} .0008826{col 40}{space 1}   -0.36{col 49}{space 3}0.716{col 57}{space 4}-.0020514{col 70}{space 3} .0014099
{txt}{space 2}interest_pres {c |}{col 17}{res}{space 2} .0023037{col 29}{space 2} .0009824{col 40}{space 1}    2.34{col 49}{space 3}0.019{col 57}{space 4} .0003774{col 70}{space 3} .0042299
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0621042{col 29}{space 2} .0309073{col 40}{space 1}   -2.01{col 49}{space 3}0.045{col 57}{space 4}-.1227071{col 70}{space 3}-.0015013
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0047981{col 29}{space 2} .0122613{col 40}{space 1}    0.39{col 49}{space 3}0.696{col 57}{space 4}-.0192438{col 70}{space 3} .0288401
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0375704{col 29}{space 2} .0119884{col 40}{space 1}    3.13{col 49}{space 3}0.002{col 57}{space 4} .0140636{col 70}{space 3} .0610771
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0210386{col 29}{space 2} .0090308{col 40}{space 1}    2.33{col 49}{space 3}0.020{col 57}{space 4} .0033311{col 70}{space 3} .0387461
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0542193{col 29}{space 2} .0111526{col 40}{space 1}    4.86{col 49}{space 3}0.000{col 57}{space 4} .0323514{col 70}{space 3} .0760872
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0016823{col 29}{space 2} .0033563{col 40}{space 1}    0.50{col 49}{space 3}0.616{col 57}{space 4}-.0048988{col 70}{space 3} .0082633
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0102153{col 29}{space 2} .0031669{col 40}{space 1}    3.23{col 49}{space 3}0.001{col 57}{space 4} .0040057{col 70}{space 3}  .016425
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0043477{col 29}{space 2} .0024094{col 40}{space 1}   -1.80{col 49}{space 3}0.071{col 57}{space 4}-.0090721{col 70}{space 3} .0003767
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0201288{col 29}{space 2} .0027305{col 40}{space 1}    7.37{col 49}{space 3}0.000{col 57}{space 4} .0147748{col 70}{space 3} .0254828
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0632577{col 29}{space 2} .0193535{col 40}{space 1}    3.27{col 49}{space 3}0.001{col 57}{space 4} .0253094{col 70}{space 3}  .101206
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0278382{col 29}{space 2}  .026308{col 40}{space 1}    1.06{col 49}{space 3}0.290{col 57}{space 4}-.0237463{col 70}{space 3} .0794227
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0315762{col 29}{space 2} .0321125{col 40}{space 1}    0.98{col 49}{space 3}0.326{col 57}{space 4}-.0313897{col 70}{space 3} .0945422
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3623488{col 29}{space 2} .0313326{col 40}{space 1}   11.56{col 49}{space 3}0.000{col 57}{space 4}  .300912{col 70}{space 3} .4237855
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est14{txt} stored)

{com}.   eststo: areg turnout interest interest_pres president_year interest_sq i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  15{txt},{res}   2857{txt}){col 67}= {res}    585.99
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9304
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9183
{txt}{col 49}Root MSE{col 67}= {res}    0.0660

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2}-.0019533{col 29}{space 2}  .001498{col 40}{space 1}   -1.30{col 49}{space 3}0.192{col 57}{space 4}-.0048904{col 70}{space 3} .0009839
{txt}{space 2}interest_pres {c |}{col 17}{res}{space 2}  .002653{col 29}{space 2} .0009701{col 40}{space 1}    2.73{col 49}{space 3}0.006{col 57}{space 4} .0007508{col 70}{space 3} .0045551
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0606458{col 29}{space 2} .0308901{col 40}{space 1}   -1.96{col 49}{space 3}0.050{col 57}{space 4}-.1212149{col 70}{space 3}-.0000767
{txt}{space 4}interest_sq {c |}{col 17}{res}{space 2} .0001802{col 29}{space 2} .0001595{col 40}{space 1}    1.13{col 49}{space 3}0.259{col 57}{space 4}-.0001326{col 70}{space 3}  .000493
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0049101{col 29}{space 2} .0122593{col 40}{space 1}    0.40{col 49}{space 3}0.689{col 57}{space 4}-.0191278{col 70}{space 3} .0289479
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0378947{col 29}{space 2} .0119832{col 40}{space 1}    3.16{col 49}{space 3}0.002{col 57}{space 4} .0143982{col 70}{space 3} .0613912
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0215535{col 29}{space 2} .0090418{col 40}{space 1}    2.38{col 49}{space 3}0.017{col 57}{space 4} .0038243{col 70}{space 3} .0392826
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0543618{col 29}{space 2} .0111579{col 40}{space 1}    4.87{col 49}{space 3}0.000{col 57}{space 4} .0324835{col 70}{space 3} .0762401
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0017203{col 29}{space 2} .0033538{col 40}{space 1}    0.51{col 49}{space 3}0.608{col 57}{space 4}-.0048559{col 70}{space 3} .0082965
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0102988{col 29}{space 2} .0031639{col 40}{space 1}    3.26{col 49}{space 3}0.001{col 57}{space 4}  .004095{col 70}{space 3} .0165026
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} -.004262{col 29}{space 2} .0024107{col 40}{space 1}   -1.77{col 49}{space 3}0.077{col 57}{space 4}-.0089889{col 70}{space 3} .0004648
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0201535{col 29}{space 2} .0027297{col 40}{space 1}    7.38{col 49}{space 3}0.000{col 57}{space 4} .0148011{col 70}{space 3} .0255059
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0627308{col 29}{space 2} .0193546{col 40}{space 1}    3.24{col 49}{space 3}0.001{col 57}{space 4} .0247804{col 70}{space 3} .1006813
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0304158{col 29}{space 2}   .02628{col 40}{space 1}    1.16{col 49}{space 3}0.247{col 57}{space 4}-.0211138{col 70}{space 3} .0819455
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0338687{col 29}{space 2} .0320088{col 40}{space 1}    1.06{col 49}{space 3}0.290{col 57}{space 4} -.028894{col 70}{space 3} .0966314
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3619533{col 29}{space 2}  .031309{col 40}{space 1}   11.56{col 49}{space 3}0.000{col 57}{space 4} .3005627{col 70}{space 3} .4233438
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est15{txt} stored)

{com}.     eststo: areg turnout interest interest_pres president_year interest_sq dma_inter_percent_urban i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  16{txt},{res}   2857{txt}){col 67}= {res}    551.16
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9304
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9183
{txt}{col 49}Root MSE{col 67}= {res}    0.0660

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2}-.0025844{col 29}{space 2} .0016516{col 40}{space 1}   -1.56{col 49}{space 3}0.118{col 57}{space 4}-.0058228{col 70}{space 3}  .000654
{txt}{space 2}interest_pres {c |}{col 17}{res}{space 2} .0026428{col 29}{space 2} .0009697{col 40}{space 1}    2.73{col 49}{space 3}0.006{col 57}{space 4} .0007413{col 70}{space 3} .0045443
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0553413{col 29}{space 2} .0316621{col 40}{space 1}   -1.75{col 49}{space 3}0.081{col 57}{space 4}-.1174242{col 70}{space 3} .0067415
{txt}{space 4}interest_sq {c |}{col 17}{res}{space 2} .0001775{col 29}{space 2} .0001595{col 40}{space 1}    1.11{col 49}{space 3}0.266{col 57}{space 4}-.0001354{col 70}{space 3} .0004903
{txt}dma_inter_per~n {c |}{col 17}{res}{space 2} .0045077{col 29}{space 2} .0038002{col 40}{space 1}    1.19{col 49}{space 3}0.236{col 57}{space 4}-.0029438{col 70}{space 3} .0119591
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0375956{col 29}{space 2} .0292726{col 40}{space 1}    1.28{col 49}{space 3}0.199{col 57}{space 4}-.0198019{col 70}{space 3} .0949931
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0635556{col 29}{space 2} .0241346{col 40}{space 1}    2.63{col 49}{space 3}0.008{col 57}{space 4} .0162325{col 70}{space 3} .1108786
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0389228{col 29}{space 2} .0172081{col 40}{space 1}    2.26{col 49}{space 3}0.024{col 57}{space 4} .0051812{col 70}{space 3} .0726645
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0631925{col 29}{space 2} .0134311{col 40}{space 1}    4.70{col 49}{space 3}0.000{col 57}{space 4} .0368569{col 70}{space 3} .0895282
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0019405{col 29}{space 2} .0033752{col 40}{space 1}    0.57{col 49}{space 3}0.565{col 57}{space 4}-.0046775{col 70}{space 3} .0085586
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0103986{col 29}{space 2} .0031695{col 40}{space 1}    3.28{col 49}{space 3}0.001{col 57}{space 4} .0041838{col 70}{space 3} .0166133
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0042125{col 29}{space 2} .0024114{col 40}{space 1}   -1.75{col 49}{space 3}0.081{col 57}{space 4}-.0089407{col 70}{space 3} .0005157
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0201692{col 29}{space 2} .0027301{col 40}{space 1}    7.39{col 49}{space 3}0.000{col 57}{space 4}  .014816{col 70}{space 3} .0255224
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0595312{col 29}{space 2} .0197235{col 40}{space 1}    3.02{col 49}{space 3}0.003{col 57}{space 4} .0208576{col 70}{space 3} .0982048
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0341289{col 29}{space 2} .0268661{col 40}{space 1}    1.27{col 49}{space 3}0.204{col 57}{space 4}  -.01855{col 70}{space 3} .0868079
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0405634{col 29}{space 2} .0332162{col 40}{space 1}    1.22{col 49}{space 3}0.222{col 57}{space 4}-.0245668{col 70}{space 3} .1056936
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3528913{col 29}{space 2} .0328899{col 40}{space 1}   10.73{col 49}{space 3}0.000{col 57}{space 4}  .288401{col 70}{space 3} .4173816
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est16{txt} stored)

{com}.             eststo: areg turnout interest interest_pres president_year interest_sq dma_inter_percent_nonwhite i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  16{txt},{res}   2857{txt}){col 67}= {res}    557.31
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9306
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9185
{txt}{col 49}Root MSE{col 67}= {res}    0.0659

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2}-.0008164{col 29}{space 2} .0015031{col 40}{space 1}   -0.54{col 49}{space 3}0.587{col 57}{space 4}-.0037637{col 70}{space 3} .0021309
{txt}{space 2}interest_pres {c |}{col 17}{res}{space 2} .0027136{col 29}{space 2} .0009689{col 40}{space 1}    2.80{col 49}{space 3}0.005{col 57}{space 4} .0008138{col 70}{space 3} .0046134
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0722734{col 29}{space 2} .0305058{col 40}{space 1}   -2.37{col 49}{space 3}0.018{col 57}{space 4}-.1320891{col 70}{space 3}-.0124578
{txt}{space 4}interest_sq {c |}{col 17}{res}{space 2} .0001334{col 29}{space 2} .0001586{col 40}{space 1}    0.84{col 49}{space 3}0.400{col 57}{space 4}-.0001776{col 70}{space 3} .0004444
{txt}dma_inter_per~e {c |}{col 17}{res}{space 2}-.0086173{col 29}{space 2} .0012534{col 40}{space 1}   -6.87{col 49}{space 3}0.000{col 57}{space 4}-.0110751{col 70}{space 3}-.0061596
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}  .013914{col 29}{space 2} .0124929{col 40}{space 1}    1.11{col 49}{space 3}0.265{col 57}{space 4}-.0105821{col 70}{space 3} .0384101
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0455507{col 29}{space 2} .0123319{col 40}{space 1}    3.69{col 49}{space 3}0.000{col 57}{space 4} .0213704{col 70}{space 3}  .069731
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0268341{col 29}{space 2} .0091024{col 40}{space 1}    2.95{col 49}{space 3}0.003{col 57}{space 4} .0089862{col 70}{space 3} .0446819
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0571119{col 29}{space 2} .0112946{col 40}{space 1}    5.06{col 49}{space 3}0.000{col 57}{space 4} .0349655{col 70}{space 3} .0792582
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} -.000154{col 29}{space 2} .0033767{col 40}{space 1}   -0.05{col 49}{space 3}0.964{col 57}{space 4} -.006775{col 70}{space 3}  .006467
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0088098{col 29}{space 2} .0032151{col 40}{space 1}    2.74{col 49}{space 3}0.006{col 57}{space 4} .0025057{col 70}{space 3}  .015114
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0053196{col 29}{space 2} .0024078{col 40}{space 1}   -2.21{col 49}{space 3}0.027{col 57}{space 4}-.0100407{col 70}{space 3}-.0005984
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0195829{col 29}{space 2} .0027565{col 40}{space 1}    7.10{col 49}{space 3}0.000{col 57}{space 4} .0141779{col 70}{space 3} .0249879
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0703635{col 29}{space 2} .0192182{col 40}{space 1}    3.66{col 49}{space 3}0.000{col 57}{space 4} .0326807{col 70}{space 3} .1080464
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0228853{col 29}{space 2} .0264147{col 40}{space 1}    0.87{col 49}{space 3}0.386{col 57}{space 4}-.0289085{col 70}{space 3} .0746792
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0184478{col 29}{space 2}  .032143{col 40}{space 1}    0.57{col 49}{space 3}0.566{col 57}{space 4}-.0445781{col 70}{space 3} .0814737
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3786812{col 29}{space 2} .0314763{col 40}{space 1}   12.03{col 49}{space 3}0.000{col 57}{space 4} .3169627{col 70}{space 3} .4403997
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est17{txt} stored)

{com}.                     eststo: areg turnout interest interest_pres president_year interest_sq dma_inter_log_pop i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{p 0 6 2}{txt}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    19,414
{txt}{col 49}F({res}  16{txt},{res}   2857{txt}){col 67}= {res}    549.37
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9304
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9183
{txt}{col 49}Root MSE{col 67}= {res}    0.0660

{txt}{ralign 81:(Std. Err. adjusted for {res:2,858} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}interest {c |}{col 17}{res}{space 2}-.0050519{col 29}{space 2} .0105277{col 40}{space 1}   -0.48{col 49}{space 3}0.631{col 57}{space 4}-.0256946{col 70}{space 3} .0155908
{txt}{space 2}interest_pres {c |}{col 17}{res}{space 2} .0026535{col 29}{space 2} .0009705{col 40}{space 1}    2.73{col 49}{space 3}0.006{col 57}{space 4} .0007506{col 70}{space 3} .0045563
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.0445469{col 29}{space 2} .0634224{col 40}{space 1}   -0.70{col 49}{space 3}0.482{col 57}{space 4}-.1689053{col 70}{space 3} .0798114
{txt}{space 4}interest_sq {c |}{col 17}{res}{space 2}   .00018{col 29}{space 2} .0001596{col 40}{space 1}    1.13{col 49}{space 3}0.259{col 57}{space 4}-.0001329{col 70}{space 3} .0004929
{txt}dma_inter_log~p {c |}{col 17}{res}{space 2} .0003224{col 29}{space 2} .0010655{col 40}{space 1}    0.30{col 49}{space 3}0.762{col 57}{space 4}-.0017669{col 70}{space 3} .0024116
{txt}{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0052831{col 29}{space 2} .0122746{col 40}{space 1}    0.43{col 49}{space 3}0.667{col 57}{space 4} -.018785{col 70}{space 3} .0293511
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0381967{col 29}{space 2} .0119877{col 40}{space 1}    3.19{col 49}{space 3}0.001{col 57}{space 4} .0146913{col 70}{space 3} .0617022
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0217132{col 29}{space 2} .0090502{col 40}{space 1}    2.40{col 49}{space 3}0.016{col 57}{space 4} .0039677{col 70}{space 3} .0394587
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0543962{col 29}{space 2}  .011157{col 40}{space 1}    4.88{col 49}{space 3}0.000{col 57}{space 4} .0325196{col 70}{space 3} .0762727
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0040196{col 29}{space 2} .0085159{col 40}{space 1}    0.47{col 49}{space 3}0.637{col 57}{space 4}-.0126783{col 70}{space 3} .0207175
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0120722{col 29}{space 2} .0067538{col 40}{space 1}    1.79{col 49}{space 3}0.074{col 57}{space 4}-.0011706{col 70}{space 3} .0253151
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0030524{col 29}{space 2} .0046936{col 40}{space 1}   -0.65{col 49}{space 3}0.516{col 57}{space 4}-.0122557{col 70}{space 3} .0061509
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0207801{col 29}{space 2} .0034606{col 40}{space 1}    6.00{col 49}{space 3}0.000{col 57}{space 4} .0139946{col 70}{space 3} .0275655
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0516829{col 29}{space 2}  .042111{col 40}{space 1}    1.23{col 49}{space 3}0.220{col 57}{space 4}-.0308882{col 70}{space 3}  .134254
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0408965{col 29}{space 2} .0455355{col 40}{space 1}    0.90{col 49}{space 3}0.369{col 57}{space 4}-.0483893{col 70}{space 3} .1301824
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0560023{col 29}{space 2} .0833454{col 40}{space 1}    0.67{col 49}{space 3}0.502{col 57}{space 4}-.1074209{col 70}{space 3} .2194254
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3392839{col 29}{space 2} .0832055{col 40}{space 1}    4.08{col 49}{space 3}0.000{col 57}{space 4} .1761351{col 70}{space 3} .5024328
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (2858 categories)
({res}est18{txt} stored)

{com}. 
.  esttab est13 est13 est14 est15 est16 est17 est18  using "/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/dma_reg_inter.csv", label star se stats(ar2 N) replace drop(*.year *c.*) 
{res}{txt}(output written to {browse  `"/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/dma_reg_inter.csv"'})

{com}. 
.  
.  ********* Lag coefficients ************* 
.  cap program drop lag_coeff
{txt}
{com}.  program lag_coeff 
{txt}  1{com}.  
.  syntax, variable(string)  reg_var(varlist) title(string) figure(string) name(string)
{txt}  2{com}.  
.  gen interest_0 = (year-`variable')==0 
{txt}  3{com}.  gen interest_1 = (year-`variable') ==1
{txt}  4{com}.   gen interest_2 = (year-`variable') == 2
{txt}  5{com}.  
.  
. 
. gen interest_minus1 = (year-`variable') == -1
{txt}  6{com}. gen interest_minus2 = (year-`variable') == -2
{txt}  7{com}. 
. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year#c.percent_nonwhite i.year#c.percent_urban i.year#c.log_pop i.year, absorb(county_id) vce(cluster county_id)
{txt}  8{com}. predict prediction, xb
{txt}  9{com}. 
. gen interest_axis = year-`variable'
{txt} 10{com}. 
. 
.  mat define b = e(b)
{txt} 11{com}.  gen coeff = . 
{txt} 12{com}.  
.  loc j = 1
{txt} 13{com}.  forvalues i = -2/2 {c -(}
{txt} 14{com}.  replace coeff = b[1,`j'] if interest_axis == `i'
{txt} 15{com}.         loc j = `j' + 1
{txt} 16{com}.         {c )-}
{txt} 17{com}. sort interest_axis
{txt} 18{com}. scatter coeff interest_axis if abs(interest_axis) <= 2, title("Figure `figure': Graph of Lag Coefficients: `title' Level") ///
> saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/`name'", replace) xtitle("Time Since Broadcasting Introduced (years)") ytitle("Voting Turnout") connect(l)
{txt} 19{com}.  
.  drop interest_0 interest_1 interest_2 interest_minus* coeff prediction interest_axis 
{txt} 20{com}.  
.  end
{txt}
{com}.  
.  lag_coeff, variable(first_county) reg_var(president_year party_diff ) title(County) figure(10) name(lag_county)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  22{txt},{res}   3069{txt}){col 67}= {res}    410.14
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9311
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9155
{txt}{col 49}Root MSE{col 67}= {res}    0.0609

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2} .0021794{col 29}{space 2}  .007664{col 40}{space 1}    0.28{col 49}{space 3}0.776{col 57}{space 4}-.0128477{col 70}{space 3} .0172066
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0074904{col 29}{space 2} .0044555{col 40}{space 1}    1.68{col 49}{space 3}0.093{col 57}{space 4}-.0012457{col 70}{space 3} .0162265
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0114742{col 29}{space 2} .0052469{col 40}{space 1}    2.19{col 49}{space 3}0.029{col 57}{space 4} .0011864{col 70}{space 3}  .021762
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2}  .006212{col 29}{space 2} .0041756{col 40}{space 1}    1.49{col 49}{space 3}0.137{col 57}{space 4}-.0019752{col 70}{space 3} .0143993
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0036182{col 29}{space 2} .0049795{col 40}{space 1}   -0.73{col 49}{space 3}0.468{col 57}{space 4}-.0133817{col 70}{space 3} .0061454
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1719148{col 29}{space 2} .0311773{col 40}{space 1}   -5.51{col 49}{space 3}0.000{col 57}{space 4}-.2330452{col 70}{space 3}-.1107844
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3792119{col 29}{space 2} .0316262{col 40}{space 1}  -11.99{col 49}{space 3}0.000{col 57}{space 4}-.4412225{col 70}{space 3}-.3172014
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0263917{col 29}{space 2} .0190512{col 40}{space 1}    1.39{col 49}{space 3}0.166{col 57}{space 4}-.0109627{col 70}{space 3}  .063746
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.1185579{col 29}{space 2}  .017644{col 40}{space 1}   -6.72{col 49}{space 3}0.000{col 57}{space 4}-.1531531{col 70}{space 3}-.0839627
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}  .050448{col 29}{space 2} .0129665{col 40}{space 1}    3.89{col 49}{space 3}0.000{col 57}{space 4} .0250241{col 70}{space 3}  .075872
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1828272{col 29}{space 2} .0165896{col 40}{space 1}  -11.02{col 49}{space 3}0.000{col 57}{space 4}-.2153551{col 70}{space 3}-.1502993
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} 3.52e-06{col 29}{space 2} .0140639{col 40}{space 1}    0.00{col 49}{space 3}1.000{col 57}{space 4}-.0275721{col 70}{space 3} .0275791
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0161205{col 29}{space 2} .0126658{col 40}{space 1}    1.27{col 49}{space 3}0.203{col 57}{space 4}-.0087138{col 70}{space 3} .0409549
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0245423{col 29}{space 2} .0106012{col 40}{space 1}    2.32{col 49}{space 3}0.021{col 57}{space 4} .0037562{col 70}{space 3} .0453284
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0250798{col 29}{space 2} .0118473{col 40}{space 1}    2.12{col 49}{space 3}0.034{col 57}{space 4} .0018504{col 70}{space 3} .0483093
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}  .001873{col 29}{space 2} .0036411{col 40}{space 1}    0.51{col 49}{space 3}0.607{col 57}{space 4}-.0052662{col 70}{space 3} .0090123
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0207106{col 29}{space 2} .0033771{col 40}{space 1}    6.13{col 49}{space 3}0.000{col 57}{space 4} .0140889{col 70}{space 3} .0273323
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0068118{col 29}{space 2} .0027131{col 40}{space 1}   -2.51{col 49}{space 3}0.012{col 57}{space 4}-.0121315{col 70}{space 3}-.0014921
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0351672{col 29}{space 2} .0028567{col 40}{space 1}   12.31{col 49}{space 3}0.000{col 57}{space 4}  .029566{col 70}{space 3} .0407684
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0905536{col 29}{space 2} .0197254{col 40}{space 1}    4.59{col 49}{space 3}0.000{col 57}{space 4} .0518773{col 70}{space 3} .1292299
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0544833{col 29}{space 2} .0262671{col 40}{space 1}    2.07{col 49}{space 3}0.038{col 57}{space 4} .0029803{col 70}{space 3} .1059862
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0409394{col 29}{space 2}  .033719{col 40}{space 1}    1.21{col 49}{space 3}0.225{col 57}{space 4}-.0251746{col 70}{space 3} .1070534
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4049247{col 29}{space 2} .0334495{col 40}{space 1}   12.11{col 49}{space 3}0.000{col 57}{space 4} .3393389{col 70}{space 3} .4705104
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est19{txt} stored)
(4,722 missing values generated)
(17,192 missing values generated)
(21,742 missing values generated)
(189 real changes made)
(376 real changes made)
(443 real changes made)
(522 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_county.gph saved)

{com}. 
.  lag_coeff, variable(first_dma) reg_var(president_year party_diff) title(DMA) figure(11) name(lag_dma)
{p 0 6 2}{txt}note: 1930.year#c.percent_nonwhite omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.percent_urban omitted because of collinearity{p_end}
{p 0 6 2}note: 1930.year#c.log_pop omitted because of collinearity{p_end}
{p 0 6 2}note: 1928.year omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    16,706
{txt}{col 49}F({res}  22{txt},{res}   3069{txt}){col 67}= {res}    411.97
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9314
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9158
{txt}{col 49}Root MSE{col 67}= {res}    0.0608

{txt}{ralign 81:(Std. Err. adjusted for {res:3,070} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0132109{col 29}{space 2} .0062891{col 40}{space 1}   -2.10{col 49}{space 3}0.036{col 57}{space 4}-.0255422{col 70}{space 3}-.0008797
{txt}interest_minus1 {c |}{col 17}{res}{space 2} -.010718{col 29}{space 2} .0048086{col 40}{space 1}   -2.23{col 49}{space 3}0.026{col 57}{space 4}-.0201463{col 70}{space 3}-.0012896
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0073499{col 29}{space 2}  .003696{col 40}{space 1}    1.99{col 49}{space 3}0.047{col 57}{space 4} .0001031{col 70}{space 3} .0145968
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0086738{col 29}{space 2} .0034278{col 40}{space 1}    2.53{col 49}{space 3}0.011{col 57}{space 4} .0019527{col 70}{space 3} .0153949
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0007767{col 29}{space 2} .0030389{col 40}{space 1}   -0.26{col 49}{space 3}0.798{col 57}{space 4}-.0067353{col 70}{space 3} .0051818
{txt}{space 1}president_year {c |}{col 17}{res}{space 2}-.1605656{col 29}{space 2} .0311826{col 40}{space 1}   -5.15{col 49}{space 3}0.000{col 57}{space 4}-.2217065{col 70}{space 3}-.0994247
{txt}{space 5}party_diff {c |}{col 17}{res}{space 2}-.3759264{col 29}{space 2} .0314773{col 40}{space 1}  -11.94{col 49}{space 3}0.000{col 57}{space 4}-.4376451{col 70}{space 3}-.3142077
{txt}{space 15} {c |}
{space 11}year#{c |}
{space 13}c. {c |}
percent_nonwh~e {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0267729{col 29}{space 2} .0193486{col 40}{space 1}    1.38{col 49}{space 3}0.167{col 57}{space 4}-.0111646{col 70}{space 3} .0647103
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.1188365{col 29}{space 2} .0178293{col 40}{space 1}   -6.67{col 49}{space 3}0.000{col 57}{space 4}-.1537951{col 70}{space 3}-.0838778
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0499964{col 29}{space 2} .0129362{col 40}{space 1}    3.86{col 49}{space 3}0.000{col 57}{space 4} .0246319{col 70}{space 3} .0753609
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}-.1835423{col 29}{space 2} .0166063{col 40}{space 1}  -11.05{col 49}{space 3}0.000{col 57}{space 4}-.2161029{col 70}{space 3}-.1509817
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year#{c |}
c.percent_urban {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0001736{col 29}{space 2}  .013906{col 40}{space 1}    0.01{col 49}{space 3}0.990{col 57}{space 4}-.0270924{col 70}{space 3} .0274396
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0173458{col 29}{space 2} .0127017{col 40}{space 1}    1.37{col 49}{space 3}0.172{col 57}{space 4}-.0075588{col 70}{space 3} .0422505
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0258482{col 29}{space 2} .0106507{col 40}{space 1}    2.43{col 49}{space 3}0.015{col 57}{space 4}  .004965{col 70}{space 3} .0467315
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0246249{col 29}{space 2} .0118331{col 40}{space 1}    2.08{col 49}{space 3}0.038{col 57}{space 4} .0014233{col 70}{space 3} .0478265
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 1}year#c.log_pop {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} .0029711{col 29}{space 2} .0036227{col 40}{space 1}    0.82{col 49}{space 3}0.412{col 57}{space 4} -.004132{col 70}{space 3} .0100742
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0205402{col 29}{space 2} .0033232{col 40}{space 1}    6.18{col 49}{space 3}0.000{col 57}{space 4} .0140243{col 70}{space 3} .0270561
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0070374{col 29}{space 2} .0027231{col 40}{space 1}   -2.58{col 49}{space 3}0.010{col 57}{space 4}-.0123767{col 70}{space 3}-.0016981
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0352796{col 29}{space 2} .0028573{col 40}{space 1}   12.35{col 49}{space 3}0.000{col 57}{space 4} .0296772{col 70}{space 3} .0408821
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2} .0921974{col 29}{space 2} .0192305{col 40}{space 1}    4.79{col 49}{space 3}0.000{col 57}{space 4} .0544914{col 70}{space 3} .1299034
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} .0685566{col 29}{space 2} .0260812{col 40}{space 1}    2.63{col 49}{space 3}0.009{col 57}{space 4} .0174182{col 70}{space 3}  .119695
{txt}{space 10}1928  {c |}{col 17}{res}{space 2}        0{col 29}{txt}  (omitted)
{space 10}1930  {c |}{col 17}{res}{space 2} .0529099{col 29}{space 2} .0335172{col 40}{space 1}    1.58{col 49}{space 3}0.115{col 57}{space 4}-.0128085{col 70}{space 3} .1186284
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3929381{col 29}{space 2} .0332688{col 40}{space 1}   11.81{col 49}{space 3}0.000{col 57}{space 4} .3277068{col 70}{space 3} .4581694
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3070 categories)
({res}est20{txt} stored)
(4,722 missing values generated)
(539 missing values generated)
(21,742 missing values generated)
(388 real changes made)
(793 real changes made)
(2,501 real changes made)
(1,283 real changes made)
(4,380 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_dma.gph saved)

{com}.  ** Now do this for county level ** 
.  
.  
. 
. save "${c -(}output{c )-}final_analysis", replace 
{txt}file ~/Google Drive/Mass Media/Lily/Output/final_analysis.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/6_radio_reg.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Feb 2017, 18:25:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}