{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/6_set_up_analysis.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Mar 2017, 17:25:19
{txt}
{com}. 
. global input "~/Google Drive/Mass Media/Lily/Data/"
{txt}
{com}. global temp "~/Google Drive/Mass Media/Lily/Temp/"
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. 
. 
. *** reshape for analysis 
. loc year = "1910 1912 1912 1914 1916 1916 1918 1920 1920 1922 1924 1924 1926 1928 1928 1930 1932 1932 1934 1936 1936 1938 1940 1940 1942 1944 1944 1946 1948 1948 1950"
{txt}
{com}. loc pres = "0100100100100100100100100100100"
{txt}
{com}. 
. 
. loc j = 1
{txt}
{com}. forvalues i = 1/31 {c -(}
{txt}  2{com}.  use "${c -(}output{c )-}panel_data.dta", clear
{txt}  3{com}.  rename (dem`i' rep`i' total_vote`i' percent_vote`i') (Democrat Republican overall turnout)
{txt}  4{com}. drop dem* rep* total_vote* percent_vote*
{txt}  5{com}. gen presidential = substr("`pres'", `i', 1)
{txt}  6{com}. gen year= substr("`year'", `j', 4)
{txt}  7{com}. loc j = `j' + 5
{txt}  8{com}. 
. save "${c -(}temp{c )-}part`i'", replace
{txt}  9{com}. {c )-}
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part1.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part2.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part3.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part4.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part5.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part6.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part7.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part8.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part9.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part10.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part11.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part12.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part13.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part14.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part15.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part16.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part17.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part18.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part19.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part20.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part21.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part22.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part23.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part24.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part25.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part26.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part27.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part28.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part29.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part30.dta saved
{res}{txt}file ~/Google Drive/Mass Media/Lily/Temp/part31.dta saved

{com}. 
.         forvalues i = 1/30 {c -(}
{txt}  2{com}.                 append using "${c -(}temp{c )-}part`i'"
{txt}  3{com}.         {c )-}
{txt}(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)
(label V1 already defined)

{com}.         destring year, replace
{txt}year: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}.         destring presidential, replace
{txt}presidential: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}.         assert !missing(year)
{txt}
{com}. 
. gen dma_ind = 1 if first_dma <= year & !missing(first_dma)
{txt}(31,807 missing values generated)

{com}. replace dma_ind = 0 if missing(dma_ind)
{txt}(31,807 real changes made)

{com}. gen county_ind = 1 if first_county <= year & !missing(first_county) 
{txt}(83,297 missing values generated)

{com}. replace county_ind = 0 if missing(county_ind)
{txt}(83,297 real changes made)

{com}. 
. ** Create variables of interest ***  
. bys year: egen president_year = max(presidential)
{txt}
{com}.  
.         gen interest = dma_ind*(year-first_dma)
{txt}(2,387 missing values generated)

{com}.         replace interest = . if mi(dmaindex)
{txt}(5,177 real changes made, 5,177 to missing)

{com}. 
. gen interest_county = county_ind*(year-first_county)
{txt}(76,291 missing values generated)

{com}. replace interest_county = 0 if county_ind ==0 
{txt}(76,291 real changes made)

{com}. egen county_id = group(county state)
{txt}
{com}. egen county_year = group(county_id year)
{txt}
{com}. label var turnout "Overall Turnout" 
{txt}
{com}. 
. save "${c -(}output{c )-}analysis", replace
{txt}file ~/Google Drive/Mass Media/Lily/Output/analysis.dta saved

{com}. 
. replace turnout = turnout/100
{txt}(90,256 real changes made)

{com}. 
.  merge m:1 county state using "${c -(}input{c )-}census_part1", keep(1 3) nogen keepusing(area urb930 totpop density area tillit10 totunemp whtot)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             558
{txt}{col 9}from master{col 30}{res}             558{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}          95,852{txt}  
{col 5}{hline 41}

{com}.  gen percent_urban = urb930/totpop
{txt}(558 missing values generated)

{com}.  gen percent_nonwhite = 1-(whtot/totpop)
{txt}(558 missing values generated)

{com}.  gen percent_illit = tillit10/totpop
{txt}(558 missing values generated)

{com}.  gen percent_unemploy = totunemp/totpop
{txt}(558 missing values generated)

{com}.  gen log_pop = log(totpop)
{txt}(372 missing values generated)

{com}. label var log_pop "Log Population" 
{txt}
{com}. 
. preserve
{txt}
{com}. keep famtot totpop year dma_ind county state
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(31,100 observations deleted)

{com}. isid year county state
{txt}
{com}. bys year: egen total_pop  = sum(totpop)
{txt}
{com}. qui sum total_pop
{txt}
{com}. assert r(min) == r(max) 
{txt}
{com}. loc j= r(min)
{txt}
{com}. collapse (sum) famtot totpop, by(year dma_ind)
{txt}
{com}. keep if dma_ind == 1
{txt}(21 observations deleted)

{com}. keep if year >= 1920 & year <= 1930
{txt}(10 observations deleted)

{com}. gen percentage_broad = totpop/`j'*100
{txt}
{com}. sort year
{txt}
{com}. loc i = round(`j'/1000000)
{txt}
{com}. scatter  percentage_broad year, title("Same DMA Broadcasting") subtitle("Total Population `i' Million") ytitle("Percentage of Population") connect(l) ysc(range(0 100)) ylabel(0(10)100) ///
> title("Same DMA Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_access", replace) 
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_access.gph saved)

{com}. restore
{txt}
{com}. 
. preserve
{txt}
{com}. keep famtot totpop year county_ind county state
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(31,100 observations deleted)

{com}. isid year county state
{txt}
{com}. bys year: egen total_pop  = sum(totpop)
{txt}
{com}. qui sum total_pop
{txt}
{com}. assert r(min) == r(max) 
{txt}
{com}. loc j= r(min)
{txt}
{com}. collapse (sum) famtot totpop, by(year county_ind)
{txt}
{com}. keep if county_ind == 1
{txt}(21 observations deleted)

{com}. keep if year >= 1920 & year <= 1930
{txt}(10 observations deleted)

{com}. gen percentage_broad = totpop/`j'*100
{txt}
{com}. sort year
{txt}
{com}. loc i = round(`j'/1000000)
{txt}
{com}. scatter  percentage_broad year, title("Same County Broadcasting") subtitle("Total Population `i' Million") ytitle("Percentage of Population") connect(l) ysc(range(0 100)) ylabel(0(10)100) ///
> title("Same County Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access", replace) 
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access.gph saved)

{com}. restore
{txt}
{com}. 
. 
.  ** Include absolute percentage differences between replubican and democrat percentages
.  gen percent_rep = Republican/overall
{txt}(18,173 missing values generated)

{com}.  replace percent_rep = . if percent_rep > 1
{txt}(15 real changes made, 15 to missing)

{com}.  gen percent_dem = Democrat/overall 
{txt}(7,274 missing values generated)

{com}.  replace percent_dem = . if percent_dem > 1
{txt}(424 real changes made, 424 to missing)

{com}.  
.  gen party_diff = abs(percent_rep - percent_dem) 
{txt}(20,328 missing values generated)

{com}. label var party_diff "Party Difference"
{txt}
{com}. label var interest "Years Broadcasting"
{txt}
{com}. 
. 
. gen interest_dma = interest_county if dma_ind == 1
{txt}(31,807 missing values generated)

{com}. count if dma_ind == 1 & county_ind == 0
  {res}51,490
{txt}
{com}. assert dma_ind != 0 if county_ind ==1
{txt}
{com}. lab var dma_ind "DMA Broadcasting"
{txt}
{com}. 
. gen interest_pres_county = interest_county*president_year
{txt}
{com}. gen interest_pres = interest*president_year
{txt}(7,564 missing values generated)

{com}. label var interest_pres "Years Broadcasting * Presidential"
{txt}
{com}. 
. label var interest_pres_county "Pres. Interaction"
{txt}
{com}. gen interest_sq = interest*interest
{txt}(7,564 missing values generated)

{com}. label var interest_sq "Quadratic Years Broadcasting"
{txt}
{com}. 
. gen county_sq = interest_county * interest_county
{txt}
{com}. 
. ///drop if (year < 1921 | year > 1931)
> 
. foreach var in  percent_urban percent_nonwhite log_pop party_diff{c -(}
{txt}  2{com}. gen inter_`var' = interest_county * `var'
{txt}  3{com}. gen dma_inter_`var' = interest* `var'
{txt}  4{com}. {c )-}
{txt}(558 missing values generated)
(7,781 missing values generated)
(558 missing values generated)
(7,781 missing values generated)
(372 missing values generated)
(7,595 missing values generated)
(20,328 missing values generated)
(24,767 missing values generated)

{com}. 
. 
. preserve
{txt}
{com}. keep first_dma first_county county state_code percent_nonwhite percent_illit log_pop state
{txt}
{com}. duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}. isid state county 
{txt}
{com}. save "${c -(}temp{c )-}merge_newspaper", replace
{txt}file ~/Google Drive/Mass Media/Lily/Temp/merge_newspaper.dta saved

{com}. restore
{txt}
{com}. 
. label var inter_percent_nonwhite "Percent Nonwhite"
{txt}
{com}. label var inter_percent_urban "Percent Urban"
{txt}
{com}. label var inter_log_pop "Log Population"
{txt}
{com}. lab var interest_county "Years Broadcasting"
{txt}
{com}. lab var turnout "Turnout"
{txt}
{com}. label var interest_pres_county "Years Broadcasting * Presidential Year" 
{txt}
{com}. label var dma_ind "DMA Broadcasting"
{txt}
{com}. label var county_sq "Quadratic Years Broadcasting"
{txt}
{com}.  label var president_year "Presidential Year"
{txt}
{com}.  label var dma_inter_percent_urban "Percent Urban * Years Broadcasting"
{txt}
{com}.  label var dma_inter_percent_nonwhite "Percent Nonwhite * Years Broadcasting" 
{txt}
{com}.  label var dma_inter_log_pop "Log Population * Years Broadcasting" 
{txt}
{com}.  
. 
. 
.  save "${c -(}output{c )-}analysis_setup", replace
{txt}file ~/Google Drive/Mass Media/Lily/Output/analysis_setup.dta saved

{com}.  
.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. keep famtot totpop year county_ind county state
{txt}
{com}. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(31,100 observations deleted)

{com}. isid year county state
{txt}
{com}. bys year: egen total_pop  = sum(totpop)
{txt}
{com}. qui sum total_pop
{txt}
{com}. assert r(min) == r(max) 
{txt}
{com}. loc j= r(min)
{txt}
{com}. collapse (sum) famtot totpop, by(year county_ind)
{txt}
{com}. keep if county_ind == 1
{txt}(21 observations deleted)

{com}. keep if year >= 1920 & year <= 1930
{txt}(10 observations deleted)

{com}. gen percentage_broad = totpop/`j'*100
{txt}
{com}. sort year
{txt}
{com}. loc i = round(`j'/1000000)
{txt}
{com}. scatter  percentage_broad year, title("Same County Broadcasting") subtitle("Total Population `i' Million") ytitle("Percentage of Population") connect(l) ysc(range(0 100)) ylabel(0(10)100) ///
> title("Same County Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access", replace) 
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. scatter  percentage_broad year, title("Same County Broadcasting") subtitle("Total Population `i' Million") ytitle("Percentage of Population") connect(l) ysc(range(30 70)) ylabel(0(10)100) ///
> title("Same County Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access", replace) 
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. scatter  percentage_broad year, title("Same County Broadcasting") subtitle("Total Population `i' Million") ytitle("Percentage of Population") connect(l) ysc(range(30 70)) ylabel(30(10)70) ///
> title("Same County Broadcasting Available to 1930 Population") saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access", replace) 
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/scatter_population_county_access.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. global input "~/Google Drive/Mass Media/Lily/Data/"
{txt}
{com}. global temp "~/Google Drive/Mass Media/Lily/Temp/"
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. 
. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_setup", clear
{txt}
{com}. 
. **** Group for counties and DMAs****
. gen group = 1  if (first_county <= 1923)
{txt}(84,909 missing values generated)

{com}. replace group = 2 if (first_county >= 1924 & first_county <= 1931) 
{txt}(8,618 real changes made)

{com}. replace group = 3 if first_county > 1931
{txt}(76,291 real changes made)

{com}. 
.         assert !mi(group) 
{txt}
{com}. 
. gen group_dma = 1  if (first_dma <= 1923) & !mi(dmaindex)
{txt}(21,483 missing values generated)

{com}. replace group_dma = 2 if (first_dma >= 1924 & first_dma <= 1931) & !mi(dmaindex)
{txt}(13,919 real changes made)

{com}. replace group_dma = 3 if first_dma > 1931 & !mi(dmaindex)
{txt}(2,387 real changes made)

{com}. 
. assert mi(group_dma) if mi(dmaindex)
{txt}
{com}. assert mi(dmaindex) if mi(group_dma)
{txt}
{com}. 
. ****************************************************
. 
. forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.         gen inter_2_`i' = (group == 2 & year == `i')
{txt}  3{com}.         gen inter_2_dma_`i'= (group_dma == 2 & year == `i') 
{txt}  4{com}.         gen inter_3_`i' = (group == 3 & year == `i')
{txt}  5{com}.         gen inter_3_dma_`i'= (group_dma == 3 & year == `i') 
{txt}  6{com}.                 {c )-}
{txt}
{com}.                 
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. 
.         preserve
{txt}
{com}.                 keep group totpop county_id
{txt}
{com}.                 duplicates drop 

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(93,300 observations deleted)

{com}.                 isid county_id
{txt}
{com}.                 gen scal_totpop = totpop/1000000
{txt}(12 missing values generated)

{com}.                 graph hbar (sum) scal_totpop , over(group) ytitle("Population (Millions)") title("Waves of Radio by 1930 Population") 
{res}{txt}
{com}.         restore 
{txt}
{com}. 
{txt}end of do-file

{com}. {res}{com}do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. drop if year > 1942
{txt}(18,660 observations deleted)

{com}. drop if year < 1918
{txt}(18,660 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    56,827
{txt}{col 49}F({res}  36{txt},{res}  53693{txt}){col 67}= {res}   1673.71
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9089
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9036
{txt}{col 49}Root MSE{col 67}= {res}    0.0771

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0110254{col 26}{space 2} .0076824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.026083{col 67}{space 3} .0040323
{txt}inter_2_1922 {c |}{col 14}{res}{space 2}-.0182409{col 26}{space 2} .0090294{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 54}{space 4}-.0359385{col 67}{space 3}-.0005433
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0241161{col 26}{space 2} .0076752{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0391597{col 67}{space 3}-.0090726
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0163277{col 26}{space 2} .0088266{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4} -.033628{col 67}{space 3} .0009725
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0284931{col 26}{space 2} .0076674{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0435213{col 67}{space 3}-.0134649
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0115352{col 26}{space 2} .0088077{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.0287984{col 67}{space 3} .0057279
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0221397{col 26}{space 2} .0076636{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0371603{col 67}{space 3}-.0071191
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}-.0126546{col 26}{space 2} .0087989{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0299005{col 67}{space 3} .0045913
{txt}inter_2_1936 {c |}{col 14}{res}{space 2}-.0375301{col 26}{space 2} .0076761{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0525753{col 67}{space 3}-.0224849
{txt}inter_2_1938 {c |}{col 14}{res}{space 2}-.0315424{col 26}{space 2} .0087989{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0487883{col 67}{space 3}-.0142965
{txt}inter_2_1940 {c |}{col 14}{res}{space 2}-.0431042{col 26}{space 2} .0076726{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0581427{col 67}{space 3}-.0280658
{txt}inter_2_1942 {c |}{col 14}{res}{space 2}-.0242168{col 26}{space 2} .0088212{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0415064{col 67}{space 3}-.0069271
{txt}inter_3_1920 {c |}{col 14}{res}{space 2}-.0194017{col 26}{space 2}  .005426{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.0300367{col 67}{space 3}-.0087667
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0204252{col 26}{space 2} .0063584{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0328878{col 67}{space 3}-.0079626
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0481934{col 26}{space 2} .0054195{col 37}{space 1}   -8.89{col 46}{space 3}0.000{col 54}{space 4}-.0588156{col 67}{space 3}-.0375711
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0159413{col 26}{space 2} .0062344{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.0281607{col 67}{space 3}-.0037219
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0692393{col 26}{space 2} .0054115{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-.0798458{col 67}{space 3}-.0586327
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0060307{col 26}{space 2} .0062189{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0182198{col 67}{space 3} .0061584
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0426674{col 26}{space 2} .0054079{col 37}{space 1}   -7.89{col 46}{space 3}0.000{col 54}{space 4}-.0532668{col 67}{space 3}-.0320679
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}-.0363328{col 26}{space 2} .0062085{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-.0485016{col 67}{space 3} -.024164
{txt}inter_3_1936 {c |}{col 14}{res}{space 2} -.067853{col 26}{space 2} .0054098{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0784563{col 67}{space 3}-.0572496
{txt}inter_3_1938 {c |}{col 14}{res}{space 2}-.0680111{col 26}{space 2} .0062087{col 37}{space 1}  -10.95{col 46}{space 3}0.000{col 54}{space 4}-.0801803{col 67}{space 3}-.0558419
{txt}inter_3_1940 {c |}{col 14}{res}{space 2}-.0796134{col 26}{space 2} .0054188{col 37}{space 1}  -14.69{col 46}{space 3}0.000{col 54}{space 4}-.0902344{col 67}{space 3}-.0689924
{txt}inter_3_1942 {c |}{col 14}{res}{space 2}-.0445641{col 26}{space 2} .0062251{col 37}{space 1}   -7.16{col 46}{space 3}0.000{col 54}{space 4}-.0567655{col 67}{space 3}-.0323628
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1298029{col 26}{space 2} .0050219{col 37}{space 1}   25.85{col 46}{space 3}0.000{col 54}{space 4} .1199599{col 67}{space 3} .1396458
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0062647{col 26}{space 2} .0058949{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0052893{col 67}{space 3} .0178187
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1247983{col 26}{space 2} .0050186{col 37}{space 1}   24.87{col 46}{space 3}0.000{col 54}{space 4} .1149618{col 67}{space 3} .1346349
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0229049{col 26}{space 2}   .00578{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0342338{col 67}{space 3}-.0115761
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1890121{col 26}{space 2} .0050106{col 37}{space 1}   37.72{col 46}{space 3}0.000{col 54}{space 4} .1791912{col 67}{space 3} .1988329
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0105116{col 26}{space 2} .0057653{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0007885{col 67}{space 3} .0218117
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2033879{col 26}{space 2} .0050076{col 37}{space 1}   40.62{col 46}{space 3}0.000{col 54}{space 4} .1935729{col 67}{space 3} .2132029
{txt}{space 7}1934  {c |}{col 14}{res}{space 2} .1026868{col 26}{space 2} .0057582{col 37}{space 1}   17.83{col 46}{space 3}0.000{col 54}{space 4} .0914008{col 67}{space 3} .1139729
{txt}{space 7}1936  {c |}{col 14}{res}{space 2} .2387371{col 26}{space 2} .0050076{col 37}{space 1}   47.67{col 46}{space 3}0.000{col 54}{space 4} .2289221{col 67}{space 3} .2485521
{txt}{space 7}1938  {c |}{col 14}{res}{space 2} .1164667{col 26}{space 2} .0057582{col 37}{space 1}   20.23{col 46}{space 3}0.000{col 54}{space 4} .1051807{col 67}{space 3} .1277528
{txt}{space 7}1940  {c |}{col 14}{res}{space 2} .2569515{col 26}{space 2} .0050145{col 37}{space 1}   51.24{col 46}{space 3}0.000{col 54}{space 4}  .247123{col 67}{space 3}   .26678
{txt}{space 7}1942  {c |}{col 14}{res}{space 2}-.0241735{col 26}{space 2} .0057724{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.0354875{col 67}{space 3}-.0128595
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3755097{col 26}{space 2} .0015039{col 37}{space 1}  249.69{col 46}{space 3}0.000{col 54}{space 4}  .372562{col 67}{space 3} .3784574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 53693) = {res}   152.466   0.000        {txt}(3098 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. gen group_2 = . 
{txt}(59,090 missing values generated)

{com}. gen group_3 = . 
{txt}(59,090 missing values generated)

{com}.         forvalues i = 1920(2)1942 {c -(}
{txt}  2{com}.                 replace group_2 = _b[inter_2_`i'] if year == `i' & group == 2
{txt}  3{com}.                 replace group_3 = _b[inter_3_`i'] if year == `i' & group == 3
{txt}  4{com}. 
.                 {c )-}
{txt}(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)
(556 real changes made)
(4,922 real changes made)
(278 real changes made)
(2,461 real changes made)

{com}.         sort year
{txt}
{com}. 
.         sort year
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) xline(1924) xline(1932)) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) ) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922) xline(1929)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 0 & year <= 1932 & year >= 1918, connect(l) xline(1922)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 1 & year <= 1932, connect(l) ) ///
> (scatter group_3 year if president_year == 1 & year <= 1932, connect(l) xline(1922)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Presidential Year Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter group_2 year if president_year == 0 & year <= 1932 & year >= 1918, connect(l) xline(1922)) ///
> (scatter group_3 year if president_year == 0 & year <= 1932, connect(l) xline(1922)), ///
> ytitle("Year-Group Interaction") subtitle("Relative to First Group to Receive Radio") ///
>  note("Year and county controls") xtitle("Year") title("Non-Presidential Year Turnout: Year-Group Interaction") legend(lab(1 "Group 2") lab(2 "Group 3"))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. keep if year >= 1920 & year <= 1931     
{txt}(31,100 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. gen dma_avail = year > first_dma if !mi(first_dma)
{txt}(693 missing values generated)

{com}. replace dma_avail = 0 if mi(first_dma)
{txt}(693 real changes made)

{com}.         
. label var dma_avail "DMA Access"
{txt}
{com}. 
. eststo: areg turnout dma_avail i.year, absorb(county_id) vce(cluster dmaindex)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    25,541
{txt}{col 49}F({res}   6{txt},{res}    201{txt}){col 67}= {res}    129.13
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9048
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8923
{txt}{col 49}Root MSE{col 67}= {res}    0.0750

{txt}{ralign 78:(Std. Err. adjusted for {res:202} clusters in dmaindex)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}dma_avail {c |}{col 14}{res}{space 2} .0051429{col 26}{space 2} .0077206{col 37}{space 1}    0.67{col 46}{space 3}0.506{col 54}{space 4}-.0100808{col 67}{space 3} .0203666
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1922  {c |}{col 14}{res}{space 2}-.1231853{col 26}{space 2} .0089605{col 37}{space 1}  -13.75{col 46}{space 3}0.000{col 54}{space 4}-.1408541{col 67}{space 3}-.1055166
{txt}{space 7}1924  {c |}{col 14}{res}{space 2}-.0331205{col 26}{space 2} .0085161{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0499129{col 67}{space 3}-.0163281
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.1564047{col 26}{space 2} .0102593{col 37}{space 1}  -15.25{col 46}{space 3}0.000{col 54}{space 4}-.1766344{col 67}{space 3} -.136175
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0119297{col 26}{space 2} .0096216{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.0070426{col 67}{space 3}  .030902
{txt}{space 7}1930  {c |}{col 14}{res}{space 2}-.1156636{col 26}{space 2} .0103529{col 37}{space 1}  -11.17{col 46}{space 3}0.000{col 54}{space 4}-.1360779{col 67}{space 3}-.0952493
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4997222{col 26}{space 2} .0056835{col 37}{space 1}   87.93{col 46}{space 3}0.000{col 54}{space 4} .4885153{col 67}{space 3} .5109291
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (2941 categories)
({res}est1{txt} stored)

{com}. eststo: areg turnout dma_avail i.year if president_year == 1 , absorb(county_id) vce(cluster dmaindex)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    17,163
{txt}{col 49}F({res}   3{txt},{res}    201{txt}){col 67}= {res}     44.36
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9177
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9009
{txt}{col 49}Root MSE{col 67}= {res}    0.0695

{txt}{ralign 78:(Std. Err. adjusted for {res:202} clusters in dmaindex)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}dma_avail {c |}{col 14}{res}{space 2} .0102599{col 26}{space 2} .0111587{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-.0117433{col 67}{space 3}  .032263
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1924  {c |}{col 14}{res}{space 2} -.037117{col 26}{space 2} .0106676{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4}-.0581517{col 67}{space 3}-.0160823
{txt}{space 7}1928  {c |}{col 14}{res}{space 2}  .007332{col 26}{space 2} .0119811{col 37}{space 1}    0.61{col 46}{space 3}0.541{col 54}{space 4}-.0162926{col 67}{space 3} .0309567
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4994486{col 26}{space 2} .0050141{col 37}{space 1}   99.61{col 46}{space 3}0.000{col 54}{space 4} .4895617{col 67}{space 3} .5093356
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (2911 categories)
({res}est2{txt} stored)

{com}. eststo: areg turnout dma_avail i.year if president_year == 0 , absorb(county_id) vce(cluster dmaindex)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}     8,378
{txt}{col 49}F({res}   3{txt},{res}    201{txt}){col 67}= {res}     35.59
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9478
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9195
{txt}{col 49}Root MSE{col 67}= {res}    0.0627

{txt}{ralign 78:(Std. Err. adjusted for {res:202} clusters in dmaindex)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}dma_avail {c |}{col 14}{res}{space 2}-.0015679{col 26}{space 2} .0066678{col 37}{space 1}   -0.24{col 46}{space 3}0.814{col 54}{space 4}-.0147158{col 67}{space 3} .0115799
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1926  {c |}{col 14}{res}{space 2}-.0269985{col 26}{space 2} .0050233{col 37}{space 1}   -5.37{col 46}{space 3}0.000{col 54}{space 4}-.0369036{col 67}{space 3}-.0170934
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0131405{col 26}{space 2} .0070291{col 37}{space 1}    1.87{col 46}{space 3}0.063{col 54}{space 4}-.0007197{col 67}{space 3} .0270007
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3770264{col 26}{space 2} .0041412{col 37}{space 1}   91.04{col 46}{space 3}0.000{col 54}{space 4} .3688606{col 67}{space 3} .3851921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (2938 categories)
({res}est3{txt} stored)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. gen radio = year >= first_county if !mi(first_county)
{txt}(22,149 missing values generated)

{com}. replace radio = 0 if mi(first_county)
{txt}(22,149 real changes made)

{com}. assert !mi(radio)
{txt}
{com}. 
{txt}end of do-file

{com}. tab radio

      {txt}radio {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     24,612       87.93       87.93
{txt}          1 {c |}{res}      3,378       12.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     27,990      100.00

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. eststo: areg turnout radio i.year, absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    26,842
{txt}{col 49}F({res}   6{txt},{res}   3095{txt}){col 67}= {res}   1408.14
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9093
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8975
{txt}{col 49}Root MSE{col 67}= {res}    0.0744

{txt}{ralign 78:(Std. Err. adjusted for {res:3,096} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2} .0154665{col 26}{space 2} .0031527{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} .0092848{col 67}{space 3} .0216482
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1922  {c |}{col 14}{res}{space 2}-.1234882{col 26}{space 2} .0024812{col 37}{space 1}  -49.77{col 46}{space 3}0.000{col 54}{space 4}-.1283531{col 67}{space 3}-.1186233
{txt}{space 7}1924  {c |}{col 14}{res}{space 2}-.0308659{col 26}{space 2} .0019492{col 37}{space 1}  -15.84{col 46}{space 3}0.000{col 54}{space 4}-.0346877{col 67}{space 3}-.0270442
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.1525139{col 26}{space 2}  .002582{col 37}{space 1}  -59.07{col 46}{space 3}0.000{col 54}{space 4}-.1575765{col 67}{space 3}-.1474513
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0151351{col 26}{space 2} .0022915{col 37}{space 1}    6.60{col 46}{space 3}0.000{col 54}{space 4}  .010642{col 67}{space 3} .0196282
{txt}{space 7}1930  {c |}{col 14}{res}{space 2}-.1115763{col 26}{space 2} .0026462{col 37}{space 1}  -42.16{col 46}{space 3}0.000{col 54}{space 4}-.1167648{col 67}{space 3}-.1063879
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4888256{col 26}{space 2} .0014814{col 37}{space 1}  329.98{col 46}{space 3}0.000{col 54}{space 4}  .485921{col 67}{space 3} .4917301
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (3096 categories)
({res}est4{txt} stored)

{com}. eststo: areg turnout radio i.year if president_year == 1 , absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   3{txt},{res}   3059{txt}){col 67}= {res}    444.38
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9235
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9078
{txt}{col 49}Root MSE{col 67}= {res}    0.0685

{txt}{ralign 78:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2} .0332549{col 26}{space 2} .0039319{col 37}{space 1}    8.46{col 46}{space 3}0.000{col 54}{space 4} .0255456{col 67}{space 3} .0409643
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1924  {c |}{col 14}{res}{space 2}-.0331965{col 26}{space 2} .0020454{col 37}{space 1}  -16.23{col 46}{space 3}0.000{col 54}{space 4}-.0372071{col 67}{space 3} -.029186
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0117534{col 26}{space 2} .0024039{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4}   .00704{col 67}{space 3} .0164668
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4885033{col 26}{space 2} .0013008{col 37}{space 1}  375.53{col 46}{space 3}0.000{col 54}{space 4} .4859527{col 67}{space 3} .4910539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (3060 categories)
({res}est5{txt} stored)

{com}. eststo: areg turnout radio i.year if president_year == 0 , absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}     8,801
{txt}{col 49}F({res}   3{txt},{res}   3091{txt}){col 67}= {res}    191.75
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9497
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9224
{txt}{col 49}Root MSE{col 67}= {res}    0.0623

{txt}{ralign 78:(Std. Err. adjusted for {res:3,092} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2}-.0086718{col 26}{space 2} .0048421{col 37}{space 1}   -1.79{col 46}{space 3}0.073{col 54}{space 4}-.0181659{col 67}{space 3} .0008222
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1926  {c |}{col 14}{res}{space 2}-.0263113{col 26}{space 2} .0021039{col 37}{space 1}  -12.51{col 46}{space 3}0.000{col 54}{space 4}-.0304365{col 67}{space 3}-.0221861
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0147036{col 26}{space 2} .0025245{col 37}{space 1}    5.82{col 46}{space 3}0.000{col 54}{space 4} .0097537{col 67}{space 3} .0196535
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3675564{col 26}{space 2} .0013658{col 37}{space 1}  269.11{col 46}{space 3}0.000{col 54}{space 4} .3648784{col 67}{space 3} .3702344
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (3092 categories)
({res}est6{txt} stored)

{com}. 
{txt}end of do-file

{com}. esttab est4 est5 est6, labels
{err}option {bf:labels} not allowed
{txt}{search r(198), local:r(198);}

{com}. esttab est4 est5 est6, label 
{res}
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                          Turnout         Turnout         Turnout   
{txt}{hline 68}
{txt}radio               {res}       0.0155***       0.0333***     -0.00867   {txt}
                    {res} {ralign 12:{txt:(}4.91{txt:)}}    {ralign 12:{txt:(}8.46{txt:)}}    {ralign 12:{txt:(}-1.79{txt:)}}   {txt}

{txt}year=1920           {res}            0               0                   {txt}
                    {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}year=1922           {res}       -0.123***                            0   {txt}
                    {res} {ralign 12:{txt:(}-49.77{txt:)}}                    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}year=1924           {res}      -0.0309***      -0.0332***                {txt}
                    {res} {ralign 12:{txt:(}-15.84{txt:)}}    {ralign 12:{txt:(}-16.23{txt:)}}                   {txt}

{txt}year=1926           {res}       -0.153***                      -0.0263***{txt}
                    {res} {ralign 12:{txt:(}-59.07{txt:)}}                    {ralign 12:{txt:(}-12.51{txt:)}}   {txt}

{txt}year=1928           {res}       0.0151***       0.0118***                {txt}
                    {res} {ralign 12:{txt:(}6.60{txt:)}}    {ralign 12:{txt:(}4.89{txt:)}}                   {txt}

{txt}year=1930           {res}       -0.112***                       0.0147***{txt}
                    {res} {ralign 12:{txt:(}-42.16{txt:)}}                    {ralign 12:{txt:(}5.82{txt:)}}   {txt}

{txt}Constant            {res}        0.489***        0.489***        0.368***{txt}
                    {res} {ralign 12:{txt:(}329.98{txt:)}}    {ralign 12:{txt:(}375.53{txt:)}}    {ralign 12:{txt:(}269.11{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        26842           18041            8801   {txt}
{txt}{hline 68}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. help esttab

.  esttab est4 est5 est6, label  r2
{res}
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                          Turnout         Turnout         Turnout   
{txt}{hline 68}
{txt}radio               {res}       0.0155***       0.0333***     -0.00867   {txt}
                    {res} {ralign 12:{txt:(}4.91{txt:)}}    {ralign 12:{txt:(}8.46{txt:)}}    {ralign 12:{txt:(}-1.79{txt:)}}   {txt}

{txt}year=1920           {res}            0               0                   {txt}
                    {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}year=1922           {res}       -0.123***                            0   {txt}
                    {res} {ralign 12:{txt:(}-49.77{txt:)}}                    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}year=1924           {res}      -0.0309***      -0.0332***                {txt}
                    {res} {ralign 12:{txt:(}-15.84{txt:)}}    {ralign 12:{txt:(}-16.23{txt:)}}                   {txt}

{txt}year=1926           {res}       -0.153***                      -0.0263***{txt}
                    {res} {ralign 12:{txt:(}-59.07{txt:)}}                    {ralign 12:{txt:(}-12.51{txt:)}}   {txt}

{txt}year=1928           {res}       0.0151***       0.0118***                {txt}
                    {res} {ralign 12:{txt:(}6.60{txt:)}}    {ralign 12:{txt:(}4.89{txt:)}}                   {txt}

{txt}year=1930           {res}       -0.112***                       0.0147***{txt}
                    {res} {ralign 12:{txt:(}-42.16{txt:)}}                    {ralign 12:{txt:(}5.82{txt:)}}   {txt}

{txt}Constant            {res}        0.489***        0.489***        0.368***{txt}
                    {res} {ralign 12:{txt:(}329.98{txt:)}}    {ralign 12:{txt:(}375.53{txt:)}}    {ralign 12:{txt:(}269.11{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        26842           18041            8801   {txt}
{txt}R-squared           {res}        0.909           0.923           0.950   {txt}
{txt}{hline 68}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. help esttab

. help esttab

.  esttab radio est4 est5 est6, label  r2
{err}estimation result radio not found
{txt}{search r(111), local:r(111);}

{com}. help esttab

. esttab radio est4 est5 est6, label  r2 se
{err}estimation result radio not found
{txt}{search r(111), local:r(111);}

{com}.  esttab  est4 est5 est6, label  r2 se
{res}
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                          Turnout         Turnout         Turnout   
{txt}{hline 68}
{txt}radio               {res}       0.0155***       0.0333***     -0.00867   {txt}
                    {res} {ralign 12:{txt:(}0.00315{txt:)}}    {ralign 12:{txt:(}0.00393{txt:)}}    {ralign 12:{txt:(}0.00484{txt:)}}   {txt}

{txt}year=1920           {res}            0               0                   {txt}
                    {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}year=1922           {res}       -0.123***                            0   {txt}
                    {res} {ralign 12:{txt:(}0.00248{txt:)}}                    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}year=1924           {res}      -0.0309***      -0.0332***                {txt}
                    {res} {ralign 12:{txt:(}0.00195{txt:)}}    {ralign 12:{txt:(}0.00205{txt:)}}                   {txt}

{txt}year=1926           {res}       -0.153***                      -0.0263***{txt}
                    {res} {ralign 12:{txt:(}0.00258{txt:)}}                    {ralign 12:{txt:(}0.00210{txt:)}}   {txt}

{txt}year=1928           {res}       0.0151***       0.0118***                {txt}
                    {res} {ralign 12:{txt:(}0.00229{txt:)}}    {ralign 12:{txt:(}0.00240{txt:)}}                   {txt}

{txt}year=1930           {res}       -0.112***                       0.0147***{txt}
                    {res} {ralign 12:{txt:(}0.00265{txt:)}}                    {ralign 12:{txt:(}0.00252{txt:)}}   {txt}

{txt}Constant            {res}        0.489***        0.489***        0.368***{txt}
                    {res} {ralign 12:{txt:(}0.00148{txt:)}}    {ralign 12:{txt:(}0.00130{txt:)}}    {ralign 12:{txt:(}0.00137{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        26842           18041            8801   {txt}
{txt}R-squared           {res}        0.909           0.923           0.950   {txt}
{txt}{hline 68}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. egen group_fixed= group(year county_id)
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. eststo: areg turnout radio, absorb(group_fixed) vce(cluster county_id)
{txt}note: radio omitted because of collinearity
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    26,842
{txt}{col 49}{help j_robustsingular##|_new:F(   0,   3095)}{col 67}=          {res}.
{txt}{col 49}Prob > F{col 67}=          {res}.
{txt}{col 49}R-squared{col 67}= {res}    0.9866
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9596
{txt}{col 49}Root MSE{col 67}= {res}    0.0467

{txt}{ralign 78:(Std. Err. adjusted for {res:3,096} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .4448163{col 26}{space 2} 1.20e-19{col 37}{space 1} 3.7e+18{col 46}{space 3}0.000{col 54}{space 4} .4448163{col 67}{space 3} .4448163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
 group_fixed {c |}   absorbed                                   (17960 categories)
({res}est7{txt} stored)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.         program_fit, var(1)
{err}command {bf}program_fit{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. save "${c -(}output{c )-}final_analysis", replace 
{txt}file ~/Google Drive/Mass Media/Lily/Output/final_analysis.dta saved

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. use "${c -(}output{c )-}analysis_part2", clear
{txt}
{com}. 
. drop if year > 1932
{txt}(21,770 observations deleted)

{com}. 
. areg turnout inter_2_19*  inter_3_19* i.year, absorb(county_id)
{p 0 6 2}{txt}note: inter_2_1934 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_2_1936 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_2_1938 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_2_1940 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_2_1942 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_3_1934 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_3_1936 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_3_1938 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_3_1940 omitted because of collinearity{p_end}
{p 0 6 2}note: inter_3_1942 omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    35,649
{txt}{col 49}F({res}  21{txt},{res}  32530{txt}){col 67}= {res}   1453.57
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9100
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9014
{txt}{col 49}Root MSE{col 67}= {res}    0.0741

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
inter_2_1920 {c |}{col 14}{res}{space 2}-.0105646{col 26}{space 2}  .007383{col 37}{space 1}   -1.43{col 46}{space 3}0.152{col 54}{space 4}-.0250356{col 67}{space 3} .0039063
{txt}inter_2_1922 {c |}{col 14}{res}{space 2} -.017155{col 26}{space 2} .0086835{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0341751{col 67}{space 3}-.0001349
{txt}inter_2_1924 {c |}{col 14}{res}{space 2}-.0234075{col 26}{space 2} .0073775{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-.0378676{col 67}{space 3}-.0089473
{txt}inter_2_1926 {c |}{col 14}{res}{space 2}-.0160934{col 26}{space 2} .0084828{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}  -.03272{col 67}{space 3} .0005332
{txt}inter_2_1928 {c |}{col 14}{res}{space 2}-.0275107{col 26}{space 2} .0073705{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-.0419571{col 67}{space 3}-.0130643
{txt}inter_2_1930 {c |}{col 14}{res}{space 2}-.0107947{col 26}{space 2} .0084663{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4} -.027389{col 67}{space 3} .0057996
{txt}inter_2_1932 {c |}{col 14}{res}{space 2}-.0212833{col 26}{space 2}  .007369{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.0357267{col 67}{space 3}-.0068399
{txt}inter_2_1934 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_2_1936 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_2_1938 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_2_1940 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_2_1942 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_3_1920 {c |}{col 14}{res}{space 2}-.0213578{col 26}{space 2} .0052146{col 37}{space 1}   -4.10{col 46}{space 3}0.000{col 54}{space 4}-.0315786{col 67}{space 3} -.011137
{txt}inter_3_1922 {c |}{col 14}{res}{space 2}-.0212098{col 26}{space 2} .0061146{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-.0331946{col 67}{space 3} -.009225
{txt}inter_3_1924 {c |}{col 14}{res}{space 2}-.0498515{col 26}{space 2} .0052095{col 37}{space 1}   -9.57{col 46}{space 3}0.000{col 54}{space 4}-.0600622{col 67}{space 3}-.0396407
{txt}inter_3_1926 {c |}{col 14}{res}{space 2}-.0176467{col 26}{space 2} .0059915{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.0293903{col 67}{space 3}-.0059031
{txt}inter_3_1928 {c |}{col 14}{res}{space 2}-.0708466{col 26}{space 2} .0052027{col 37}{space 1}  -13.62{col 46}{space 3}0.000{col 54}{space 4}-.0810441{col 67}{space 3}-.0606492
{txt}inter_3_1930 {c |}{col 14}{res}{space 2}-.0072353{col 26}{space 2} .0059792{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-.0189547{col 67}{space 3} .0044841
{txt}inter_3_1932 {c |}{col 14}{res}{space 2}-.0444053{col 26}{space 2} .0052012{col 37}{space 1}   -8.54{col 46}{space 3}0.000{col 54}{space 4}-.0545998{col 67}{space 3}-.0342107
{txt}inter_3_1934 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_3_1936 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_3_1938 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_3_1940 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
inter_3_1942 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 8}year {c |}
{space 7}1920  {c |}{col 14}{res}{space 2} .1286801{col 26}{space 2} .0048255{col 37}{space 1}   26.67{col 46}{space 3}0.000{col 54}{space 4} .1192219{col 67}{space 3} .1381383
{txt}{space 7}1922  {c |}{col 14}{res}{space 2} .0059192{col 26}{space 2} .0056678{col 37}{space 1}    1.04{col 46}{space 3}0.296{col 54}{space 4}  -.00519{col 67}{space 3} .0170283
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} .1235249{col 26}{space 2} .0048232{col 37}{space 1}   25.61{col 46}{space 3}0.000{col 54}{space 4} .1140713{col 67}{space 3} .1329785
{txt}{space 7}1926  {c |}{col 14}{res}{space 2}-.0238172{col 26}{space 2} .0055539{col 37}{space 1}   -4.29{col 46}{space 3}0.000{col 54}{space 4} -.034703{col 67}{space 3}-.0129314
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .1873233{col 26}{space 2} .0048163{col 37}{space 1}   38.89{col 46}{space 3}0.000{col 54}{space 4} .1778831{col 67}{space 3} .1967634
{txt}{space 7}1930  {c |}{col 14}{res}{space 2} .0091853{col 26}{space 2} .0055418{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0016769{col 67}{space 3} .0200475
{txt}{space 7}1932  {c |}{col 14}{res}{space 2} .2015944{col 26}{space 2} .0048149{col 37}{space 1}   41.87{col 46}{space 3}0.000{col 54}{space 4}  .192157{col 67}{space 3} .2110318
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3778994{col 26}{space 2} .0014471{col 37}{space 1}  261.15{col 46}{space 3}0.000{col 54}{space 4} .3750631{col 67}{space 3} .3807357
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}    F(3097, 32530) = {res}    96.420   0.000        {txt}(3098 categories)

{com}. predict county_predict, xb
{txt}
{com}. collapse (mean) county_predict, by(year group president_year) 
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. sort year
{txt}
{com}. twoway (scatter county_predict year if group == 1 & president_year ==1, connect(l)) ///
> (scatter county_predict year if group == 2 & president_year ==1, connect(l)) ///
> (scatter county_predict year if group == 3 & president_year ==1, connect(l)), ///
>  legend(label(1 "Radio: 1922-1923")  label(2 "Radio: 1924-1931") label(3 "Radio: 1932 onward")) title("County: Predicted Turnout") subtitle("Presidential Year") ytitle("Mean Linear Prediction") ///
>  note("Controlling for year-group interaction, year, and county fixed effects")
{res}{txt}
{com}.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.         gen type_election = 1 if presidential == 1 
{err}presidential not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. drop if year == 1918
{txt}(3 observations deleted)

{com}. drop if year == 1932
{txt}(3 observations deleted)

{com}. 
{txt}end of do-file

{com}. tab year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1920 {c |}{res}          3       16.67       16.67
{txt}       1922 {c |}{res}          3       16.67       33.33
{txt}       1924 {c |}{res}          3       16.67       50.00
{txt}       1926 {c |}{res}          3       16.67       66.67
{txt}       1928 {c |}{res}          3       16.67       83.33
{txt}       1930 {c |}{res}          3       16.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         18      100.00

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. 
. use "${c -(}output{c )-}analysis_part2", clear
{txt}
{com}. 
. drop if year > 1932
{txt}(21,770 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. drop if year == 1918
{txt}(3,110 observations deleted)

{com}. drop if year == 1932
{txt}(6,220 observations deleted)

{com}. 
. gen radio = year >= first_county
{txt}
{com}. areg turnout radio i.year if president_year == 1, absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   3{txt},{res}   3059{txt}){col 67}= {res}    444.38
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9235
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9078
{txt}{col 49}Root MSE{col 67}= {res}    0.0685

{txt}{ralign 78:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2} .0332549{col 26}{space 2} .0039319{col 37}{space 1}    8.46{col 46}{space 3}0.000{col 54}{space 4} .0255456{col 67}{space 3} .0409643
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1924  {c |}{col 14}{res}{space 2}-.0331965{col 26}{space 2} .0020454{col 37}{space 1}  -16.23{col 46}{space 3}0.000{col 54}{space 4}-.0372071{col 67}{space 3} -.029186
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0117534{col 26}{space 2} .0024039{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4}   .00704{col 67}{space 3} .0164668
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4885033{col 26}{space 2} .0013008{col 37}{space 1}  375.53{col 46}{space 3}0.000{col 54}{space 4} .4859527{col 67}{space 3} .4910539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (3060 categories)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.  ********* Lag coefficients ************* 
.  cap program drop lag_coeff
{txt}
{com}.  program lag_coeff 
{txt}  1{com}.  
.  syntax, variable(string)   title(string) figure(string) name(string) type(string) [reg_var(string) ]
{txt}  2{com}.  
.  gen interest_0 = (year-`variable')==0 
{txt}  3{com}.  gen interest_1 = (year-`variable') ==1
{txt}  4{com}.   gen interest_2 = (year-`variable') == 2
{txt}  5{com}.  
.  
. 
. gen interest_minus1 = (year-`variable') == -1
{txt}  6{com}. gen interest_minus2 = (year-`variable') == -2
{txt}  7{com}. 
. if `type' == 3 {c -(}
{txt}  8{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year, absorb(county_id) vce(cluster county_id)
{txt}  9{com}.         {c )-}
{txt} 10{com}. 
. if `type' == 1 {c -(}
{txt} 11{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year if president_year == 1, absorb(county_id) vce(cluster county_id)
{txt} 12{com}.         {c )-}
{txt} 13{com}. 
. if `type' == 0 {c -(}
{txt} 14{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year if president_year == 0, absorb(county_id) vce(cluster county_id)
{txt} 15{com}.         {c )-}
{txt} 16{com}.         
. predict prediction, xb
{txt} 17{com}. 
. gen interest_axis = year-`variable'
{txt} 18{com}. 
. 
.  mat define b = e(b)
{txt} 19{com}.  mat define v= e(V)
{txt} 20{com}.  gen coeff = . 
{txt} 21{com}.  gen upper_bound = . 
{txt} 22{com}. gen lower_bound = . 
{txt} 23{com}.  
.  loc j = 1
{txt} 24{com}.  forvalues i = -2/2 {c -(}
{txt} 25{com}.  replace coeff = b[1,`j'] if interest_axis == `i'
{txt} 26{com}.  replace lower_bound = b[1,`j'] - 1.96*sqrt(v[`j', `j']) if interest_axis == `i'
{txt} 27{com}.   replace upper_bound = b[1,`j'] + 1.96*sqrt(v[`j', `j']) if interest_axis == `i'
{txt} 28{com}. 
.         loc j = `j' + 1
{txt} 29{com}.         {c )-}
{txt} 30{com}.         
. sort interest_axis
{txt} 31{com}. 
. 
. twoway (scatter coeff interest_axis, connect(l)) ///
> (scatter upper_bound interest_axis, mcolor(red) msymbol(D)) (scatter lower_bound interest_axis, mcolor(red) msymbol(D) )  if abs(interest_axis) <= 2, ///
> title("Figure `figure': Graph of Lag Coefficients: `title'") ///
> saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/`name'", replace) xtitle("Time Since Broadcasting Introduced (years)") ///
>  ytitle("Voting Turnout") legend(off)
{txt} 32{com}.  
.  drop interest_0 interest_1 interest_2 interest_minus* coeff prediction interest_axis upper_bound lower_bound
{txt} 33{com}.  
.  end
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. twoway (scatter coeff interest_axis, connect(l)) ///
> (scatter upper_bound interest_axis, mcolor(red) msymbol(D)) (scatter lower_bound interest_axis, mcolor(red) msymbol(D) )  if abs(interest_axis) <= 2, ///
> title("Figure `figure': Graph of Lag Coefficients: `title'") ///
> saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/`name'", replace) xtitle("Time Since Broadcasting Introduced (years)") ///
>  ytitle("Voting Turnout") legend(off)
{err}interest_axis not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.  lag_coeff, variable(first_county) title(All Years) figure(1) type(3) name(lag_county)  
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    26,842
{txt}{col 49}F({res}  10{txt},{res}   3095{txt}){col 67}= {res}    846.87
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9093
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8974
{txt}{col 49}Root MSE{col 67}= {res}    0.0744

{txt}{ralign 81:(Std. Err. adjusted for {res:3,096} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2} -.011677{col 29}{space 2} .0051211{col 40}{space 1}   -2.28{col 49}{space 3}0.023{col 57}{space 4}-.0217182{col 70}{space 3}-.0016358
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0007014{col 29}{space 2} .0043209{col 40}{space 1}    0.16{col 49}{space 3}0.871{col 57}{space 4}-.0077708{col 70}{space 3} .0091735
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0008449{col 29}{space 2}   .00449{col 40}{space 1}    0.19{col 49}{space 3}0.851{col 57}{space 4}-.0079587{col 70}{space 3} .0096485
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0127941{col 29}{space 2} .0039249{col 40}{space 1}    3.26{col 49}{space 3}0.001{col 57}{space 4} .0050984{col 70}{space 3} .0204898
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2} .0041041{col 29}{space 2} .0041722{col 40}{space 1}    0.98{col 49}{space 3}0.325{col 57}{space 4}-.0040764{col 70}{space 3} .0122846
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1922  {c |}{col 17}{res}{space 2}-.1230975{col 29}{space 2}  .002531{col 40}{space 1}  -48.64{col 49}{space 3}0.000{col 57}{space 4}  -.12806{col 70}{space 3} -.118135
{txt}{space 10}1924  {c |}{col 17}{res}{space 2}-.0303786{col 29}{space 2} .0019307{col 40}{space 1}  -15.73{col 49}{space 3}0.000{col 57}{space 4}-.0341641{col 70}{space 3}-.0265931
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.1509065{col 29}{space 2} .0025044{col 40}{space 1}  -60.26{col 49}{space 3}0.000{col 57}{space 4}-.1558171{col 70}{space 3} -.145996
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0172086{col 29}{space 2} .0021876{col 40}{space 1}    7.87{col 49}{space 3}0.000{col 57}{space 4} .0129194{col 70}{space 3} .0214979
{txt}{space 10}1930  {c |}{col 17}{res}{space 2}-.1092333{col 29}{space 2} .0025153{col 40}{space 1}  -43.43{col 49}{space 3}0.000{col 57}{space 4}-.1141651{col 70}{space 3}-.1043015
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4895709{col 29}{space 2} .0015488{col 40}{space 1}  316.10{col 49}{space 3}0.000{col 57}{space 4} .4865341{col 70}{space 3} .4926076
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3096 categories)
({res}est8{txt} stored)
(22,149 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_county.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.   lag_coeff, variable(first_county) title(Presidential Years) figure(2) type(1) name(lag_count_pres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   7{txt},{res}   3059{txt}){col 67}= {res}    187.91
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9231
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9073
{txt}{col 49}Root MSE{col 67}= {res}    0.0687

{txt}{ralign 81:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0335799{col 29}{space 2} .0071317{col 40}{space 1}   -4.71{col 49}{space 3}0.000{col 57}{space 4}-.0475633{col 70}{space 3}-.0195966
{txt}interest_minus1 {c |}{col 17}{res}{space 2}   .00106{col 29}{space 2} .0072886{col 40}{space 1}    0.15{col 49}{space 3}0.884{col 57}{space 4}-.0132311{col 70}{space 3} .0153511
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0143697{col 29}{space 2} .0073206{col 40}{space 1}    1.96{col 49}{space 3}0.050{col 57}{space 4}  .000016{col 70}{space 3} .0287234
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0117591{col 29}{space 2} .0044542{col 40}{space 1}    2.64{col 49}{space 3}0.008{col 57}{space 4} .0030256{col 70}{space 3} .0204926
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0164734{col 29}{space 2}  .005741{col 40}{space 1}   -2.87{col 49}{space 3}0.004{col 57}{space 4}  -.02773{col 70}{space 3}-.0052167
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0303717{col 29}{space 2} .0020175{col 40}{space 1}  -15.05{col 49}{space 3}0.000{col 57}{space 4}-.0343275{col 70}{space 3}-.0264158
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0160068{col 29}{space 2} .0022759{col 40}{space 1}    7.03{col 49}{space 3}0.000{col 57}{space 4} .0115445{col 70}{space 3} .0204692
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4906528{col 29}{space 2} .0014207{col 40}{space 1}  345.37{col 49}{space 3}0.000{col 57}{space 4} .4878672{col 70}{space 3} .4934384
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3060 categories)
({res}est9{txt} stored)
(22,149 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_pres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.     lag_coeff, variable(first_county) title(Non-presidential Years) figure(3) type(0) name(lag_count_nonpres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}     8,801
{txt}{col 49}F({res}   7{txt},{res}   3091{txt}){col 67}= {res}     82.11
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9498
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9224
{txt}{col 49}Root MSE{col 67}= {res}    0.0623

{txt}{ralign 81:(Std. Err. adjusted for {res:3,092} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2} .0129123{col 29}{space 2} .0103793{col 40}{space 1}    1.24{col 49}{space 3}0.214{col 57}{space 4}-.0074387{col 70}{space 3} .0332632
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0103755{col 29}{space 2} .0054606{col 40}{space 1}    1.90{col 49}{space 3}0.058{col 57}{space 4}-.0003312{col 70}{space 3} .0210823
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0065692{col 29}{space 2}  .006044{col 40}{space 1}    1.09{col 49}{space 3}0.277{col 57}{space 4}-.0052814{col 70}{space 3} .0184199
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2}-.0129353{col 29}{space 2}  .010447{col 40}{space 1}   -1.24{col 49}{space 3}0.216{col 57}{space 4} -.033419{col 70}{space 3} .0075485
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2} .0095555{col 29}{space 2} .0101605{col 40}{space 1}    0.94{col 49}{space 3}0.347{col 57}{space 4}-.0103665{col 70}{space 3} .0294774
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1926  {c |}{col 17}{res}{space 2}-.0262403{col 29}{space 2} .0021067{col 40}{space 1}  -12.46{col 49}{space 3}0.000{col 57}{space 4}-.0303709{col 70}{space 3}-.0221097
{txt}{space 10}1930  {c |}{col 17}{res}{space 2} .0146014{col 29}{space 2} .0024803{col 40}{space 1}    5.89{col 49}{space 3}0.000{col 57}{space 4} .0097382{col 70}{space 3} .0194647
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3657153{col 29}{space 2} .0015546{col 40}{space 1}  235.25{col 49}{space 3}0.000{col 57}{space 4} .3626671{col 70}{space 3} .3687635
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3092 categories)
({res}est10{txt} stored)
(22,149 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_nonpres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.   lag_coeff, variable(first_county) title(Presidential Years) figure(2) type(1) name(lag_count_pres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   7{txt},{res}   3059{txt}){col 67}= {res}    187.91
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9231
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9073
{txt}{col 49}Root MSE{col 67}= {res}    0.0687

{txt}{ralign 81:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0335799{col 29}{space 2} .0071317{col 40}{space 1}   -4.71{col 49}{space 3}0.000{col 57}{space 4}-.0475633{col 70}{space 3}-.0195966
{txt}interest_minus1 {c |}{col 17}{res}{space 2}   .00106{col 29}{space 2} .0072886{col 40}{space 1}    0.15{col 49}{space 3}0.884{col 57}{space 4}-.0132311{col 70}{space 3} .0153511
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0143697{col 29}{space 2} .0073206{col 40}{space 1}    1.96{col 49}{space 3}0.050{col 57}{space 4}  .000016{col 70}{space 3} .0287234
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0117591{col 29}{space 2} .0044542{col 40}{space 1}    2.64{col 49}{space 3}0.008{col 57}{space 4} .0030256{col 70}{space 3} .0204926
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0164734{col 29}{space 2}  .005741{col 40}{space 1}   -2.87{col 49}{space 3}0.004{col 57}{space 4}  -.02773{col 70}{space 3}-.0052167
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0303717{col 29}{space 2} .0020175{col 40}{space 1}  -15.05{col 49}{space 3}0.000{col 57}{space 4}-.0343275{col 70}{space 3}-.0264158
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0160068{col 29}{space 2} .0022759{col 40}{space 1}    7.03{col 49}{space 3}0.000{col 57}{space 4} .0115445{col 70}{space 3} .0204692
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4906528{col 29}{space 2} .0014207{col 40}{space 1}  345.37{col 49}{space 3}0.000{col 57}{space 4} .4878672{col 70}{space 3} .4934384
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3060 categories)
({res}est11{txt} stored)
(22,149 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(27,990 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_pres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. 
. use "${c -(}output{c )-}analysis_part2", clear
{txt}
{com}. 
. drop if year > 1932
{txt}(21,770 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. drop if year == 1932
{txt}(6,220 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. gen radio = year >= first_county
{txt}
{com}. areg turnout radio i.year if president_year == 1, absorb(county_id) vce(cluster county_id)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   3{txt},{res}   3059{txt}){col 67}= {res}    444.38
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9235
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9078
{txt}{col 49}Root MSE{col 67}= {res}    0.0685

{txt}{ralign 78:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     turnout{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}radio {c |}{col 14}{res}{space 2} .0332549{col 26}{space 2} .0039319{col 37}{space 1}    8.46{col 46}{space 3}0.000{col 54}{space 4} .0255456{col 67}{space 3} .0409643
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}1924  {c |}{col 14}{res}{space 2}-.0331965{col 26}{space 2} .0020454{col 37}{space 1}  -16.23{col 46}{space 3}0.000{col 54}{space 4}-.0372071{col 67}{space 3} -.029186
{txt}{space 7}1928  {c |}{col 14}{res}{space 2} .0117534{col 26}{space 2} .0024039{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4}   .00704{col 67}{space 3} .0164668
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4885033{col 26}{space 2} .0013008{col 37}{space 1}  375.53{col 46}{space 3}0.000{col 54}{space 4} .4859527{col 67}{space 3} .4910539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
   county_id {c |}   absorbed                                    (3060 categories)

{com}. 
. 
.  
.  ********* Lag coefficients ************* 
.  cap program drop lag_coeff
{txt}
{com}.  program lag_coeff 
{txt}  1{com}.  
.  syntax, variable(string)   title(string) figure(string) name(string) type(string) [reg_var(string) ]
{txt}  2{com}.  
.  gen interest_0 = (year-`variable')==0 
{txt}  3{com}.  gen interest_1 = (year-`variable') ==1
{txt}  4{com}.   gen interest_2 = (year-`variable') == 2
{txt}  5{com}.  
.  
. 
. gen interest_minus1 = (year-`variable') == -1
{txt}  6{com}. gen interest_minus2 = (year-`variable') == -2
{txt}  7{com}. 
. if `type' == 3 {c -(}
{txt}  8{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year, absorb(county_id) vce(cluster county_id)
{txt}  9{com}.         {c )-}
{txt} 10{com}. 
. if `type' == 1 {c -(}
{txt} 11{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year if president_year == 1, absorb(county_id) vce(cluster county_id)
{txt} 12{com}.         {c )-}
{txt} 13{com}. 
. if `type' == 0 {c -(}
{txt} 14{com}. eststo: areg  turnout interest_minus2 interest_minus1 interest_0  interest_1 interest_2  `reg_var' i.year if president_year == 0, absorb(county_id) vce(cluster county_id)
{txt} 15{com}.         {c )-}
{txt} 16{com}.         
. predict prediction, xb
{txt} 17{com}. 
. gen interest_axis = year-`variable'
{txt} 18{com}. 
. 
.  mat define b = e(b)
{txt} 19{com}.  mat define v= e(V)
{txt} 20{com}.  gen coeff = . 
{txt} 21{com}.  gen upper_bound = . 
{txt} 22{com}. gen lower_bound = . 
{txt} 23{com}.  
.  loc j = 1
{txt} 24{com}.  forvalues i = -2/2 {c -(}
{txt} 25{com}.  replace coeff = b[1,`j'] if interest_axis == `i'
{txt} 26{com}.  replace lower_bound = b[1,`j'] - 1.96*sqrt(v[`j', `j']) if interest_axis == `i'
{txt} 27{com}.   replace upper_bound = b[1,`j'] + 1.96*sqrt(v[`j', `j']) if interest_axis == `i'
{txt} 28{com}. 
.         loc j = `j' + 1
{txt} 29{com}.         {c )-}
{txt} 30{com}.         
. sort interest_axis
{txt} 31{com}. 
. 
. twoway (scatter coeff interest_axis, connect(l)) ///
> (scatter upper_bound interest_axis, mcolor(red) msymbol(D)) (scatter lower_bound interest_axis, mcolor(red) msymbol(D) )  if abs(interest_axis) <= 2, ///
> title("Figure `figure': Graph of Lag Coefficients: `title'") ///
> saving("/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/`name'", replace) xtitle("Time Since Broadcasting Introduced (years)") ///
>  ytitle("Voting Turnout") legend(off)
{txt} 32{com}.  
.  drop interest_0 interest_1 interest_2 interest_minus* coeff prediction interest_axis upper_bound lower_bound
{txt} 33{com}.  
.  end
{txt}
{com}. 
.  lag_coeff, variable(first_county) title(All Years) figure(1) type(3) name(lag_county)  
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    29,496
{txt}{col 49}F({res}  11{txt},{res}   3097{txt}){col 67}= {res}    864.78
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9029
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8915
{txt}{col 49}Root MSE{col 67}= {res}    0.0761

{txt}{ralign 81:(Std. Err. adjusted for {res:3,098} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0062746{col 29}{space 2} .0047971{col 40}{space 1}   -1.31{col 49}{space 3}0.191{col 57}{space 4}-.0156804{col 70}{space 3} .0031312
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0028883{col 29}{space 2} .0043385{col 40}{space 1}    0.67{col 49}{space 3}0.506{col 57}{space 4}-.0056184{col 70}{space 3}  .011395
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0056267{col 29}{space 2} .0043158{col 40}{space 1}    1.30{col 49}{space 3}0.192{col 57}{space 4}-.0028354{col 70}{space 3} .0140887
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0149186{col 29}{space 2} .0040129{col 40}{space 1}    3.72{col 49}{space 3}0.000{col 57}{space 4} .0070503{col 70}{space 3} .0227869
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2} .0102218{col 29}{space 2} .0040394{col 40}{space 1}    2.53{col 49}{space 3}0.011{col 57}{space 4} .0023016{col 70}{space 3} .0181421
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1920  {c |}{col 17}{res}{space 2} .1120401{col 29}{space 2} .0023454{col 40}{space 1}   47.77{col 49}{space 3}0.000{col 57}{space 4} .1074414{col 70}{space 3} .1166388
{txt}{space 10}1922  {c |}{col 17}{res}{space 2}-.0116829{col 29}{space 2} .0024365{col 40}{space 1}   -4.79{col 49}{space 3}0.000{col 57}{space 4}-.0164603{col 70}{space 3}-.0069056
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0812751{col 29}{space 2} .0022225{col 40}{space 1}   36.57{col 49}{space 3}0.000{col 57}{space 4} .0769174{col 70}{space 3} .0856328
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0388412{col 29}{space 2} .0024023{col 40}{space 1}  -16.17{col 49}{space 3}0.000{col 57}{space 4}-.0435515{col 70}{space 3}-.0341309
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .1293555{col 29}{space 2} .0023599{col 40}{space 1}   54.81{col 49}{space 3}0.000{col 57}{space 4} .1247284{col 70}{space 3} .1339825
{txt}{space 10}1930  {c |}{col 17}{res}{space 2} .0029421{col 29}{space 2} .0023847{col 40}{space 1}    1.23{col 49}{space 3}0.217{col 57}{space 4}-.0017338{col 70}{space 3} .0076179
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3779612{col 29}{space 2} .0017646{col 40}{space 1}  214.19{col 49}{space 3}0.000{col 57}{space 4} .3745013{col 70}{space 3} .3814212
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3098 categories)
({res}est12{txt} stored)
(24,610 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_county.gph saved)

{com}.  
. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.   lag_coeff, variable(first_county) title(Presidential Years) figure(2) type(1) name(lag_count_pres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   7{txt},{res}   3059{txt}){col 67}= {res}    187.91
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9231
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9073
{txt}{col 49}Root MSE{col 67}= {res}    0.0687

{txt}{ralign 81:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0335799{col 29}{space 2} .0071317{col 40}{space 1}   -4.71{col 49}{space 3}0.000{col 57}{space 4}-.0475633{col 70}{space 3}-.0195966
{txt}interest_minus1 {c |}{col 17}{res}{space 2}   .00106{col 29}{space 2} .0072886{col 40}{space 1}    0.15{col 49}{space 3}0.884{col 57}{space 4}-.0132311{col 70}{space 3} .0153511
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0143697{col 29}{space 2} .0073206{col 40}{space 1}    1.96{col 49}{space 3}0.050{col 57}{space 4}  .000016{col 70}{space 3} .0287234
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0117591{col 29}{space 2} .0044542{col 40}{space 1}    2.64{col 49}{space 3}0.008{col 57}{space 4} .0030256{col 70}{space 3} .0204926
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0164734{col 29}{space 2}  .005741{col 40}{space 1}   -2.87{col 49}{space 3}0.004{col 57}{space 4}  -.02773{col 70}{space 3}-.0052167
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0303717{col 29}{space 2} .0020175{col 40}{space 1}  -15.05{col 49}{space 3}0.000{col 57}{space 4}-.0343275{col 70}{space 3}-.0264158
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0160068{col 29}{space 2} .0022759{col 40}{space 1}    7.03{col 49}{space 3}0.000{col 57}{space 4} .0115445{col 70}{space 3} .0204692
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4906528{col 29}{space 2} .0014207{col 40}{space 1}  345.37{col 49}{space 3}0.000{col 57}{space 4} .4878672{col 70}{space 3} .4934384
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3060 categories)
({res}est13{txt} stored)
(24,610 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_pres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.  lag_coeff, variable(first_county) title(All Years) figure(1) type(3) name(lag_county)  
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    29,496
{txt}{col 49}F({res}  11{txt},{res}   3097{txt}){col 67}= {res}    864.78
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9029
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8915
{txt}{col 49}Root MSE{col 67}= {res}    0.0761

{txt}{ralign 81:(Std. Err. adjusted for {res:3,098} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0062746{col 29}{space 2} .0047971{col 40}{space 1}   -1.31{col 49}{space 3}0.191{col 57}{space 4}-.0156804{col 70}{space 3} .0031312
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0028883{col 29}{space 2} .0043385{col 40}{space 1}    0.67{col 49}{space 3}0.506{col 57}{space 4}-.0056184{col 70}{space 3}  .011395
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0056267{col 29}{space 2} .0043158{col 40}{space 1}    1.30{col 49}{space 3}0.192{col 57}{space 4}-.0028354{col 70}{space 3} .0140887
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0149186{col 29}{space 2} .0040129{col 40}{space 1}    3.72{col 49}{space 3}0.000{col 57}{space 4} .0070503{col 70}{space 3} .0227869
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2} .0102218{col 29}{space 2} .0040394{col 40}{space 1}    2.53{col 49}{space 3}0.011{col 57}{space 4} .0023016{col 70}{space 3} .0181421
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1920  {c |}{col 17}{res}{space 2} .1120401{col 29}{space 2} .0023454{col 40}{space 1}   47.77{col 49}{space 3}0.000{col 57}{space 4} .1074414{col 70}{space 3} .1166388
{txt}{space 10}1922  {c |}{col 17}{res}{space 2}-.0116829{col 29}{space 2} .0024365{col 40}{space 1}   -4.79{col 49}{space 3}0.000{col 57}{space 4}-.0164603{col 70}{space 3}-.0069056
{txt}{space 10}1924  {c |}{col 17}{res}{space 2} .0812751{col 29}{space 2} .0022225{col 40}{space 1}   36.57{col 49}{space 3}0.000{col 57}{space 4} .0769174{col 70}{space 3} .0856328
{txt}{space 10}1926  {c |}{col 17}{res}{space 2}-.0388412{col 29}{space 2} .0024023{col 40}{space 1}  -16.17{col 49}{space 3}0.000{col 57}{space 4}-.0435515{col 70}{space 3}-.0341309
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .1293555{col 29}{space 2} .0023599{col 40}{space 1}   54.81{col 49}{space 3}0.000{col 57}{space 4} .1247284{col 70}{space 3} .1339825
{txt}{space 10}1930  {c |}{col 17}{res}{space 2} .0029421{col 29}{space 2} .0023847{col 40}{space 1}    1.23{col 49}{space 3}0.217{col 57}{space 4}-.0017338{col 70}{space 3} .0076179
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3779612{col 29}{space 2} .0017646{col 40}{space 1}  214.19{col 49}{space 3}0.000{col 57}{space 4} .3745013{col 70}{space 3} .3814212
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3098 categories)
({res}est14{txt} stored)
(24,610 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_county.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.   lag_coeff, variable(first_county) title(Presidential Years) figure(2) type(1) name(lag_count_pres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    18,041
{txt}{col 49}F({res}   7{txt},{res}   3059{txt}){col 67}= {res}    187.91
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9231
{txt}{col 49}Adj R-squared{col 67}= {res}    0.9073
{txt}{col 49}Root MSE{col 67}= {res}    0.0687

{txt}{ralign 81:(Std. Err. adjusted for {res:3,060} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2}-.0335799{col 29}{space 2} .0071317{col 40}{space 1}   -4.71{col 49}{space 3}0.000{col 57}{space 4}-.0475633{col 70}{space 3}-.0195966
{txt}interest_minus1 {c |}{col 17}{res}{space 2}   .00106{col 29}{space 2} .0072886{col 40}{space 1}    0.15{col 49}{space 3}0.884{col 57}{space 4}-.0132311{col 70}{space 3} .0153511
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0143697{col 29}{space 2} .0073206{col 40}{space 1}    1.96{col 49}{space 3}0.050{col 57}{space 4}  .000016{col 70}{space 3} .0287234
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2} .0117591{col 29}{space 2} .0044542{col 40}{space 1}    2.64{col 49}{space 3}0.008{col 57}{space 4} .0030256{col 70}{space 3} .0204926
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2}-.0164734{col 29}{space 2}  .005741{col 40}{space 1}   -2.87{col 49}{space 3}0.004{col 57}{space 4}  -.02773{col 70}{space 3}-.0052167
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1924  {c |}{col 17}{res}{space 2}-.0303717{col 29}{space 2} .0020175{col 40}{space 1}  -15.05{col 49}{space 3}0.000{col 57}{space 4}-.0343275{col 70}{space 3}-.0264158
{txt}{space 10}1928  {c |}{col 17}{res}{space 2} .0160068{col 29}{space 2} .0022759{col 40}{space 1}    7.03{col 49}{space 3}0.000{col 57}{space 4} .0115445{col 70}{space 3} .0204692
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .4906528{col 29}{space 2} .0014207{col 40}{space 1}  345.37{col 49}{space 3}0.000{col 57}{space 4} .4878672{col 70}{space 3} .4934384
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3060 categories)
({res}est15{txt} stored)
(24,610 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_pres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}.     lag_coeff, variable(first_county) title(Non-presidential Years) figure(3) type(0) name(lag_count_nonpres)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    11,455
{txt}{col 49}F({res}   8{txt},{res}   3093{txt}){col 67}= {res}     81.60
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.9213
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8921
{txt}{col 49}Root MSE{col 67}= {res}    0.0725

{txt}{ralign 81:(Std. Err. adjusted for {res:3,094} clusters in county_id)}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}        turnout{col 17}{c |}      Coef.{col 29}   Std. Err.{col 41}      t{col 49}   P>|t|{col 57}     [95% Con{col 70}f. Interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
interest_minus2 {c |}{col 17}{res}{space 2} .0100182{col 29}{space 2} .0084183{col 40}{space 1}    1.19{col 49}{space 3}0.234{col 57}{space 4}-.0064877{col 70}{space 3} .0265242
{txt}interest_minus1 {c |}{col 17}{res}{space 2} .0106364{col 29}{space 2} .0051322{col 40}{space 1}    2.07{col 49}{space 3}0.038{col 57}{space 4} .0005735{col 70}{space 3} .0206993
{txt}{space 5}interest_0 {c |}{col 17}{res}{space 2} .0093393{col 29}{space 2}  .005338{col 40}{space 1}    1.75{col 49}{space 3}0.080{col 57}{space 4}-.0011271{col 70}{space 3} .0198056
{txt}{space 5}interest_1 {c |}{col 17}{res}{space 2}-.0145432{col 29}{space 2} .0110859{col 40}{space 1}   -1.31{col 49}{space 3}0.190{col 57}{space 4}-.0362797{col 70}{space 3} .0071933
{txt}{space 5}interest_2 {c |}{col 17}{res}{space 2} .0064577{col 29}{space 2} .0091403{col 40}{space 1}    0.71{col 49}{space 3}0.480{col 57}{space 4}-.0114641{col 70}{space 3} .0243794
{txt}{space 15} {c |}
{space 11}year {c |}
{space 10}1922  {c |}{col 17}{res}{space 2} -.012295{col 29}{space 2} .0026695{col 40}{space 1}   -4.61{col 49}{space 3}0.000{col 57}{space 4}-.0175292{col 70}{space 3}-.0070608
{txt}{space 10}1926  {c |}{col 17}{res}{space 2} -.037144{col 29}{space 2} .0027033{col 40}{space 1}  -13.74{col 49}{space 3}0.000{col 57}{space 4}-.0424445{col 70}{space 3}-.0318435
{txt}{space 10}1930  {c |}{col 17}{res}{space 2} .0035646{col 29}{space 2} .0026901{col 40}{space 1}    1.33{col 49}{space 3}0.185{col 57}{space 4}  -.00171{col 70}{space 3} .0088393
{txt}{space 15} {c |}
{space 10}_cons {c |}{col 17}{res}{space 2} .3789428{col 29}{space 2} .0018389{col 40}{space 1}  206.07{col 49}{space 3}0.000{col 57}{space 4} .3753371{col 70}{space 3} .3825484
{txt}{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      county_id {c |}   absorbed                                    (3094 categories)
({res}est16{txt} stored)
(24,610 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(31,100 missing values generated)
(589 real changes made)
(589 real changes made)
(589 real changes made)
(375 real changes made)
(375 real changes made)
(375 real changes made)
(443 real changes made)
(443 real changes made)
(443 real changes made)
(520 real changes made)
(520 real changes made)
(520 real changes made)
(533 real changes made)
(533 real changes made)
(533 real changes made)
{res}{txt}(file /Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/plots/lag_count_nonpres.gph saved)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. 
. log using  "/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/2_county_town_crosswalk", replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. import excel "${c -(}input{c )-}CT_county.xlsx", firstrow clear
{res}{err}file /Users/lilyhoffman/Google Drive/Mass Media/Lily/Data/CT_county.xlsx not found
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. global input "~/Google Drive/Mass Media/Lily/Data/State County Lists/"
{txt}
{com}. global output "~/Google Drive/Mass Media/Lily/Output/"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. import excel "${c -(}input{c )-}CT_county.xlsx", firstrow clear
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/2x/fs4lmbxs7713s496c_r7qxf40000gn/T//SD00245.000000"
{txt}
{com}. import excel "${c -(}input{c )-}ME_county.xlsx",  firstrow clear
{res}{txt}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/lilyhoffman/Documents/Mass-Media-Independent-Research/Lily/logfiles/6_set_up_analysis.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Apr 2017, 13:31:18
{txt}{.-}
{smcl}
{txt}{sf}{ul off}